#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_VertexID              0   x           0   VERTID    uint   x   
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
;
; shader debug name: 4bedf92cfe67a1f19b8d63016025c075.pdb
; shader hash: 4bedf92cfe67a1f19b8d63016025c075
;
; Pipeline Runtime Information: 
;
; Vertex Shader
; OutputPositionPresent=1
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_VertexID              0                              
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
;
; Buffer Definitions:
;
; cbuffer DrawPushConstantCB
; {
;
;   struct dx.alignment.legacy.DrawPushConstantCB
;   {
;
;       struct dx.alignment.legacy.struct.DrawPushConstant
;       {
;
;           uint InstanceBufferIndex;                 ; Offset:    0
;           uint GeometryBufferIndex;                 ; Offset:    4
;           column_major float4x4 ViewProjMatrix;     ; Offset:   16
;       

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc 1.2", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !25)
!1 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc\5CDepthPathVS.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17}
!17 = !DISubprogram(name: "main", scope: !1, file: !1, line: 60, type: !18, isLocal: false, isDefinition: true, scopeLine: 62, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !23}
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "VsOutput", file: !1, line: 55, size: 128, align: 32, elements: !21)
!21 = !{!22}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !20, file: !1, line: 57, baseType: !4, size: 128, align: 32)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, baseType: !24)
!24 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!25 = !{!26, !58, !76}
!26 = !DIGlobalVariable(name: "MeshInstanceSB", linkageName: "\01?MeshInstanceSB@@3V?$StructuredBuffer@UMeshInstanceData@@@@A", scope: !0, file: !1, line: 50, type: !27, isLocal: false, isDefinition: true)
!27 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<MeshInstanceData>", file: !1, line: 50, size: 640, align: 32, elements: !2, templateParams: !28)
!28 = !{!29}
!29 = !DITemplateTypeParameter(name: "element", type: !30)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshInstanceData", file: !1, line: 34, size: 640, align: 32, elements: !31)
!31 = !{!32, !33, !34, !35, !36}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "FirstGeometryIndex", scope: !30, file: !1, line: 36, baseType: !23, size: 32, align: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "NumGeometries", scope: !30, file: !1, line: 37, baseType: !23, size: 32, align: 32, offset: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_padding", scope: !30, file: !1, line: 38, baseType: !23, size: 32, align: 32, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_padding1", scope: !30, file: !1, line: 39, baseType: !23, size: 32, align: 32, offset: 96)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "Transform", scope: !30, file: !1, line: 43, baseType: !37, size: 512, align: 32, offset: 128)
!37 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 65, size: 512, align: 32, elements: !38, templateParams: !55)
!38 = !{!39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !37, file: !1, line: 65, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !37, file: !1, line: 65, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !37, file: !1, line: 65, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !37, file: !1, line: 65, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !37, file: !1, line: 65, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !37, file: !1, line: 65, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !37, file: !1, line: 65, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !37, file: !1, line: 65, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !37, file: !1, line: 65, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !37, file: !1, line: 65, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !37, file: !1, line: 65, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !37, file: !1, line: 65, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !37, file: !1, line: 65, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !37, file: !1, line: 65, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !37, file: !1, line: 65, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !37, file: !1, line: 65, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!55 = !{!13, !56, !57}
!56 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!57 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!58 = !DIGlobalVariable(name: "GeometrySB", linkageName: "\01?GeometrySB@@3V?$StructuredBuffer@UGeometryData@@@@A", scope: !0, file: !1, line: 51, type: !59, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<GeometryData>"* @"\01?GeometrySB@@3V?$StructuredBuffer@UGeometryData@@@@A")
!59 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<GeometryData>", file: !1, line: 51, size: 384, align: 32, elements: !2, templateParams: !60)
!60 = !{!61}
!61 = !DITemplateTypeParameter(name: "element", type: !62)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "GeometryData", file: !1, line: 10, size: 384, align: 32, elements: !63)
!63 = !{!64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "NumIndices", scope: !62, file: !1, line: 12, baseType: !23, size: 32, align: 32)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "NumVertices", scope: !62, file: !1, line: 13, baseType: !23, size: 32, align: 32, offset: 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "IndexBufferIndex", scope: !62, file: !1, line: 14, baseType: !23, size: 32, align: 32, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "IndexOffset", scope: !62, file: !1, line: 15, baseType: !23, size: 32, align: 32, offset: 96)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "VertexBufferIndex", scope: !62, file: !1, line: 19, baseType: !15, size: 32, align: 32, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "PositionOffset", scope: !62, file: !1, line: 20, baseType: !23, size: 32, align: 32, offset: 160)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoordOffset", scope: !62, file: !1, line: 21, baseType: !23, size: 32, align: 32, offset: 192)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "NormalOffset", scope: !62, file: !1, line: 22, baseType: !23, size: 32, align: 32, offset: 224)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "TangentOffset", scope: !62, file: !1, line: 26, baseType: !23, size: 32, align: 32, offset: 256)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "MaterialIndex", scope: !62, file: !1, line: 27, baseType: !23, size: 32, align: 32, offset: 288)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_padding", scope: !62, file: !1, line: 28, baseType: !23, size: 32, align: 32, offset: 320)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_padding1", scope: !62, file: !1, line: 29, baseType: !23, size: 32, align: 32, offset: 352)
!76 = !DIGlobalVariable(name: "BufferTable", linkageName: "\01?BufferTable@@3PAUByteAddressBuffer@@A", scope: !0, file: !1, line: 53, type: !77, isLocal: false, isDefinition: true, variable: [0 x %struct.ByteAddressBuffer]* @"\01?BufferTable@@3PAUByteAddressBuffer@@A")
!77 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 32, align: 32, elements: !79)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteAddressBuffer", file: !1, line: 68, size: 32, align: 32, elements: !2)
!79 = !{!80}
!80 = !DISubrange(count: 1)
!81 = !{i32 2, !"Dwarf Version", i32 4}
!82 = !{i32 2, !"Debug Info Version", i32 3}
!83 = !{!"dxc 1.2"}
!84 = !{!"D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc\5CDepthPathVS.hlsl", !"#include \22Defines.hlsli\22\0D\0A\0D\0Astruct DrawPushConstant\0D\0A{\0D\0A    uint InstanceBufferIndex;\0D\0A    uint GeometryBufferIndex;\0D\0A    matrix ViewProjMatrix;\0D\0A};\0D\0A\0D\0Astruct GeometryData\0D\0A{\0D\0A    uint NumIndices;\0D\0A    uint NumVertices;\0D\0A    uint IndexBufferIndex;\0D\0A    uint IndexOffset;\0D\0A\0D\0A\09// -- 16 byte boundary ----\0D\0A\0D\0A    int VertexBufferIndex;\0D\0A    uint PositionOffset;\0D\0A    uint TexCoordOffset;\0D\0A    uint NormalOffset;\0D\0A\0D\0A\09// -- 16 byte boundary ----\0D\0A\0D\0A    uint TangentOffset;\0D\0A    uint MaterialIndex;\0D\0A    uint _padding;\0D\0A    uint _padding1;\0D\0A\0D\0A\09// -- 16 byte boundary ----\0D\0A};\0D\0A\0D\0Astruct MeshInstanceData\0D\0A{\0D\0A    uint FirstGeometryIndex;\0D\0A    uint NumGeometries;\0D\0A    uint _padding;\0D\0A    uint _padding1;\0D\0A\0D\0A\09// -- 16 byte boundary ----\0D\0A\0D\0A    matrix Transform;\0D\0A\0D\0A\09// -- 16 byte boundary ----\0D\0A};\0D\0A\0D\0AConstantBuffer<DrawPushConstant> DrawPushConstantCB : register(b0);\0D\0A\0D\0AStructuredBuffer<MeshInstanceData> MeshInstanceSB : register(t0);\0D\0AStructuredBuffer<GeometryData> GeometrySB : register(t1);\0D\0A\0D\0AByteAddressBuffer BufferTable[] : register(t0, BufferSpace);\0D\0A\0D\0Astruct VsOutput\0D\0A{\0D\0A    float4 Position : SV_POSITION;\0D\0A};\0D\0A\0D\0AVsOutput main(\0D\0A    in uint vertexID : SV_VertexID)\0D\0A{\0D\0A    VsOutput output;\0D\0A    \0D\0A    MeshInstanceData instance = MeshInstanceSB[DrawPushConstantCB.InstanceBufferIndex];\0D\0A    GeometryData geometry = GeometrySB[instance.FirstGeometryIndex + DrawPushConstantCB.GeometryBufferIndex];\0D\0A    \0D\0A    ByteAddressBuffer indexBuffer = BufferTable[geometry.IndexBufferIndex];\0D\0A    ByteAddressBuffer vertexBuffer = BufferTable[geometry.VertexBufferIndex];\0D\0A    \0D\0A    // uint index = indexBuffer.Load(geometry.IndexOffset + vertexID * 4);\0D\0A    uint index = vertexID;\0D\0A    \0D\0A    matrix worldMatrix = instance.Transform;\0D\0A    float4 modelPosition = float4(asfloat(vertexBuffer.Load3(geometry.PositionOffset + index * 12)), 1.0f);\0D\0A    \0D\0A    output.Position = mul(modelPosition, worldMatrix);\0D\0A    output.Position = mul(output.Position, DrawPushConstantCB.ViewProjMatrix);\0D\0A\0D\0A    return output;\0D\0A}"}
!85 = !{!"D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc/Defines.hlsli", !"#ifndef __DEFINES_HLSLI__\0D\0A#define __DEFINES_HLSLI__\0D\0A\0D\0A#define BufferSpace     space100\0D\0A#define Tex2DSpace      space101\0D\0A#define TexCubeSpace    space102\0D\0A\0D\0A#define InvalidDescriptorIndex ~0U\0D\0A\0D\0A\0D\0A#define PI 3.14159265f\0D\0A#endif"}
!86 = !{!"D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc\5CDepthPathVS.hlsl"}
!87 = !{!"/E", !"main", !"/T", !"vs_6_5", !"/Fo", !"D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5Cbuild\5Cx64\5CDebug\5CDepthPathVS.cso", !"/Zi", !"/Od", !"/Qembed_debug"}
!88 = !{i32 1, i32 5}
!89 = !{!"vs", i32 6, i32 5}
!90 = !{!91, null, !97, null}
!91 = !{!92, !94, !96}
