#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; TEXCOORD                 0   xy          0     NONE   float   xy  
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: ec7c51fe81fef3d6673fbd4391907918.pdb
; shader hash: ec7c51fe81fef3d6673fbd4391907918
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; TEXCOORD                 0                 linear       
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Target                0                              
;
; Buffer Definitions:
;
; cbuffer push
; {
;
;   struct dx.alignment.legacy.push
;   {
;
;       struct dx.alignment.legacy.struct.FontDrawInfo
;       {
;
;           column_major float4x4 Mvp;                ; Offset:    0
;           uint ColorPacked;                         ; Offset:   64
;           uint TextureIndex;                        ; Offset:   68
;       

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc 1.2", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !65)
!1 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc\5CFontPS.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!5 = !{!6, !30}
!6 = !DISubprogram(name: "main", scope: !1, file: !1, line: 18, type: !7, isLocal: false, isDefinition: true, scopeLine: 19, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!7 = !DISubroutineType(types: !8)
!8 = !{!9, !20}
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !10)
!10 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !11, templateParams: !16)
!11 = !{!12, !13, !14, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !10, file: !1, baseType: !4, size: 32, align: 32, flags: DIFlagPublic)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !10, file: !1, baseType: !4, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !10, file: !1, baseType: !4, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !10, file: !1, baseType: !4, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!16 = !{!17, !18}
!17 = !DITemplateTypeParameter(name: "element", type: !4)
!18 = !DITemplateValueParameter(name: "element_count", type: !19, value: i32 4)
!19 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "PSInput", file: !1, line: 13, size: 64, align: 32, elements: !21)
!21 = !{!22}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !20, file: !1, line: 15, baseType: !23, size: 64, align: 32)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !25, templateParams: !28)
!25 = !{!26, !27}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !24, file: !1, baseType: !4, size: 32, align: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !24, file: !1, baseType: !4, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!28 = !{!17, !29}
!29 = !DITemplateValueParameter(name: "element_count", type: !19, value: i32 2)
!30 = !DISubprogram(name: "GetColour", linkageName: "\01?GetColour@FontDrawInfo@@QAA?AV?$vector@M$03@@XZ", scope: !32, file: !31, line: 139, type: !62, isLocal: false, isDefinition: true, scopeLine: 140, flags: DIFlagPrototyped, isOptimized: false, declaration: !61)
!31 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc/../Include/Shaders/ShaderInteropStructures.h", directory: "")
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "FontDrawInfo", file: !31, line: 130, size: 576, align: 32, elements: !33)
!33 = !{!34, !57, !60, !61}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "Mvp", scope: !32, file: !31, line: 132, baseType: !35, size: 512, align: 32)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 8, baseType: !36)
!36 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 8, size: 512, align: 32, elements: !37, templateParams: !54)
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !36, file: !1, line: 8, baseType: !4, size: 32, align: 32, flags: DIFlagPublic)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !36, file: !1, line: 8, baseType: !4, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !36, file: !1, line: 8, baseType: !4, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !36, file: !1, line: 8, baseType: !4, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !36, file: !1, line: 8, baseType: !4, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !36, file: !1, line: 8, baseType: !4, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !36, file: !1, line: 8, baseType: !4, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !36, file: !1, line: 8, baseType: !4, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !36, file: !1, line: 8, baseType: !4, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !36, file: !1, line: 8, baseType: !4, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !36, file: !1, line: 8, baseType: !4, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !36, file: !1, line: 8, baseType: !4, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !36, file: !1, line: 8, baseType: !4, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !36, file: !1, line: 8, baseType: !4, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !36, file: !1, line: 8, baseType: !4, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !36, file: !1, line: 8, baseType: !4, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!54 = !{!17, !55, !56}
!55 = !DITemplateValueParameter(name: "row_count", type: !19, value: i32 4)
!56 = !DITemplateValueParameter(name: "col_count", type: !19, value: i32 4)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "ColorPacked", scope: !32, file: !31, line: 135, baseType: !58, size: 32, align: 32, offset: 512)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 15, baseType: !59)
!59 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "TextureIndex", scope: !32, file: !31, line: 136, baseType: !58, size: 32, align: 32, offset: 544)
!61 = !DISubprogram(name: "GetColour", linkageName: "\01?GetColour@FontDrawInfo@@QAA?AV?$vector@M$03@@XZ", scope: !32, file: !31, line: 139, type: !62, isLocal: false, isDefinition: false, scopeLine: 139, flags: DIFlagPrototyped, isOptimized: false)
!62 = !DISubroutineType(types: !63)
!63 = !{!9, !64}
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!65 = !{!66, !74, !77, !80, !82, !83, !84}
!66 = !DIGlobalVariable(name: "ResourceHeap_Texture2D", linkageName: "\01?ResourceHeap_Texture2D@@3PAV?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !67, line: 7, type: !68, isLocal: false, isDefinition: true, variable: [0 x %"class.Texture2D<vector<float, 4> >"]* @"\01?ResourceHeap_Texture2D@@3PAV?$Texture2D@V?$vector@M$03@@@@A")
!67 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc/ResourceHeapTables.hlsli", directory: "")
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 160, align: 32, elements: !72)
!69 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 7, size: 160, align: 32, elements: !2, templateParams: !70)
!70 = !{!71}
!71 = !DITemplateTypeParameter(name: "element", type: !10)
!72 = !{!73}
!73 = !DISubrange(count: 1)
!74 = !DIGlobalVariable(name: "ResourceHeap_TextureCube", linkageName: "\01?ResourceHeap_TextureCube@@3PAV?$TextureCube@V?$vector@M$03@@@@A", scope: !0, file: !67, line: 8, type: !75, isLocal: false, isDefinition: true)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 128, align: 32, elements: !72)
!76 = !DICompositeType(tag: DW_TAG_class_type, name: "TextureCube<vector<float, 4> >", file: !1, line: 8, size: 128, align: 32, elements: !2, templateParams: !70)
!77 = !DIGlobalVariable(name: "ResourceHeap_Buffer", linkageName: "\01?ResourceHeap_Buffer@@3PAUByteAddressBuffer@@A", scope: !0, file: !67, line: 9, type: !78, isLocal: false, isDefinition: true)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 32, align: 32, elements: !72)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteAddressBuffer", file: !1, line: 9, size: 32, align: 32, elements: !2)
!80 = !DIGlobalVariable(name: "ENTITY_TYPE_DIRECTIONALLIGHT", scope: !0, file: !31, line: 15, type: !81, isLocal: true, isDefinition: true)
!81 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!82 = !DIGlobalVariable(name: "ENTITY_TYPE_OMNILIGHT", scope: !0, file: !31, line: 16, type: !81, isLocal: true, isDefinition: true)
!83 = !DIGlobalVariable(name: "ENTITY_TYPE_SPOTLIGHT", scope: !0, file: !31, line: 17, type: !81, isLocal: true, isDefinition: true)
!84 = !DIGlobalVariable(name: "LinearClampSampler", linkageName: "\01?LinearClampSampler@@3USamplerState@@A", scope: !0, file: !1, line: 8, type: !85, isLocal: false, isDefinition: true, variable: %struct.SamplerState* @"\01?LinearClampSampler@@3USamplerState@@A")
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 8, size: 32, align: 32, elements: !2)
!86 = !{i32 2, !"Dwarf Version", i32 4}
!87 = !{i32 2, !"Debug Info Version", i32 3}
!88 = !{!"dxc 1.2"}
