#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; NORMAL                   0   xyz         0     NONE   float   xyz 
; COLOUR                   0   xyzw        1     NONE   float   xyzw
; TEXCOORD                 0   xy          2     NONE   float   xy  
; Position                 0   xyz         3     NONE   float   xyz 
; TANGENT                  0   xyzw        4     NONE   float   xyzw
; MATERIAL                 0   x           5     NONE    uint   x   
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: e3840a986fe8a66e792d8c1d6f8c9a1c.pdb
; shader hash: e3840a986fe8a66e792d8c1d6f8c9a1c
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; NORMAL                   0                 linear       
; COLOUR                   0                 linear       
; TEXCOORD                 0                 linear       
; Position                 0                 linear       
; TANGENT                  0                 linear       

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc 1.2", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !46, globals: !191)
!1 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc\5CGeometryPassPS_Pbr.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !22, !8, !30, !37}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 56, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 56, size: 288, align: 32, elements: !6, templateParams: !17)
!6 = !{!7, !9, !10, !11, !12, !13, !14, !15, !16}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !5, file: !1, line: 56, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !5, file: !1, line: 56, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !5, file: !1, line: 56, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !5, file: !1, line: 56, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !5, file: !1, line: 56, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !5, file: !1, line: 56, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !5, file: !1, line: 56, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !5, file: !1, line: 56, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !5, file: !1, line: 56, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!17 = !{!18, !19, !21}
!18 = !DITemplateTypeParameter(name: "element", type: !8)
!19 = !DITemplateValueParameter(name: "row_count", type: !20, value: i32 3)
!20 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!21 = !DITemplateValueParameter(name: "col_count", type: !20, value: i32 3)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, size: 96, align: 32, elements: !24, templateParams: !28)
!24 = !{!25, !26, !27}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !23, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!28 = !{!18, !29}
!29 = !DITemplateValueParameter(name: "element_count", type: !20, value: i32 3)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !31)
!31 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !32, templateParams: !35)
!32 = !{!33, !34}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !31, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !31, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!35 = !{!18, !36}
!36 = !DITemplateValueParameter(name: "element_count", type: !20, value: i32 2)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !38)
!38 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !39, templateParams: !44)
!39 = !{!40, !41, !42, !43}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !38, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !38, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !38, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !38, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!44 = !{!18, !45}
!45 = !DITemplateValueParameter(name: "element_count", type: !20, value: i32 4)
!46 = !{!47, !61, !92, !93, !123, !136, !158, !159, !160, !161, !165, !168, !171, !174, !184, !187, !190}
!47 = !DISubprogram(name: "main", scope: !1, file: !1, line: 8, type: !48, isLocal: false, isDefinition: true, scopeLine: 9, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!48 = !DISubroutineType(types: !49)
!49 = !{!37, !50}
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "PSInput", file: !51, line: 4, size: 544, align: 32, elements: !52)
!51 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc/GeometryPass.hlsli", directory: "")
!52 = !{!53, !54, !55, !56, !57, !58}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "NormalWS", scope: !50, file: !51, line: 6, baseType: !22, size: 96, align: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !50, file: !51, line: 7, baseType: !37, size: 128, align: 32, offset: 96)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !50, file: !51, line: 8, baseType: !30, size: 64, align: 32, offset: 224)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "PositionWS", scope: !50, file: !51, line: 9, baseType: !22, size: 96, align: 32, offset: 288)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "TangentWS", scope: !50, file: !51, line: 10, baseType: !37, size: 128, align: 32, offset: 384)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "MaterialID", scope: !50, file: !51, line: 11, baseType: !59, size: 32, align: 32, offset: 512)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, baseType: !60)
!60 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!61 = !DISubprogram(name: "LoadMaterial", linkageName: "\01?LoadMaterial@@YA?AUMaterialData@@I@Z", scope: !62, file: !62, line: 62, type: !63, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: false)
!62 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc/Globals.hlsli", directory: "")
!63 = !DISubroutineType(types: !64)
!64 = !{!65, !59}
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "MaterialData", file: !66, line: 170, size: 512, align: 32, elements: !67)
!66 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc/../Include/Shaders/ShaderInteropStructures.h", directory: "")
!67 = !{!68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !88}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "AlbedoColour", scope: !65, file: !66, line: 172, baseType: !22, size: 96, align: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "AlbedoTexture", scope: !65, file: !66, line: 173, baseType: !59, size: 32, align: 32, offset: 96)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "MaterialTexture", scope: !65, file: !66, line: 177, baseType: !59, size: 32, align: 32, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "RoughnessTexture", scope: !65, file: !66, line: 178, baseType: !59, size: 32, align: 32, offset: 160)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "MetalnessTexture", scope: !65, file: !66, line: 179, baseType: !59, size: 32, align: 32, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "AOTexture", scope: !65, file: !66, line: 180, baseType: !59, size: 32, align: 32, offset: 224)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "NormalTexture", scope: !65, file: !66, line: 184, baseType: !59, size: 32, align: 32, offset: 256)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "Metalness", scope: !65, file: !66, line: 185, baseType: !8, size: 32, align: 32, offset: 288)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "Roughness", scope: !65, file: !66, line: 186, baseType: !8, size: 32, align: 32, offset: 320)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "AO", scope: !65, file: !66, line: 187, baseType: !8, size: 32, align: 32, offset: 352)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !65, file: !66, line: 191, baseType: !59, size: 32, align: 32, offset: 384)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "EmissiveColourPacked", scope: !65, file: !66, line: 192, baseType: !59, size: 32, align: 32, offset: 416)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_Padding", scope: !65, file: !66, line: 193, baseType: !81, size: 64, align: 32, offset: 448)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 10, baseType: !82)
!82 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 10, size: 64, align: 32, elements: !83, templateParams: !86)
!83 = !{!84, !85}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !82, file: !1, line: 10, baseType: !60, size: 32, align: 32, flags: DIFlagPublic)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !82, file: !1, line: 10, baseType: !60, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!86 = !{!87, !36}
!87 = !DITemplateTypeParameter(name: "element", type: !60)
!88 = !DISubprogram(name: "GetEmissiveColour", linkageName: "\01?GetEmissiveColour@MaterialData@@QAA?AV?$vector@M$03@@XZ", scope: !65, file: !66, line: 196, type: !89, isLocal: false, isDefinition: false, scopeLine: 196, flags: DIFlagPrototyped, isOptimized: false)
!89 = !DISubroutineType(types: !90)
!90 = !{!37, !91}
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!92 = !DISubprogram(name: "GetEmissiveColour", linkageName: "\01?GetEmissiveColour@MaterialData@@QAA?AV?$vector@M$03@@XZ", scope: !65, file: !66, line: 196, type: !89, isLocal: false, isDefinition: true, scopeLine: 197, flags: DIFlagPrototyped, isOptimized: false, declaration: !88)
!93 = !DISubprogram(name: "GetCamera", linkageName: "\01?GetCamera@@YA?AUCamera@@XZ", scope: !62, file: !62, line: 47, type: !94, isLocal: false, isDefinition: true, scopeLine: 48, flags: DIFlagPrototyped, isOptimized: false)
!94 = !DISubroutineType(types: !95)
!95 = !{!96}
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "Camera", file: !66, line: 259, size: 1120, align: 32, elements: !97)
!97 = !{!98, !121, !122}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "ViewProjection", scope: !96, file: !66, line: 261, baseType: !99, size: 512, align: 32)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 206, baseType: !100)
!100 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 206, size: 512, align: 32, elements: !101, templateParams: !118)
!101 = !{!102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !100, file: !1, line: 206, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !100, file: !1, line: 206, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !100, file: !1, line: 206, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !100, file: !1, line: 206, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !100, file: !1, line: 206, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !100, file: !1, line: 206, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !100, file: !1, line: 206, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !100, file: !1, line: 206, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !100, file: !1, line: 206, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !100, file: !1, line: 206, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !100, file: !1, line: 206, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !100, file: !1, line: 206, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !100, file: !1, line: 206, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !100, file: !1, line: 206, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !100, file: !1, line: 206, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !100, file: !1, line: 206, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!118 = !{!18, !119, !120}
!119 = !DITemplateValueParameter(name: "row_count", type: !20, value: i32 4)
!120 = !DITemplateValueParameter(name: "col_count", type: !20, value: i32 4)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "ShadowViewProjection", scope: !96, file: !66, line: 265, baseType: !99, size: 512, align: 32, offset: 512)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "CameraPosition", scope: !96, file: !66, line: 269, baseType: !22, size: 96, align: 32, offset: 1024)
!123 = !DISubprogram(name: "GetScene", linkageName: "\01?GetScene@@YA?AUSceneData@@XZ", scope: !62, file: !62, line: 37, type: !124, isLocal: false, isDefinition: true, scopeLine: 38, flags: DIFlagPrototyped, isOptimized: false)
!124 = !DISubroutineType(types: !125)
!125 = !{!126}
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "SceneData", file: !66, line: 153, size: 256, align: 32, elements: !127)
!127 = !{!128, !129, !130, !131, !132, !133, !134, !135}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "MeshBufferIndex", scope: !126, file: !66, line: 155, baseType: !59, size: 32, align: 32)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "GeometryBufferIndex", scope: !126, file: !66, line: 156, baseType: !59, size: 32, align: 32, offset: 32)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "MaterialBufferIndex", scope: !126, file: !66, line: 157, baseType: !59, size: 32, align: 32, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "IrradianceMapTexIndex", scope: !126, file: !66, line: 158, baseType: !59, size: 32, align: 32, offset: 96)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "PreFilteredEnvMapTexIndex", scope: !126, file: !66, line: 162, baseType: !59, size: 32, align: 32, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "NumLights", scope: !126, file: !66, line: 163, baseType: !59, size: 32, align: 32, offset: 160)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_padding1", scope: !126, file: !66, line: 164, baseType: !59, size: 32, align: 32, offset: 192)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_padding2", scope: !126, file: !66, line: 165, baseType: !59, size: 32, align: 32, offset: 224)
!136 = !DISubprogram(name: "LoadLight", linkageName: "\01?LoadLight@@YA?AUShaderLight@@I@Z", scope: !62, file: !62, line: 67, type: !137, isLocal: false, isDefinition: true, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: false)
!137 = !DISubroutineType(types: !138)
!138 = !{!139, !59}
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "ShaderLight", file: !66, line: 19, size: 256, align: 32, elements: !140)
!140 = !{!141, !142, !143, !144, !145, !146, !150, !153, !154, !157}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !139, file: !66, line: 21, baseType: !22, size: 96, align: 32)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "Type8_Flags8_Range16", scope: !139, file: !66, line: 22, baseType: !59, size: 32, align: 32, offset: 96)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "Energy16_X16", scope: !139, file: !66, line: 26, baseType: !59, size: 32, align: 32, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "ColorPacked", scope: !139, file: !66, line: 27, baseType: !59, size: 32, align: 32, offset: 160)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_Padding", scope: !139, file: !66, line: 28, baseType: !81, size: 64, align: 32, offset: 192)
!146 = !DISubprogram(name: "GetColour", linkageName: "\01?GetColour@ShaderLight@@QAA?AV?$vector@M$03@@XZ", scope: !139, file: !66, line: 31, type: !147, isLocal: false, isDefinition: false, scopeLine: 31, flags: DIFlagPrototyped, isOptimized: false)
!147 = !DISubroutineType(types: !148)
!148 = !{!37, !149}
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!150 = !DISubprogram(name: "GetType", linkageName: "\01?GetType@ShaderLight@@QAAIXZ", scope: !139, file: !66, line: 43, type: !151, isLocal: false, isDefinition: false, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: false)
!151 = !DISubroutineType(types: !152)
!152 = !{!59, !149}
!153 = !DISubprogram(name: "GetFlags", linkageName: "\01?GetFlags@ShaderLight@@QAAIXZ", scope: !139, file: !66, line: 48, type: !151, isLocal: false, isDefinition: false, scopeLine: 48, flags: DIFlagPrototyped, isOptimized: false)
!154 = !DISubprogram(name: "GetRange", linkageName: "\01?GetRange@ShaderLight@@QAAMXZ", scope: !139, file: !66, line: 53, type: !155, isLocal: false, isDefinition: false, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: false)
!155 = !DISubroutineType(types: !156)
!156 = !{!8, !149}
!157 = !DISubprogram(name: "GetEnergy", linkageName: "\01?GetEnergy@ShaderLight@@QAAMXZ", scope: !139, file: !66, line: 58, type: !155, isLocal: false, isDefinition: false, scopeLine: 58, flags: DIFlagPrototyped, isOptimized: false)
!158 = !DISubprogram(name: "GetRange", linkageName: "\01?GetRange@ShaderLight@@QAAMXZ", scope: !139, file: !66, line: 53, type: !155, isLocal: false, isDefinition: true, scopeLine: 54, flags: DIFlagPrototyped, isOptimized: false, declaration: !154)
!159 = !DISubprogram(name: "GetColour", linkageName: "\01?GetColour@ShaderLight@@QAA?AV?$vector@M$03@@XZ", scope: !139, file: !66, line: 31, type: !147, isLocal: false, isDefinition: true, scopeLine: 32, flags: DIFlagPrototyped, isOptimized: false, declaration: !146)
!160 = !DISubprogram(name: "GetEnergy", linkageName: "\01?GetEnergy@ShaderLight@@QAAMXZ", scope: !139, file: !66, line: 58, type: !155, isLocal: false, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: false, declaration: !157)
!161 = !DISubprogram(name: "DistributionGGX", linkageName: "\01?DistributionGGX@@YAMV?$vector@M$02@@0M@Z", scope: !162, file: !162, line: 19, type: !163, isLocal: false, isDefinition: true, scopeLine: 20, flags: DIFlagPrototyped, isOptimized: false)
!162 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc/BRDFFunctions.hlsli", directory: "")
!163 = !DISubroutineType(types: !164)
!164 = !{!8, !22, !22, !8}
!165 = !DISubprogram(name: "GeometrySmith", linkageName: "\01?GeometrySmith@@YAMV?$vector@M$02@@00M@Z", scope: !162, file: !162, line: 49, type: !166, isLocal: false, isDefinition: true, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: false)
!166 = !DISubroutineType(types: !167)
!167 = !{!8, !22, !22, !22, !8}
!168 = !DISubprogram(name: "GeometrySchlickGGX", linkageName: "\01?GeometrySchlickGGX@@YAMMM@Z", scope: !162, file: !162, line: 37, type: !169, isLocal: false, isDefinition: true, scopeLine: 38, flags: DIFlagPrototyped, isOptimized: false)
!169 = !DISubroutineType(types: !170)
!170 = !{!8, !8, !8}
!171 = !DISubprogram(name: "FresnelSchlick", linkageName: "\01?FresnelSchlick@@YA?AV?$vector@M$02@@MV1@@Z", scope: !162, file: !162, line: 65, type: !172, isLocal: false, isDefinition: true, scopeLine: 66, flags: DIFlagPrototyped, isOptimized: false)
!172 = !DISubroutineType(types: !173)
!173 = !{!22, !8, !22}
!174 = !DISubprogram(name: "GetFrame", linkageName: "\01?GetFrame@@YA?AUFrame@@XZ", scope: !62, file: !62, line: 42, type: !175, isLocal: false, isDefinition: true, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: false)
!175 = !DISubroutineType(types: !176)
!176 = !{!177}
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "Frame", file: !66, line: 247, size: 384, align: 32, elements: !178)
!178 = !{!179, !180, !181, !182, !183}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "BrdfLUTTexIndex", scope: !177, file: !66, line: 249, baseType: !59, size: 32, align: 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_padding0", scope: !177, file: !66, line: 250, baseType: !59, size: 32, align: 32, offset: 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_padding1", scope: !177, file: !66, line: 251, baseType: !59, size: 32, align: 32, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_padding2", scope: !177, file: !66, line: 252, baseType: !59, size: 32, align: 32, offset: 96)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "Scene", scope: !177, file: !66, line: 256, baseType: !126, size: 256, align: 32, offset: 128)
!184 = !DISubprogram(name: "FresnelSchlick", linkageName: "\01?FresnelSchlick@@YA?AV?$vector@M$02@@MV1@M@Z", scope: !162, file: !162, line: 70, type: !185, isLocal: false, isDefinition: true, scopeLine: 71, flags: DIFlagPrototyped, isOptimized: false)
!185 = !DISubroutineType(types: !186)
!186 = !{!22, !8, !22, !8}
!187 = !DISubprogram(name: "ToneMapping", linkageName: "\01?ToneMapping@@YA?AV?$vector@M$02@@V1@@Z", scope: !51, file: !51, line: 14, type: !188, isLocal: false, isDefinition: true, scopeLine: 15, flags: DIFlagPrototyped, isOptimized: false)
!188 = !DISubroutineType(types: !189)
!189 = !{!22, !22}
!190 = !DISubprogram(name: "GammaCorrection", linkageName: "\01?GammaCorrection@@YA?AV?$vector@M$02@@V1@@Z", scope: !51, file: !51, line: 19, type: !188, isLocal: false, isDefinition: true, scopeLine: 20, flags: DIFlagPrototyped, isOptimized: false)
!191 = !{!192, !194, !195, !197, !198, !199, !207, !210, !213, !217, !219, !220, !222, !223}
!192 = !DIGlobalVariable(name: "Fdielectric", scope: !0, file: !162, line: 7, type: !193, isLocal: true, isDefinition: true, variable: float 0x3FA47AE140000000)
!193 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!194 = !DIGlobalVariable(name: "MaxReflectionLod", scope: !0, file: !162, line: 8, type: !193, isLocal: true, isDefinition: true, variable: float 7.000000e+00)
!195 = !DIGlobalVariable(name: "ENTITY_TYPE_DIRECTIONALLIGHT", scope: !0, file: !66, line: 15, type: !196, isLocal: true, isDefinition: true)
!196 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !59)
!197 = !DIGlobalVariable(name: "ENTITY_TYPE_OMNILIGHT", scope: !0, file: !66, line: 16, type: !196, isLocal: true, isDefinition: true)
!198 = !DIGlobalVariable(name: "ENTITY_TYPE_SPOTLIGHT", scope: !0, file: !66, line: 17, type: !196, isLocal: true, isDefinition: true)
!199 = !DIGlobalVariable(name: "ResourceHeap_Texture2D", linkageName: "\01?ResourceHeap_Texture2D@@3PAV?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !200, line: 7, type: !201, isLocal: false, isDefinition: true, variable: [0 x %"class.Texture2D<vector<float, 4> >"]* @"\01?ResourceHeap_Texture2D@@3PAV?$Texture2D@V?$vector@M$03@@@@A")
!200 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc/ResourceHeapTables.hlsli", directory: "")
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 160, align: 32, elements: !205)
!202 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 7, size: 160, align: 32, elements: !2, templateParams: !203)
!203 = !{!204}
!204 = !DITemplateTypeParameter(name: "element", type: !38)
!205 = !{!206}
!206 = !DISubrange(count: 1)
!207 = !DIGlobalVariable(name: "ResourceHeap_TextureCube", linkageName: "\01?ResourceHeap_TextureCube@@3PAV?$TextureCube@V?$vector@M$03@@@@A", scope: !0, file: !200, line: 8, type: !208, isLocal: false, isDefinition: true, variable: [0 x %"class.TextureCube<vector<float, 4> >"]* @"\01?ResourceHeap_TextureCube@@3PAV?$TextureCube@V?$vector@M$03@@@@A")
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 128, align: 32, elements: !205)
!209 = !DICompositeType(tag: DW_TAG_class_type, name: "TextureCube<vector<float, 4> >", file: !1, line: 8, size: 128, align: 32, elements: !2, templateParams: !203)
!210 = !DIGlobalVariable(name: "ResourceHeap_Buffer", linkageName: "\01?ResourceHeap_Buffer@@3PAUByteAddressBuffer@@A", scope: !0, file: !200, line: 9, type: !211, isLocal: false, isDefinition: true, variable: [0 x %struct.ByteAddressBuffer]* @"\01?ResourceHeap_Buffer@@3PAUByteAddressBuffer@@A")
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !212, size: 32, align: 32, elements: !205)
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteAddressBuffer", file: !1, line: 9, size: 32, align: 32, elements: !2)
