#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; NORMAL                   0   xyz         0     NONE   float   xyz 
; COLOUR                   0   xyzw        1     NONE   float   xyzw
; TEXCOORD                 0   xy          2     NONE   float   xy  
; Position                 0   xyz         3     NONE   float   xyz 
; TANGENT                  0   xyzw        4     NONE   float   xyzw
; MATERIAL                 0   x           5     NONE    uint   x   
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: 6754178f8e5247374462ecc8f198d290.pdb
; shader hash: 6754178f8e5247374462ecc8f198d290
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; NORMAL                   0                 linear       
; COLOUR                   0                 linear       
; TEXCOORD                 0                 linear       
; Position                 0                 linear       
; TANGENT                  0                 linear       

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc 1.2", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !46, globals: !186)
!1 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc\5CGeometryPassPS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !22, !8, !30, !37}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 64, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 64, size: 288, align: 32, elements: !6, templateParams: !17)
!6 = !{!7, !9, !10, !11, !12, !13, !14, !15, !16}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !5, file: !1, line: 64, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !5, file: !1, line: 64, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !5, file: !1, line: 64, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !5, file: !1, line: 64, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !5, file: !1, line: 64, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !5, file: !1, line: 64, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !5, file: !1, line: 64, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !5, file: !1, line: 64, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !5, file: !1, line: 64, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!17 = !{!18, !19, !21}
!18 = !DITemplateTypeParameter(name: "element", type: !8)
!19 = !DITemplateValueParameter(name: "row_count", type: !20, value: i32 3)
!20 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!21 = !DITemplateValueParameter(name: "col_count", type: !20, value: i32 3)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, size: 96, align: 32, elements: !24, templateParams: !28)
!24 = !{!25, !26, !27}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !23, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!28 = !{!18, !29}
!29 = !DITemplateValueParameter(name: "element_count", type: !20, value: i32 3)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !31)
!31 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !32, templateParams: !35)
!32 = !{!33, !34}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !31, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !31, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!35 = !{!18, !36}
!36 = !DITemplateValueParameter(name: "element_count", type: !20, value: i32 2)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !38)
!38 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !39, templateParams: !44)
!39 = !{!40, !41, !42, !43}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !38, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !38, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !38, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !38, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!44 = !{!18, !45}
!45 = !DITemplateValueParameter(name: "element_count", type: !20, value: i32 4)
!46 = !{!47, !60, !91, !121, !134, !156, !157, !158, !159, !163, !166, !169, !172, !182, !185}
!47 = !DISubprogram(name: "main", scope: !1, file: !1, line: 22, type: !48, isLocal: false, isDefinition: true, scopeLine: 23, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!48 = !DISubroutineType(types: !49)
!49 = !{!37, !50}
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "PSInput", file: !1, line: 8, size: 544, align: 32, elements: !51)
!51 = !{!52, !53, !54, !55, !56, !57}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "NormalWS", scope: !50, file: !1, line: 10, baseType: !22, size: 96, align: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !50, file: !1, line: 11, baseType: !37, size: 128, align: 32, offset: 96)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !50, file: !1, line: 12, baseType: !30, size: 64, align: 32, offset: 224)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "PositionWS", scope: !50, file: !1, line: 13, baseType: !22, size: 96, align: 32, offset: 288)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "TangentWS", scope: !50, file: !1, line: 14, baseType: !37, size: 128, align: 32, offset: 384)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "MaterialID", scope: !50, file: !1, line: 15, baseType: !58, size: 32, align: 32, offset: 512)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, baseType: !59)
!59 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!60 = !DISubprogram(name: "LoadMaterial", linkageName: "\01?LoadMaterial@@YA?AUMaterialData@@I@Z", scope: !61, file: !61, line: 62, type: !62, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: false)
!61 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc/Globals.hlsli", directory: "")
!62 = !DISubroutineType(types: !63)
!63 = !{!64, !58}
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "MaterialData", file: !65, line: 141, size: 512, align: 32, elements: !66)
!65 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc/../Include/Shaders/ShaderInteropStructures.h", directory: "")
!66 = !{!67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !87}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "AlbedoColour", scope: !64, file: !65, line: 143, baseType: !22, size: 96, align: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "AlbedoTexture", scope: !64, file: !65, line: 144, baseType: !58, size: 32, align: 32, offset: 96)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "MaterialTexture", scope: !64, file: !65, line: 148, baseType: !58, size: 32, align: 32, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "RoughnessTexture", scope: !64, file: !65, line: 149, baseType: !58, size: 32, align: 32, offset: 160)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "MetalnessTexture", scope: !64, file: !65, line: 150, baseType: !58, size: 32, align: 32, offset: 192)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "AOTexture", scope: !64, file: !65, line: 151, baseType: !58, size: 32, align: 32, offset: 224)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "NormalTexture", scope: !64, file: !65, line: 155, baseType: !58, size: 32, align: 32, offset: 256)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "Metalness", scope: !64, file: !65, line: 156, baseType: !8, size: 32, align: 32, offset: 288)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "Roughness", scope: !64, file: !65, line: 157, baseType: !8, size: 32, align: 32, offset: 320)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "AO", scope: !64, file: !65, line: 158, baseType: !8, size: 32, align: 32, offset: 352)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !64, file: !65, line: 162, baseType: !58, size: 32, align: 32, offset: 384)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "EmissiveColourPacked", scope: !64, file: !65, line: 163, baseType: !58, size: 32, align: 32, offset: 416)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_Padding", scope: !64, file: !65, line: 164, baseType: !80, size: 64, align: 32, offset: 448)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 24, baseType: !81)
!81 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 24, size: 64, align: 32, elements: !82, templateParams: !85)
!82 = !{!83, !84}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !81, file: !1, line: 24, baseType: !59, size: 32, align: 32, flags: DIFlagPublic)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !81, file: !1, line: 24, baseType: !59, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!85 = !{!86, !36}
!86 = !DITemplateTypeParameter(name: "element", type: !59)
!87 = !DISubprogram(name: "GetEmissiveColour", linkageName: "\01?GetEmissiveColour@MaterialData@@QAA?AV?$vector@M$03@@XZ", scope: !64, file: !65, line: 167, type: !88, isLocal: false, isDefinition: false, scopeLine: 167, flags: DIFlagPrototyped, isOptimized: false)
!88 = !DISubroutineType(types: !89)
!89 = !{!37, !90}
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!91 = !DISubprogram(name: "GetCamera", linkageName: "\01?GetCamera@@YA?AUCamera@@XZ", scope: !61, file: !61, line: 47, type: !92, isLocal: false, isDefinition: true, scopeLine: 48, flags: DIFlagPrototyped, isOptimized: false)
!92 = !DISubroutineType(types: !93)
!93 = !{!94}
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "Camera", file: !65, line: 230, size: 1120, align: 32, elements: !95)
!95 = !{!96, !119, !120}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "ViewProjection", scope: !94, file: !65, line: 232, baseType: !97, size: 512, align: 32)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 65, baseType: !98)
!98 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 65, size: 512, align: 32, elements: !99, templateParams: !116)
!99 = !{!100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !98, file: !1, line: 65, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !98, file: !1, line: 65, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !98, file: !1, line: 65, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !98, file: !1, line: 65, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !98, file: !1, line: 65, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !98, file: !1, line: 65, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !98, file: !1, line: 65, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !98, file: !1, line: 65, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !98, file: !1, line: 65, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !98, file: !1, line: 65, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !98, file: !1, line: 65, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !98, file: !1, line: 65, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !98, file: !1, line: 65, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !98, file: !1, line: 65, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !98, file: !1, line: 65, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !98, file: !1, line: 65, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!116 = !{!18, !117, !118}
!117 = !DITemplateValueParameter(name: "row_count", type: !20, value: i32 4)
!118 = !DITemplateValueParameter(name: "col_count", type: !20, value: i32 4)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "ShadowViewProjection", scope: !94, file: !65, line: 236, baseType: !97, size: 512, align: 32, offset: 512)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "CameraPosition", scope: !94, file: !65, line: 240, baseType: !22, size: 96, align: 32, offset: 1024)
!121 = !DISubprogram(name: "GetScene", linkageName: "\01?GetScene@@YA?AUSceneData@@XZ", scope: !61, file: !61, line: 37, type: !122, isLocal: false, isDefinition: true, scopeLine: 38, flags: DIFlagPrototyped, isOptimized: false)
!122 = !DISubroutineType(types: !123)
!123 = !{!124}
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "SceneData", file: !65, line: 124, size: 256, align: 32, elements: !125)
!125 = !{!126, !127, !128, !129, !130, !131, !132, !133}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "MeshBufferIndex", scope: !124, file: !65, line: 126, baseType: !58, size: 32, align: 32)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "GeometryBufferIndex", scope: !124, file: !65, line: 127, baseType: !58, size: 32, align: 32, offset: 32)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "MaterialBufferIndex", scope: !124, file: !65, line: 128, baseType: !58, size: 32, align: 32, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "IrradianceMapTexIndex", scope: !124, file: !65, line: 129, baseType: !58, size: 32, align: 32, offset: 96)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "PreFilteredEnvMapTexIndex", scope: !124, file: !65, line: 133, baseType: !58, size: 32, align: 32, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "NumLights", scope: !124, file: !65, line: 134, baseType: !58, size: 32, align: 32, offset: 160)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_padding1", scope: !124, file: !65, line: 135, baseType: !58, size: 32, align: 32, offset: 192)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_padding2", scope: !124, file: !65, line: 136, baseType: !58, size: 32, align: 32, offset: 224)
!134 = !DISubprogram(name: "LoadLight", linkageName: "\01?LoadLight@@YA?AUShaderLight@@I@Z", scope: !61, file: !61, line: 67, type: !135, isLocal: false, isDefinition: true, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: false)
!135 = !DISubroutineType(types: !136)
!136 = !{!137, !58}
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "ShaderLight", file: !65, line: 19, size: 256, align: 32, elements: !138)
!138 = !{!139, !140, !141, !142, !143, !144, !148, !151, !152, !155}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !137, file: !65, line: 21, baseType: !22, size: 96, align: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "Type8_Flags8_Range16", scope: !137, file: !65, line: 22, baseType: !58, size: 32, align: 32, offset: 96)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "Energy16_X16", scope: !137, file: !65, line: 26, baseType: !58, size: 32, align: 32, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "ColorPacked", scope: !137, file: !65, line: 27, baseType: !58, size: 32, align: 32, offset: 160)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_Padding", scope: !137, file: !65, line: 28, baseType: !80, size: 64, align: 32, offset: 192)
!144 = !DISubprogram(name: "GetColour", linkageName: "\01?GetColour@ShaderLight@@QAA?AV?$vector@M$03@@XZ", scope: !137, file: !65, line: 31, type: !145, isLocal: false, isDefinition: false, scopeLine: 31, flags: DIFlagPrototyped, isOptimized: false)
!145 = !DISubroutineType(types: !146)
!146 = !{!37, !147}
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!148 = !DISubprogram(name: "GetType", linkageName: "\01?GetType@ShaderLight@@QAAIXZ", scope: !137, file: !65, line: 43, type: !149, isLocal: false, isDefinition: false, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: false)
!149 = !DISubroutineType(types: !150)
!150 = !{!58, !147}
!151 = !DISubprogram(name: "GetFlags", linkageName: "\01?GetFlags@ShaderLight@@QAAIXZ", scope: !137, file: !65, line: 48, type: !149, isLocal: false, isDefinition: false, scopeLine: 48, flags: DIFlagPrototyped, isOptimized: false)
!152 = !DISubprogram(name: "GetRange", linkageName: "\01?GetRange@ShaderLight@@QAAMXZ", scope: !137, file: !65, line: 53, type: !153, isLocal: false, isDefinition: false, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: false)
!153 = !DISubroutineType(types: !154)
!154 = !{!8, !147}
!155 = !DISubprogram(name: "GetEnergy", linkageName: "\01?GetEnergy@ShaderLight@@QAAMXZ", scope: !137, file: !65, line: 58, type: !153, isLocal: false, isDefinition: false, scopeLine: 58, flags: DIFlagPrototyped, isOptimized: false)
!156 = !DISubprogram(name: "GetRange", linkageName: "\01?GetRange@ShaderLight@@QAAMXZ", scope: !137, file: !65, line: 53, type: !153, isLocal: false, isDefinition: true, scopeLine: 54, flags: DIFlagPrototyped, isOptimized: false, declaration: !152)
!157 = !DISubprogram(name: "GetColour", linkageName: "\01?GetColour@ShaderLight@@QAA?AV?$vector@M$03@@XZ", scope: !137, file: !65, line: 31, type: !145, isLocal: false, isDefinition: true, scopeLine: 32, flags: DIFlagPrototyped, isOptimized: false, declaration: !144)
!158 = !DISubprogram(name: "GetEnergy", linkageName: "\01?GetEnergy@ShaderLight@@QAAMXZ", scope: !137, file: !65, line: 58, type: !153, isLocal: false, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: false, declaration: !155)
!159 = !DISubprogram(name: "DistributionGGX", linkageName: "\01?DistributionGGX@@YAMV?$vector@M$02@@0M@Z", scope: !160, file: !160, line: 16, type: !161, isLocal: false, isDefinition: true, scopeLine: 17, flags: DIFlagPrototyped, isOptimized: false)
!160 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc/BRDFFunctions.hlsli", directory: "")
!161 = !DISubroutineType(types: !162)
!162 = !{!8, !22, !22, !8}
!163 = !DISubprogram(name: "GeometrySmith", linkageName: "\01?GeometrySmith@@YAMV?$vector@M$02@@00M@Z", scope: !160, file: !160, line: 46, type: !164, isLocal: false, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: false)
!164 = !DISubroutineType(types: !165)
!165 = !{!8, !22, !22, !22, !8}
!166 = !DISubprogram(name: "GeometrySchlickGGX", linkageName: "\01?GeometrySchlickGGX@@YAMMM@Z", scope: !160, file: !160, line: 34, type: !167, isLocal: false, isDefinition: true, scopeLine: 35, flags: DIFlagPrototyped, isOptimized: false)
!167 = !DISubroutineType(types: !168)
!168 = !{!8, !8, !8}
!169 = !DISubprogram(name: "FresnelSchlick", linkageName: "\01?FresnelSchlick@@YA?AV?$vector@M$02@@MV1@@Z", scope: !160, file: !160, line: 62, type: !170, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: false)
!170 = !DISubroutineType(types: !171)
!171 = !{!22, !8, !22}
!172 = !DISubprogram(name: "GetFrame", linkageName: "\01?GetFrame@@YA?AUFrame@@XZ", scope: !61, file: !61, line: 42, type: !173, isLocal: false, isDefinition: true, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: false)
!173 = !DISubroutineType(types: !174)
!174 = !{!175}
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "Frame", file: !65, line: 218, size: 384, align: 32, elements: !176)
!176 = !{!177, !178, !179, !180, !181}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "BrdfLUTTexIndex", scope: !175, file: !65, line: 220, baseType: !58, size: 32, align: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_padding0", scope: !175, file: !65, line: 221, baseType: !58, size: 32, align: 32, offset: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_padding1", scope: !175, file: !65, line: 222, baseType: !58, size: 32, align: 32, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_padding2", scope: !175, file: !65, line: 223, baseType: !58, size: 32, align: 32, offset: 96)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "Scene", scope: !175, file: !65, line: 227, baseType: !124, size: 256, align: 32, offset: 128)
!182 = !DISubprogram(name: "FresnelSchlick", linkageName: "\01?FresnelSchlick@@YA?AV?$vector@M$02@@MV1@M@Z", scope: !160, file: !160, line: 67, type: !183, isLocal: false, isDefinition: true, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: false)
!183 = !DISubroutineType(types: !184)
!184 = !{!22, !8, !22, !8}
!185 = !DISubprogram(name: "GetEmissiveColour", linkageName: "\01?GetEmissiveColour@MaterialData@@QAA?AV?$vector@M$03@@XZ", scope: !64, file: !65, line: 167, type: !88, isLocal: false, isDefinition: true, scopeLine: 168, flags: DIFlagPrototyped, isOptimized: false, declaration: !87)
!186 = !{!187, !189, !190, !192, !193, !194, !202, !205, !208, !212, !214, !215, !217, !218}
!187 = !DIGlobalVariable(name: "Fdielectric", scope: !0, file: !1, line: 19, type: !188, isLocal: true, isDefinition: true, variable: float 0x3FA47AE140000000)
!188 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!189 = !DIGlobalVariable(name: "MaxReflectionLod", scope: !0, file: !1, line: 20, type: !188, isLocal: true, isDefinition: true, variable: float 7.000000e+00)
!190 = !DIGlobalVariable(name: "ENTITY_TYPE_DIRECTIONALLIGHT", scope: !0, file: !65, line: 15, type: !191, isLocal: true, isDefinition: true)
!191 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!192 = !DIGlobalVariable(name: "ENTITY_TYPE_OMNILIGHT", scope: !0, file: !65, line: 16, type: !191, isLocal: true, isDefinition: true)
!193 = !DIGlobalVariable(name: "ENTITY_TYPE_SPOTLIGHT", scope: !0, file: !65, line: 17, type: !191, isLocal: true, isDefinition: true)
!194 = !DIGlobalVariable(name: "ResourceHeap_Texture2D", linkageName: "\01?ResourceHeap_Texture2D@@3PAV?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !195, line: 7, type: !196, isLocal: false, isDefinition: true, variable: [0 x %"class.Texture2D<vector<float, 4> >"]* @"\01?ResourceHeap_Texture2D@@3PAV?$Texture2D@V?$vector@M$03@@@@A")
!195 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc/ResourceHeapTables.hlsli", directory: "")
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 160, align: 32, elements: !200)
!197 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 7, size: 160, align: 32, elements: !2, templateParams: !198)
!198 = !{!199}
!199 = !DITemplateTypeParameter(name: "element", type: !38)
!200 = !{!201}
!201 = !DISubrange(count: 1)
!202 = !DIGlobalVariable(name: "ResourceHeap_TextureCube", linkageName: "\01?ResourceHeap_TextureCube@@3PAV?$TextureCube@V?$vector@M$03@@@@A", scope: !0, file: !195, line: 8, type: !203, isLocal: false, isDefinition: true, variable: [0 x %"class.TextureCube<vector<float, 4> >"]* @"\01?ResourceHeap_TextureCube@@3PAV?$TextureCube@V?$vector@M$03@@@@A")
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 128, align: 32, elements: !200)
!204 = !DICompositeType(tag: DW_TAG_class_type, name: "TextureCube<vector<float, 4> >", file: !1, line: 8, size: 128, align: 32, elements: !2, templateParams: !198)
!205 = !DIGlobalVariable(name: "ResourceHeap_Buffer", linkageName: "\01?ResourceHeap_Buffer@@3PAUByteAddressBuffer@@A", scope: !0, file: !195, line: 9, type: !206, isLocal: false, isDefinition: true, variable: [0 x %struct.ByteAddressBuffer]* @"\01?ResourceHeap_Buffer@@3PAUByteAddressBuffer@@A")
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 32, align: 32, elements: !200)
!207 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteAddressBuffer", file: !1, line: 9, size: 32, align: 32, elements: !2)
!208 = !DIGlobalVariable(name: "LightSB", linkageName: "\01?LightSB@@3V?$StructuredBuffer@UShaderLight@@@@A", scope: !0, file: !61, line: 29, type: !209, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<ShaderLight>"* @"\01?LightSB@@3V?$StructuredBuffer@UShaderLight@@@@A")
