#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; NORMAL                   0   xyz         0     NONE   float   xyz 
; COLOUR                   0   xyzw        1     NONE   float   xyzw
; TEXCOORD                 0   xy          2     NONE   float   xy  
; Position                 0   xyz         3     NONE   float   xyz 
; TANGENT                  0   xyzw        4     NONE   float   xyzw
; MATERIAL                 0   x           5     NONE    uint   x   
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: 59b2c23fc4f030d4de487f0360939e7f.pdb
; shader hash: 59b2c23fc4f030d4de487f0360939e7f
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; NORMAL                   0                 linear       
; COLOUR                   0                 linear       
; TEXCOORD                 0                 linear       
; Position                 0                 linear       
; TANGENT                  0                 linear       

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc 1.2", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !24, globals: !94)
!1 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc\5CGeometryPassPS_Unlit.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !16}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, baseType: !17)
!17 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, size: 96, align: 32, elements: !18, templateParams: !22)
!18 = !{!19, !20, !21}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !17, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !17, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !17, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!22 = !{!13, !23}
!23 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!24 = !{!25, !46, !77, !90, !93}
!25 = !DISubprogram(name: "main", scope: !1, file: !1, line: 7, type: !26, isLocal: false, isDefinition: true, scopeLine: 8, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!26 = !DISubroutineType(types: !27)
!27 = !{!4, !28}
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "PSInput", file: !29, line: 4, size: 544, align: 32, elements: !30)
!29 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc/GeometryPass.hlsli", directory: "")
!30 = !{!31, !32, !33, !41, !42, !43}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "NormalWS", scope: !28, file: !29, line: 6, baseType: !16, size: 96, align: 32)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !28, file: !29, line: 7, baseType: !4, size: 128, align: 32, offset: 96)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !28, file: !29, line: 8, baseType: !34, size: 64, align: 32, offset: 224)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !35)
!35 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !36, templateParams: !39)
!36 = !{!37, !38}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !35, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !35, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!39 = !{!13, !40}
!40 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "PositionWS", scope: !28, file: !29, line: 9, baseType: !16, size: 96, align: 32, offset: 288)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "TangentWS", scope: !28, file: !29, line: 10, baseType: !4, size: 128, align: 32, offset: 384)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "MaterialID", scope: !28, file: !29, line: 11, baseType: !44, size: 32, align: 32, offset: 512)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, baseType: !45)
!45 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!46 = !DISubprogram(name: "LoadMaterial", linkageName: "\01?LoadMaterial@@YA?AUMaterialData@@I@Z", scope: !47, file: !47, line: 62, type: !48, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: false)
!47 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc/Globals.hlsli", directory: "")
!48 = !DISubroutineType(types: !49)
!49 = !{!50, !44}
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "MaterialData", file: !51, line: 170, size: 512, align: 32, elements: !52)
!51 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc/../Include/Shaders/ShaderInteropStructures.h", directory: "")
!52 = !{!53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !73}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "AlbedoColour", scope: !50, file: !51, line: 172, baseType: !16, size: 96, align: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "AlbedoTexture", scope: !50, file: !51, line: 173, baseType: !44, size: 32, align: 32, offset: 96)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "MaterialTexture", scope: !50, file: !51, line: 177, baseType: !44, size: 32, align: 32, offset: 128)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "RoughnessTexture", scope: !50, file: !51, line: 178, baseType: !44, size: 32, align: 32, offset: 160)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "MetalnessTexture", scope: !50, file: !51, line: 179, baseType: !44, size: 32, align: 32, offset: 192)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "AOTexture", scope: !50, file: !51, line: 180, baseType: !44, size: 32, align: 32, offset: 224)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "NormalTexture", scope: !50, file: !51, line: 184, baseType: !44, size: 32, align: 32, offset: 256)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "Metalness", scope: !50, file: !51, line: 185, baseType: !8, size: 32, align: 32, offset: 288)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "Roughness", scope: !50, file: !51, line: 186, baseType: !8, size: 32, align: 32, offset: 320)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "AO", scope: !50, file: !51, line: 187, baseType: !8, size: 32, align: 32, offset: 352)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !50, file: !51, line: 191, baseType: !44, size: 32, align: 32, offset: 384)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "EmissiveColourPacked", scope: !50, file: !51, line: 192, baseType: !44, size: 32, align: 32, offset: 416)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_Padding", scope: !50, file: !51, line: 193, baseType: !66, size: 64, align: 32, offset: 448)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 9, baseType: !67)
!67 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 9, size: 64, align: 32, elements: !68, templateParams: !71)
!68 = !{!69, !70}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !67, file: !1, line: 9, baseType: !45, size: 32, align: 32, flags: DIFlagPublic)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !67, file: !1, line: 9, baseType: !45, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!71 = !{!72, !40}
!72 = !DITemplateTypeParameter(name: "element", type: !45)
!73 = !DISubprogram(name: "GetEmissiveColour", linkageName: "\01?GetEmissiveColour@MaterialData@@QAA?AV?$vector@M$03@@XZ", scope: !50, file: !51, line: 196, type: !74, isLocal: false, isDefinition: false, scopeLine: 196, flags: DIFlagPrototyped, isOptimized: false)
!74 = !DISubroutineType(types: !75)
!75 = !{!4, !76}
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!77 = !DISubprogram(name: "GetScene", linkageName: "\01?GetScene@@YA?AUSceneData@@XZ", scope: !47, file: !47, line: 37, type: !78, isLocal: false, isDefinition: true, scopeLine: 38, flags: DIFlagPrototyped, isOptimized: false)
!78 = !DISubroutineType(types: !79)
!79 = !{!80}
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "SceneData", file: !51, line: 153, size: 256, align: 32, elements: !81)
!81 = !{!82, !83, !84, !85, !86, !87, !88, !89}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "MeshBufferIndex", scope: !80, file: !51, line: 155, baseType: !44, size: 32, align: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "GeometryBufferIndex", scope: !80, file: !51, line: 156, baseType: !44, size: 32, align: 32, offset: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "MaterialBufferIndex", scope: !80, file: !51, line: 157, baseType: !44, size: 32, align: 32, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "IrradianceMapTexIndex", scope: !80, file: !51, line: 158, baseType: !44, size: 32, align: 32, offset: 96)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "PreFilteredEnvMapTexIndex", scope: !80, file: !51, line: 162, baseType: !44, size: 32, align: 32, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "NumLights", scope: !80, file: !51, line: 163, baseType: !44, size: 32, align: 32, offset: 160)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_padding1", scope: !80, file: !51, line: 164, baseType: !44, size: 32, align: 32, offset: 192)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_padding2", scope: !80, file: !51, line: 165, baseType: !44, size: 32, align: 32, offset: 224)
!90 = !DISubprogram(name: "ToneMapping", linkageName: "\01?ToneMapping@@YA?AV?$vector@M$02@@V1@@Z", scope: !29, file: !29, line: 14, type: !91, isLocal: false, isDefinition: true, scopeLine: 15, flags: DIFlagPrototyped, isOptimized: false)
!91 = !DISubroutineType(types: !92)
!92 = !{!16, !16}
!93 = !DISubprogram(name: "GammaCorrection", linkageName: "\01?GammaCorrection@@YA?AV?$vector@M$02@@V1@@Z", scope: !29, file: !29, line: 19, type: !91, isLocal: false, isDefinition: true, scopeLine: 20, flags: DIFlagPrototyped, isOptimized: false)
!94 = !{!95, !97, !98, !99, !107, !110, !113, !136, !138, !139, !141, !144}
!95 = !DIGlobalVariable(name: "ENTITY_TYPE_DIRECTIONALLIGHT", scope: !0, file: !51, line: 15, type: !96, isLocal: true, isDefinition: true)
!96 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!97 = !DIGlobalVariable(name: "ENTITY_TYPE_OMNILIGHT", scope: !0, file: !51, line: 16, type: !96, isLocal: true, isDefinition: true)
!98 = !DIGlobalVariable(name: "ENTITY_TYPE_SPOTLIGHT", scope: !0, file: !51, line: 17, type: !96, isLocal: true, isDefinition: true)
!99 = !DIGlobalVariable(name: "ResourceHeap_Texture2D", linkageName: "\01?ResourceHeap_Texture2D@@3PAV?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !100, line: 7, type: !101, isLocal: false, isDefinition: true, variable: [0 x %"class.Texture2D<vector<float, 4> >"]* @"\01?ResourceHeap_Texture2D@@3PAV?$Texture2D@V?$vector@M$03@@@@A")
!100 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc/ResourceHeapTables.hlsli", directory: "")
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 160, align: 32, elements: !105)
!102 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 7, size: 160, align: 32, elements: !2, templateParams: !103)
!103 = !{!104}
!104 = !DITemplateTypeParameter(name: "element", type: !5)
!105 = !{!106}
!106 = !DISubrange(count: 1)
!107 = !DIGlobalVariable(name: "ResourceHeap_TextureCube", linkageName: "\01?ResourceHeap_TextureCube@@3PAV?$TextureCube@V?$vector@M$03@@@@A", scope: !0, file: !100, line: 8, type: !108, isLocal: false, isDefinition: true)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 128, align: 32, elements: !105)
!109 = !DICompositeType(tag: DW_TAG_class_type, name: "TextureCube<vector<float, 4> >", file: !1, line: 8, size: 128, align: 32, elements: !2, templateParams: !103)
!110 = !DIGlobalVariable(name: "ResourceHeap_Buffer", linkageName: "\01?ResourceHeap_Buffer@@3PAUByteAddressBuffer@@A", scope: !0, file: !100, line: 9, type: !111, isLocal: false, isDefinition: true, variable: [0 x %struct.ByteAddressBuffer]* @"\01?ResourceHeap_Buffer@@3PAUByteAddressBuffer@@A")
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 32, align: 32, elements: !105)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteAddressBuffer", file: !1, line: 9, size: 32, align: 32, elements: !2)
!113 = !DIGlobalVariable(name: "LightSB", linkageName: "\01?LightSB@@3V?$StructuredBuffer@UShaderLight@@@@A", scope: !0, file: !47, line: 29, type: !114, isLocal: false, isDefinition: true)
!114 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<ShaderLight>", file: !1, line: 29, size: 256, align: 32, elements: !2, templateParams: !115)
!115 = !{!116}
!116 = !DITemplateTypeParameter(name: "element", type: !117)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "ShaderLight", file: !51, line: 19, size: 256, align: 32, elements: !118)
!118 = !{!119, !120, !121, !122, !123, !124, !128, !131, !132, !135}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !117, file: !51, line: 21, baseType: !16, size: 96, align: 32)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "Type8_Flags8_Range16", scope: !117, file: !51, line: 22, baseType: !44, size: 32, align: 32, offset: 96)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "Energy16_X16", scope: !117, file: !51, line: 26, baseType: !44, size: 32, align: 32, offset: 128)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "ColorPacked", scope: !117, file: !51, line: 27, baseType: !44, size: 32, align: 32, offset: 160)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_Padding", scope: !117, file: !51, line: 28, baseType: !66, size: 64, align: 32, offset: 192)
!124 = !DISubprogram(name: "GetColour", linkageName: "\01?GetColour@ShaderLight@@QAA?AV?$vector@M$03@@XZ", scope: !117, file: !51, line: 31, type: !125, isLocal: false, isDefinition: false, scopeLine: 31, flags: DIFlagPrototyped, isOptimized: false)
!125 = !DISubroutineType(types: !126)
!126 = !{!4, !127}
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!128 = !DISubprogram(name: "GetType", linkageName: "\01?GetType@ShaderLight@@QAAIXZ", scope: !117, file: !51, line: 43, type: !129, isLocal: false, isDefinition: false, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: false)
!129 = !DISubroutineType(types: !130)
!130 = !{!44, !127}
!131 = !DISubprogram(name: "GetFlags", linkageName: "\01?GetFlags@ShaderLight@@QAAIXZ", scope: !117, file: !51, line: 48, type: !129, isLocal: false, isDefinition: false, scopeLine: 48, flags: DIFlagPrototyped, isOptimized: false)
!132 = !DISubprogram(name: "GetRange", linkageName: "\01?GetRange@ShaderLight@@QAAMXZ", scope: !117, file: !51, line: 53, type: !133, isLocal: false, isDefinition: false, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: false)
!133 = !DISubroutineType(types: !134)
!134 = !{!8, !127}
!135 = !DISubprogram(name: "GetEnergy", linkageName: "\01?GetEnergy@ShaderLight@@QAAMXZ", scope: !117, file: !51, line: 58, type: !133, isLocal: false, isDefinition: false, scopeLine: 58, flags: DIFlagPrototyped, isOptimized: false)
!136 = !DIGlobalVariable(name: "SamplerDefault", linkageName: "\01?SamplerDefault@@3USamplerState@@A", scope: !0, file: !47, line: 33, type: !137, isLocal: false, isDefinition: true, variable: %struct.SamplerState* @"\01?SamplerDefault@@3USamplerState@@A")
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 33, size: 32, align: 32, elements: !2)
!138 = !DIGlobalVariable(name: "SamplerBrdf", linkageName: "\01?SamplerBrdf@@3USamplerState@@A", scope: !0, file: !47, line: 34, type: !137, isLocal: false, isDefinition: true)
!139 = !DIGlobalVariable(name: "ShadowSampler", linkageName: "\01?ShadowSampler@@3USamplerComparisonState@@A", scope: !0, file: !47, line: 35, type: !140, isLocal: false, isDefinition: true)
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerComparisonState", file: !1, line: 35, size: 32, align: 32, elements: !2)
!141 = !DIGlobalVariable(name: "Fdielectric", scope: !0, file: !142, line: 7, type: !143, isLocal: true, isDefinition: true)
!142 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc/BRDFFunctions.hlsli", directory: "")
!143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!144 = !DIGlobalVariable(name: "MaxReflectionLod", scope: !0, file: !142, line: 8, type: !143, isLocal: true, isDefinition: true)
!145 = !{i32 2, !"Dwarf Version", i32 4}
!146 = !{i32 2, !"Debug Info Version", i32 3}
!147 = !{!"dxc 1.2"}
!148 = !{!"D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc\5CGeometryPassPS_Unlit.hlsl", !"\0D\0A#include \22Globals.hlsli\22\0D\0A#include \22BRDFFunctions.hlsli\22\0D\0A#include \22GeometryPass.hlsli\22\0D\0A\0D\0A\0D\0Afloat4 main(PSInput input) : SV_Target\0D\0A{\0D\0A    MaterialData material = LoadMaterial(input.MaterialID);\0D\0A    \0D\0A    // -- Collect Material Data ---\0D\0A    float3 albedo = material.AlbedoColour;\0D\0A    if (material.AlbedoTexture != InvalidDescriptorIndex)\0D\0A    {\0D\0A        albedo = ResourceHeap_Texture2D[material.AlbedoTexture].Sample(SamplerDefault, input.TexCoord).xyz;\0D\0A    }\0D\0A\0D\0A    albedo = ToneMapping(albedo);\0D\0A    albedo = GammaCorrection(albedo);\0D\0A\0D\0A    return float4(albedo, 1.0f);\0D\0A}"}
