#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; NORMAL                   0   xyz         0     NONE   float   xyz 
; COLOUR                   0   xyzw        1     NONE   float   xyzw
; TEXCOORD                 0   xy          2     NONE   float   xy  
; Position                 0   xyz         3     NONE   float   xyz 
; TANGENT                  0   xyzw        4     NONE   float   xyzw
; MATERIAL                 0   x           5     NONE    uint   x   
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: 1e6e9370965c1c542af7d88eab9744a2.pdb
; shader hash: 1e6e9370965c1c542af7d88eab9744a2
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; NORMAL                   0                 linear       
; COLOUR                   0                 linear       
; TEXCOORD                 0                 linear       
; Position                 0                 linear       
; TANGENT                  0                 linear       

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc 1.2", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !46, globals: !147)
!1 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc\5CGeometryPassPS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !22, !8, !30, !37}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 56, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 56, size: 288, align: 32, elements: !6, templateParams: !17)
!6 = !{!7, !9, !10, !11, !12, !13, !14, !15, !16}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !5, file: !1, line: 56, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !5, file: !1, line: 56, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !5, file: !1, line: 56, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !5, file: !1, line: 56, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !5, file: !1, line: 56, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !5, file: !1, line: 56, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !5, file: !1, line: 56, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !5, file: !1, line: 56, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !5, file: !1, line: 56, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!17 = !{!18, !19, !21}
!18 = !DITemplateTypeParameter(name: "element", type: !8)
!19 = !DITemplateValueParameter(name: "row_count", type: !20, value: i32 3)
!20 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!21 = !DITemplateValueParameter(name: "col_count", type: !20, value: i32 3)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, size: 96, align: 32, elements: !24, templateParams: !28)
!24 = !{!25, !26, !27}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !23, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!28 = !{!18, !29}
!29 = !DITemplateValueParameter(name: "element_count", type: !20, value: i32 3)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !31)
!31 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !32, templateParams: !35)
!32 = !{!33, !34}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !31, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !31, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!35 = !{!18, !36}
!36 = !DITemplateValueParameter(name: "element_count", type: !20, value: i32 2)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !38)
!38 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !39, templateParams: !44)
!39 = !{!40, !41, !42, !43}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !38, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !38, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !38, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !38, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!44 = !{!18, !45}
!45 = !DITemplateValueParameter(name: "element_count", type: !20, value: i32 4)
!46 = !{!47, !60, !78, !108, !112, !115, !118, !121, !134, !144}
!47 = !DISubprogram(name: "main", scope: !1, file: !1, line: 22, type: !48, isLocal: false, isDefinition: true, scopeLine: 23, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!48 = !DISubroutineType(types: !49)
!49 = !{!37, !50}
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "PSInput", file: !1, line: 8, size: 544, align: 32, elements: !51)
!51 = !{!52, !53, !54, !55, !56, !57}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "NormalWS", scope: !50, file: !1, line: 10, baseType: !22, size: 96, align: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !50, file: !1, line: 11, baseType: !37, size: 128, align: 32, offset: 96)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !50, file: !1, line: 12, baseType: !30, size: 64, align: 32, offset: 224)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "PositionWS", scope: !50, file: !1, line: 13, baseType: !22, size: 96, align: 32, offset: 288)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "TangentWS", scope: !50, file: !1, line: 14, baseType: !37, size: 128, align: 32, offset: 384)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "MaterialID", scope: !50, file: !1, line: 15, baseType: !58, size: 32, align: 32, offset: 512)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, baseType: !59)
!59 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!60 = !DISubprogram(name: "LoadMaterial", linkageName: "\01?LoadMaterial@@YA?AUMaterialData@@I@Z", scope: !61, file: !61, line: 61, type: !62, isLocal: false, isDefinition: true, scopeLine: 62, flags: DIFlagPrototyped, isOptimized: false)
!61 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc/Globals.hlsli", directory: "")
!62 = !DISubroutineType(types: !63)
!63 = !{!64, !58}
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "MaterialData", file: !65, line: 71, size: 416, align: 32, elements: !66)
!65 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc/../Include/Shaders/ShaderInteropStructures.h", directory: "")
!66 = !{!67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "AlbedoColour", scope: !64, file: !65, line: 73, baseType: !22, size: 96, align: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "AlbedoTexture", scope: !64, file: !65, line: 74, baseType: !58, size: 32, align: 32, offset: 96)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "MaterialTexture", scope: !64, file: !65, line: 78, baseType: !58, size: 32, align: 32, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "RoughnessTexture", scope: !64, file: !65, line: 79, baseType: !58, size: 32, align: 32, offset: 160)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "MetalnessTexture", scope: !64, file: !65, line: 80, baseType: !58, size: 32, align: 32, offset: 192)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "AOTexture", scope: !64, file: !65, line: 81, baseType: !58, size: 32, align: 32, offset: 224)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "NormalTexture", scope: !64, file: !65, line: 85, baseType: !58, size: 32, align: 32, offset: 256)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "Metalness", scope: !64, file: !65, line: 86, baseType: !8, size: 32, align: 32, offset: 288)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "Roughness", scope: !64, file: !65, line: 87, baseType: !8, size: 32, align: 32, offset: 320)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "AO", scope: !64, file: !65, line: 88, baseType: !8, size: 32, align: 32, offset: 352)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !64, file: !65, line: 92, baseType: !58, size: 32, align: 32, offset: 384)
!78 = !DISubprogram(name: "GetCamera", linkageName: "\01?GetCamera@@YA?AUCamera@@XZ", scope: !61, file: !61, line: 46, type: !79, isLocal: false, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: false)
!79 = !DISubroutineType(types: !80)
!80 = !{!81}
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "Camera", file: !65, line: 144, size: 1120, align: 32, elements: !82)
!82 = !{!83, !106, !107}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "ViewProjection", scope: !81, file: !65, line: 146, baseType: !84, size: 512, align: 32)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 64, baseType: !85)
!85 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 64, size: 512, align: 32, elements: !86, templateParams: !103)
!86 = !{!87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !85, file: !1, line: 64, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !85, file: !1, line: 64, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !85, file: !1, line: 64, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !85, file: !1, line: 64, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !85, file: !1, line: 64, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !85, file: !1, line: 64, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !85, file: !1, line: 64, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !85, file: !1, line: 64, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !85, file: !1, line: 64, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !85, file: !1, line: 64, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !85, file: !1, line: 64, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !85, file: !1, line: 64, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !85, file: !1, line: 64, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !85, file: !1, line: 64, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !85, file: !1, line: 64, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !85, file: !1, line: 64, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!103 = !{!18, !104, !105}
!104 = !DITemplateValueParameter(name: "row_count", type: !20, value: i32 4)
!105 = !DITemplateValueParameter(name: "col_count", type: !20, value: i32 4)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "ShadowViewProjection", scope: !81, file: !65, line: 150, baseType: !84, size: 512, align: 32, offset: 512)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "CameraPosition", scope: !81, file: !65, line: 154, baseType: !22, size: 96, align: 32, offset: 1024)
!108 = !DISubprogram(name: "DistributionGGX", linkageName: "\01?DistributionGGX@@YAMV?$vector@M$02@@0M@Z", scope: !109, file: !109, line: 16, type: !110, isLocal: false, isDefinition: true, scopeLine: 17, flags: DIFlagPrototyped, isOptimized: false)
!109 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc/BRDFFunctions.hlsli", directory: "")
!110 = !DISubroutineType(types: !111)
!111 = !{!8, !22, !22, !8}
!112 = !DISubprogram(name: "GeometrySmith", linkageName: "\01?GeometrySmith@@YAMV?$vector@M$02@@00M@Z", scope: !109, file: !109, line: 46, type: !113, isLocal: false, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: false)
!113 = !DISubroutineType(types: !114)
!114 = !{!8, !22, !22, !22, !8}
!115 = !DISubprogram(name: "GeometrySchlickGGX", linkageName: "\01?GeometrySchlickGGX@@YAMMM@Z", scope: !109, file: !109, line: 34, type: !116, isLocal: false, isDefinition: true, scopeLine: 35, flags: DIFlagPrototyped, isOptimized: false)
!116 = !DISubroutineType(types: !117)
!117 = !{!8, !8, !8}
!118 = !DISubprogram(name: "FresnelSchlick", linkageName: "\01?FresnelSchlick@@YA?AV?$vector@M$02@@MV1@@Z", scope: !109, file: !109, line: 62, type: !119, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: false)
!119 = !DISubroutineType(types: !120)
!120 = !{!22, !8, !22}
!121 = !DISubprogram(name: "GetScene", linkageName: "\01?GetScene@@YA?AUSceneData@@XZ", scope: !61, file: !61, line: 36, type: !122, isLocal: false, isDefinition: true, scopeLine: 37, flags: DIFlagPrototyped, isOptimized: false)
!122 = !DISubroutineType(types: !123)
!123 = !{!124}
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "SceneData", file: !65, line: 54, size: 256, align: 32, elements: !125)
!125 = !{!126, !127, !128, !129, !130, !131, !132, !133}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "MeshBufferIndex", scope: !124, file: !65, line: 56, baseType: !58, size: 32, align: 32)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "GeometryBufferIndex", scope: !124, file: !65, line: 57, baseType: !58, size: 32, align: 32, offset: 32)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "MaterialBufferIndex", scope: !124, file: !65, line: 58, baseType: !58, size: 32, align: 32, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "IrradianceMapTexIndex", scope: !124, file: !65, line: 59, baseType: !58, size: 32, align: 32, offset: 96)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "PreFilteredEnvMapTexIndex", scope: !124, file: !65, line: 63, baseType: !58, size: 32, align: 32, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_padding0", scope: !124, file: !65, line: 64, baseType: !58, size: 32, align: 32, offset: 160)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_padding1", scope: !124, file: !65, line: 65, baseType: !58, size: 32, align: 32, offset: 192)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_padding2", scope: !124, file: !65, line: 66, baseType: !58, size: 32, align: 32, offset: 224)
!134 = !DISubprogram(name: "GetFrame", linkageName: "\01?GetFrame@@YA?AUFrame@@XZ", scope: !61, file: !61, line: 41, type: !135, isLocal: false, isDefinition: true, scopeLine: 42, flags: DIFlagPrototyped, isOptimized: false)
!135 = !DISubroutineType(types: !136)
!136 = !{!137}
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "Frame", file: !65, line: 132, size: 384, align: 32, elements: !138)
!138 = !{!139, !140, !141, !142, !143}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "BrdfLUTTexIndex", scope: !137, file: !65, line: 134, baseType: !58, size: 32, align: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_padding0", scope: !137, file: !65, line: 135, baseType: !58, size: 32, align: 32, offset: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_padding1", scope: !137, file: !65, line: 136, baseType: !58, size: 32, align: 32, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_padding2", scope: !137, file: !65, line: 137, baseType: !58, size: 32, align: 32, offset: 96)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "Scene", scope: !137, file: !65, line: 141, baseType: !124, size: 256, align: 32, offset: 128)
!144 = !DISubprogram(name: "FresnelSchlick", linkageName: "\01?FresnelSchlick@@YA?AV?$vector@M$02@@MV1@M@Z", scope: !109, file: !109, line: 67, type: !145, isLocal: false, isDefinition: true, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: false)
!145 = !DISubroutineType(types: !146)
!146 = !{!22, !8, !22, !8}
!147 = !{!148, !150, !151, !153, !154, !155, !163, !166, !169, !171, !172, !174, !175}
!148 = !DIGlobalVariable(name: "Fdielectric", scope: !0, file: !1, line: 19, type: !149, isLocal: true, isDefinition: true, variable: float 0x3FA47AE140000000)
!149 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!150 = !DIGlobalVariable(name: "MaxReflectionLod", scope: !0, file: !1, line: 20, type: !149, isLocal: true, isDefinition: true, variable: float 7.000000e+00)
!151 = !DIGlobalVariable(name: "ENTITY_TYPE_DIRECTIONALLIGHT", scope: !0, file: !65, line: 12, type: !152, isLocal: true, isDefinition: true)
!152 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!153 = !DIGlobalVariable(name: "ENTITY_TYPE_OMNILIGHT", scope: !0, file: !65, line: 13, type: !152, isLocal: true, isDefinition: true)
!154 = !DIGlobalVariable(name: "ENTITY_TYPE_SPOTLIGHT", scope: !0, file: !65, line: 14, type: !152, isLocal: true, isDefinition: true)
!155 = !DIGlobalVariable(name: "ResourceHeap_Texture2D", linkageName: "\01?ResourceHeap_Texture2D@@3PAV?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !156, line: 7, type: !157, isLocal: false, isDefinition: true, variable: [0 x %"class.Texture2D<vector<float, 4> >"]* @"\01?ResourceHeap_Texture2D@@3PAV?$Texture2D@V?$vector@M$03@@@@A")
!156 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc/ResourceHeapTables.hlsli", directory: "")
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 160, align: 32, elements: !161)
!158 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 7, size: 160, align: 32, elements: !2, templateParams: !159)
!159 = !{!160}
!160 = !DITemplateTypeParameter(name: "element", type: !38)
!161 = !{!162}
!162 = !DISubrange(count: 1)
!163 = !DIGlobalVariable(name: "ResourceHeap_TextureCube", linkageName: "\01?ResourceHeap_TextureCube@@3PAV?$TextureCube@V?$vector@M$03@@@@A", scope: !0, file: !156, line: 8, type: !164, isLocal: false, isDefinition: true, variable: [0 x %"class.TextureCube<vector<float, 4> >"]* @"\01?ResourceHeap_TextureCube@@3PAV?$TextureCube@V?$vector@M$03@@@@A")
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 128, align: 32, elements: !161)
!165 = !DICompositeType(tag: DW_TAG_class_type, name: "TextureCube<vector<float, 4> >", file: !1, line: 8, size: 128, align: 32, elements: !2, templateParams: !159)
!166 = !DIGlobalVariable(name: "ResourceHeap_Buffer", linkageName: "\01?ResourceHeap_Buffer@@3PAUByteAddressBuffer@@A", scope: !0, file: !156, line: 9, type: !167, isLocal: false, isDefinition: true, variable: [0 x %struct.ByteAddressBuffer]* @"\01?ResourceHeap_Buffer@@3PAUByteAddressBuffer@@A")
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 32, align: 32, elements: !161)
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteAddressBuffer", file: !1, line: 9, size: 32, align: 32, elements: !2)
!169 = !DIGlobalVariable(name: "SamplerDefault", linkageName: "\01?SamplerDefault@@3USamplerState@@A", scope: !0, file: !61, line: 32, type: !170, isLocal: false, isDefinition: true, variable: %struct.SamplerState* @"\01?SamplerDefault@@3USamplerState@@A")
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 32, size: 32, align: 32, elements: !2)
