#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; NORMAL                   0   xyz         0     NONE   float   xyz 
; COLOUR                   0   xyzw        1     NONE   float   xyzw
; TEXCOORD                 0   xy          2     NONE   float   xy  
; Position                 0   xyz         3     NONE   float   xyz 
; TANGENT                  0   xyzw        4     NONE   float   xyzw
; MATERIAL                 0   x           5     NONE    uint   x   
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: c712709ed43be36113995401aa8ef31d.pdb
; shader hash: c712709ed43be36113995401aa8ef31d
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; NORMAL                   0                 linear       
; COLOUR                   0                 linear       
; TEXCOORD                 0                 linear       
; Position                 0                 linear       
; TANGENT                  0                 linear       

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc 1.2", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !46, globals: !179)
!1 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc\5CGeometryPassPS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !22, !8, !30, !37}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 64, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 64, size: 288, align: 32, elements: !6, templateParams: !17)
!6 = !{!7, !9, !10, !11, !12, !13, !14, !15, !16}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !5, file: !1, line: 64, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !5, file: !1, line: 64, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !5, file: !1, line: 64, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !5, file: !1, line: 64, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !5, file: !1, line: 64, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !5, file: !1, line: 64, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !5, file: !1, line: 64, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !5, file: !1, line: 64, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !5, file: !1, line: 64, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!17 = !{!18, !19, !21}
!18 = !DITemplateTypeParameter(name: "element", type: !8)
!19 = !DITemplateValueParameter(name: "row_count", type: !20, value: i32 3)
!20 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!21 = !DITemplateValueParameter(name: "col_count", type: !20, value: i32 3)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, size: 96, align: 32, elements: !24, templateParams: !28)
!24 = !{!25, !26, !27}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !23, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!28 = !{!18, !29}
!29 = !DITemplateValueParameter(name: "element_count", type: !20, value: i32 3)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !31)
!31 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !32, templateParams: !35)
!32 = !{!33, !34}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !31, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !31, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!35 = !{!18, !36}
!36 = !DITemplateValueParameter(name: "element_count", type: !20, value: i32 2)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !38)
!38 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !39, templateParams: !44)
!39 = !{!40, !41, !42, !43}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !38, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !38, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !38, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !38, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!44 = !{!18, !45}
!45 = !DITemplateValueParameter(name: "element_count", type: !20, value: i32 4)
!46 = !{!47, !60, !78, !108, !121, !150, !151, !152, !153, !157, !160, !163, !166, !176}
!47 = !DISubprogram(name: "main", scope: !1, file: !1, line: 22, type: !48, isLocal: false, isDefinition: true, scopeLine: 23, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!48 = !DISubroutineType(types: !49)
!49 = !{!37, !50}
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "PSInput", file: !1, line: 8, size: 544, align: 32, elements: !51)
!51 = !{!52, !53, !54, !55, !56, !57}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "NormalWS", scope: !50, file: !1, line: 10, baseType: !22, size: 96, align: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !50, file: !1, line: 11, baseType: !37, size: 128, align: 32, offset: 96)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !50, file: !1, line: 12, baseType: !30, size: 64, align: 32, offset: 224)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "PositionWS", scope: !50, file: !1, line: 13, baseType: !22, size: 96, align: 32, offset: 288)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "TangentWS", scope: !50, file: !1, line: 14, baseType: !37, size: 128, align: 32, offset: 384)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "MaterialID", scope: !50, file: !1, line: 15, baseType: !58, size: 32, align: 32, offset: 512)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, baseType: !59)
!59 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!60 = !DISubprogram(name: "LoadMaterial", linkageName: "\01?LoadMaterial@@YA?AUMaterialData@@I@Z", scope: !61, file: !61, line: 62, type: !62, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: false)
!61 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc/Globals.hlsli", directory: "")
!62 = !DISubroutineType(types: !63)
!63 = !{!64, !58}
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "MaterialData", file: !65, line: 140, size: 416, align: 32, elements: !66)
!65 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc/../Include/Shaders/ShaderInteropStructures.h", directory: "")
!66 = !{!67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "AlbedoColour", scope: !64, file: !65, line: 142, baseType: !22, size: 96, align: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "AlbedoTexture", scope: !64, file: !65, line: 143, baseType: !58, size: 32, align: 32, offset: 96)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "MaterialTexture", scope: !64, file: !65, line: 147, baseType: !58, size: 32, align: 32, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "RoughnessTexture", scope: !64, file: !65, line: 148, baseType: !58, size: 32, align: 32, offset: 160)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "MetalnessTexture", scope: !64, file: !65, line: 149, baseType: !58, size: 32, align: 32, offset: 192)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "AOTexture", scope: !64, file: !65, line: 150, baseType: !58, size: 32, align: 32, offset: 224)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "NormalTexture", scope: !64, file: !65, line: 154, baseType: !58, size: 32, align: 32, offset: 256)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "Metalness", scope: !64, file: !65, line: 155, baseType: !8, size: 32, align: 32, offset: 288)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "Roughness", scope: !64, file: !65, line: 156, baseType: !8, size: 32, align: 32, offset: 320)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "AO", scope: !64, file: !65, line: 157, baseType: !8, size: 32, align: 32, offset: 352)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !64, file: !65, line: 161, baseType: !58, size: 32, align: 32, offset: 384)
!78 = !DISubprogram(name: "GetCamera", linkageName: "\01?GetCamera@@YA?AUCamera@@XZ", scope: !61, file: !61, line: 47, type: !79, isLocal: false, isDefinition: true, scopeLine: 48, flags: DIFlagPrototyped, isOptimized: false)
!79 = !DISubroutineType(types: !80)
!80 = !{!81}
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "Camera", file: !65, line: 213, size: 1120, align: 32, elements: !82)
!82 = !{!83, !106, !107}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "ViewProjection", scope: !81, file: !65, line: 215, baseType: !84, size: 512, align: 32)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 65, baseType: !85)
!85 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 65, size: 512, align: 32, elements: !86, templateParams: !103)
!86 = !{!87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !85, file: !1, line: 65, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !85, file: !1, line: 65, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !85, file: !1, line: 65, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !85, file: !1, line: 65, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !85, file: !1, line: 65, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !85, file: !1, line: 65, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !85, file: !1, line: 65, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !85, file: !1, line: 65, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !85, file: !1, line: 65, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !85, file: !1, line: 65, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !85, file: !1, line: 65, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !85, file: !1, line: 65, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !85, file: !1, line: 65, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !85, file: !1, line: 65, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !85, file: !1, line: 65, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !85, file: !1, line: 65, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!103 = !{!18, !104, !105}
!104 = !DITemplateValueParameter(name: "row_count", type: !20, value: i32 4)
!105 = !DITemplateValueParameter(name: "col_count", type: !20, value: i32 4)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "ShadowViewProjection", scope: !81, file: !65, line: 219, baseType: !84, size: 512, align: 32, offset: 512)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "CameraPosition", scope: !81, file: !65, line: 223, baseType: !22, size: 96, align: 32, offset: 1024)
!108 = !DISubprogram(name: "GetScene", linkageName: "\01?GetScene@@YA?AUSceneData@@XZ", scope: !61, file: !61, line: 37, type: !109, isLocal: false, isDefinition: true, scopeLine: 38, flags: DIFlagPrototyped, isOptimized: false)
!109 = !DISubroutineType(types: !110)
!110 = !{!111}
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "SceneData", file: !65, line: 123, size: 256, align: 32, elements: !112)
!112 = !{!113, !114, !115, !116, !117, !118, !119, !120}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "MeshBufferIndex", scope: !111, file: !65, line: 125, baseType: !58, size: 32, align: 32)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "GeometryBufferIndex", scope: !111, file: !65, line: 126, baseType: !58, size: 32, align: 32, offset: 32)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "MaterialBufferIndex", scope: !111, file: !65, line: 127, baseType: !58, size: 32, align: 32, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "IrradianceMapTexIndex", scope: !111, file: !65, line: 128, baseType: !58, size: 32, align: 32, offset: 96)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "PreFilteredEnvMapTexIndex", scope: !111, file: !65, line: 132, baseType: !58, size: 32, align: 32, offset: 128)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "NumLights", scope: !111, file: !65, line: 133, baseType: !58, size: 32, align: 32, offset: 160)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_padding1", scope: !111, file: !65, line: 134, baseType: !58, size: 32, align: 32, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_padding2", scope: !111, file: !65, line: 135, baseType: !58, size: 32, align: 32, offset: 224)
!121 = !DISubprogram(name: "LoadLight", linkageName: "\01?LoadLight@@YA?AUShaderLight@@I@Z", scope: !61, file: !61, line: 67, type: !122, isLocal: false, isDefinition: true, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: false)
!122 = !DISubroutineType(types: !123)
!123 = !{!124, !58}
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "ShaderLight", file: !65, line: 19, size: 256, align: 32, elements: !125)
!125 = !{!126, !127, !128, !129, !130, !138, !142, !143, !146, !147}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !124, file: !65, line: 21, baseType: !22, size: 96, align: 32)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "Type8_Flags8_Range16", scope: !124, file: !65, line: 22, baseType: !58, size: 32, align: 32, offset: 96)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "Energy16_X16", scope: !124, file: !65, line: 26, baseType: !58, size: 32, align: 32, offset: 128)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "ColorPacked", scope: !124, file: !65, line: 27, baseType: !58, size: 32, align: 32, offset: 160)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_Padding", scope: !124, file: !65, line: 28, baseType: !131, size: 64, align: 32, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 86, baseType: !132)
!132 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 86, size: 64, align: 32, elements: !133, templateParams: !136)
!133 = !{!134, !135}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !132, file: !1, line: 86, baseType: !59, size: 32, align: 32, flags: DIFlagPublic)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !132, file: !1, line: 86, baseType: !59, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!136 = !{!137, !36}
!137 = !DITemplateTypeParameter(name: "element", type: !59)
!138 = !DISubprogram(name: "GetType", linkageName: "\01?GetType@ShaderLight@@QAAIXZ", scope: !124, file: !65, line: 31, type: !139, isLocal: false, isDefinition: false, scopeLine: 31, flags: DIFlagPrototyped, isOptimized: false)
!139 = !DISubroutineType(types: !140)
!140 = !{!58, !141}
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!142 = !DISubprogram(name: "GetFlags", linkageName: "\01?GetFlags@ShaderLight@@QAAIXZ", scope: !124, file: !65, line: 36, type: !139, isLocal: false, isDefinition: false, scopeLine: 36, flags: DIFlagPrototyped, isOptimized: false)
!143 = !DISubprogram(name: "GetRange", linkageName: "\01?GetRange@ShaderLight@@QAAMXZ", scope: !124, file: !65, line: 41, type: !144, isLocal: false, isDefinition: false, scopeLine: 41, flags: DIFlagPrototyped, isOptimized: false)
!144 = !DISubroutineType(types: !145)
!145 = !{!8, !141}
!146 = !DISubprogram(name: "GetEnergy", linkageName: "\01?GetEnergy@ShaderLight@@QAAMXZ", scope: !124, file: !65, line: 46, type: !144, isLocal: false, isDefinition: false, scopeLine: 46, flags: DIFlagPrototyped, isOptimized: false)
!147 = !DISubprogram(name: "GetColor", linkageName: "\01?GetColor@ShaderLight@@QAA?AV?$vector@M$03@@XZ", scope: !124, file: !65, line: 51, type: !148, isLocal: false, isDefinition: false, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: false)
!148 = !DISubroutineType(types: !149)
!149 = !{!37, !141}
!150 = !DISubprogram(name: "GetRange", linkageName: "\01?GetRange@ShaderLight@@QAAMXZ", scope: !124, file: !65, line: 41, type: !144, isLocal: false, isDefinition: true, scopeLine: 42, flags: DIFlagPrototyped, isOptimized: false, declaration: !143)
!151 = !DISubprogram(name: "GetColor", linkageName: "\01?GetColor@ShaderLight@@QAA?AV?$vector@M$03@@XZ", scope: !124, file: !65, line: 51, type: !148, isLocal: false, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: false, declaration: !147)
!152 = !DISubprogram(name: "GetEnergy", linkageName: "\01?GetEnergy@ShaderLight@@QAAMXZ", scope: !124, file: !65, line: 46, type: !144, isLocal: false, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: false, declaration: !146)
!153 = !DISubprogram(name: "DistributionGGX", linkageName: "\01?DistributionGGX@@YAMV?$vector@M$02@@0M@Z", scope: !154, file: !154, line: 16, type: !155, isLocal: false, isDefinition: true, scopeLine: 17, flags: DIFlagPrototyped, isOptimized: false)
!154 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc/BRDFFunctions.hlsli", directory: "")
!155 = !DISubroutineType(types: !156)
!156 = !{!8, !22, !22, !8}
!157 = !DISubprogram(name: "GeometrySmith", linkageName: "\01?GeometrySmith@@YAMV?$vector@M$02@@00M@Z", scope: !154, file: !154, line: 46, type: !158, isLocal: false, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: false)
!158 = !DISubroutineType(types: !159)
!159 = !{!8, !22, !22, !22, !8}
!160 = !DISubprogram(name: "GeometrySchlickGGX", linkageName: "\01?GeometrySchlickGGX@@YAMMM@Z", scope: !154, file: !154, line: 34, type: !161, isLocal: false, isDefinition: true, scopeLine: 35, flags: DIFlagPrototyped, isOptimized: false)
!161 = !DISubroutineType(types: !162)
!162 = !{!8, !8, !8}
!163 = !DISubprogram(name: "FresnelSchlick", linkageName: "\01?FresnelSchlick@@YA?AV?$vector@M$02@@MV1@@Z", scope: !154, file: !154, line: 62, type: !164, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: false)
!164 = !DISubroutineType(types: !165)
!165 = !{!22, !8, !22}
!166 = !DISubprogram(name: "GetFrame", linkageName: "\01?GetFrame@@YA?AUFrame@@XZ", scope: !61, file: !61, line: 42, type: !167, isLocal: false, isDefinition: true, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: false)
!167 = !DISubroutineType(types: !168)
!168 = !{!169}
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "Frame", file: !65, line: 201, size: 384, align: 32, elements: !170)
!170 = !{!171, !172, !173, !174, !175}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "BrdfLUTTexIndex", scope: !169, file: !65, line: 203, baseType: !58, size: 32, align: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_padding0", scope: !169, file: !65, line: 204, baseType: !58, size: 32, align: 32, offset: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_padding1", scope: !169, file: !65, line: 205, baseType: !58, size: 32, align: 32, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_padding2", scope: !169, file: !65, line: 206, baseType: !58, size: 32, align: 32, offset: 96)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "Scene", scope: !169, file: !65, line: 210, baseType: !111, size: 256, align: 32, offset: 128)
!176 = !DISubprogram(name: "FresnelSchlick", linkageName: "\01?FresnelSchlick@@YA?AV?$vector@M$02@@MV1@M@Z", scope: !154, file: !154, line: 67, type: !177, isLocal: false, isDefinition: true, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: false)
!177 = !DISubroutineType(types: !178)
!178 = !{!22, !8, !22, !8}
!179 = !{!180, !182, !183, !185, !186, !187, !195, !198, !201, !205, !207, !208, !210, !211}
!180 = !DIGlobalVariable(name: "Fdielectric", scope: !0, file: !1, line: 19, type: !181, isLocal: true, isDefinition: true, variable: float 0x3FA47AE140000000)
!181 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!182 = !DIGlobalVariable(name: "MaxReflectionLod", scope: !0, file: !1, line: 20, type: !181, isLocal: true, isDefinition: true, variable: float 7.000000e+00)
!183 = !DIGlobalVariable(name: "ENTITY_TYPE_DIRECTIONALLIGHT", scope: !0, file: !65, line: 15, type: !184, isLocal: true, isDefinition: true)
!184 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!185 = !DIGlobalVariable(name: "ENTITY_TYPE_OMNILIGHT", scope: !0, file: !65, line: 16, type: !184, isLocal: true, isDefinition: true)
!186 = !DIGlobalVariable(name: "ENTITY_TYPE_SPOTLIGHT", scope: !0, file: !65, line: 17, type: !184, isLocal: true, isDefinition: true)
!187 = !DIGlobalVariable(name: "ResourceHeap_Texture2D", linkageName: "\01?ResourceHeap_Texture2D@@3PAV?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !188, line: 7, type: !189, isLocal: false, isDefinition: true, variable: [0 x %"class.Texture2D<vector<float, 4> >"]* @"\01?ResourceHeap_Texture2D@@3PAV?$Texture2D@V?$vector@M$03@@@@A")
!188 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc/ResourceHeapTables.hlsli", directory: "")
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 160, align: 32, elements: !193)
!190 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 7, size: 160, align: 32, elements: !2, templateParams: !191)
!191 = !{!192}
!192 = !DITemplateTypeParameter(name: "element", type: !38)
!193 = !{!194}
!194 = !DISubrange(count: 1)
!195 = !DIGlobalVariable(name: "ResourceHeap_TextureCube", linkageName: "\01?ResourceHeap_TextureCube@@3PAV?$TextureCube@V?$vector@M$03@@@@A", scope: !0, file: !188, line: 8, type: !196, isLocal: false, isDefinition: true, variable: [0 x %"class.TextureCube<vector<float, 4> >"]* @"\01?ResourceHeap_TextureCube@@3PAV?$TextureCube@V?$vector@M$03@@@@A")
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 128, align: 32, elements: !193)
!197 = !DICompositeType(tag: DW_TAG_class_type, name: "TextureCube<vector<float, 4> >", file: !1, line: 8, size: 128, align: 32, elements: !2, templateParams: !191)
!198 = !DIGlobalVariable(name: "ResourceHeap_Buffer", linkageName: "\01?ResourceHeap_Buffer@@3PAUByteAddressBuffer@@A", scope: !0, file: !188, line: 9, type: !199, isLocal: false, isDefinition: true, variable: [0 x %struct.ByteAddressBuffer]* @"\01?ResourceHeap_Buffer@@3PAUByteAddressBuffer@@A")
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 32, align: 32, elements: !193)
!200 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteAddressBuffer", file: !1, line: 9, size: 32, align: 32, elements: !2)
!201 = !DIGlobalVariable(name: "LightSB", linkageName: "\01?LightSB@@3V?$StructuredBuffer@UShaderLight@@@@A", scope: !0, file: !61, line: 29, type: !202, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<ShaderLight>"* @"\01?LightSB@@3V?$StructuredBuffer@UShaderLight@@@@A")
!202 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<ShaderLight>", file: !1, line: 29, size: 256, align: 32, elements: !2, templateParams: !203)
!203 = !{!204}
!204 = !DITemplateTypeParameter(name: "element", type: !124)
