#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_VertexID              0   x           0   VERTID    uint   x   
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; NORMAL                   0   xyz         0     NONE   float   xyz 
; COLOUR                   0   xyzw        1     NONE   float   xyzw
; TEXCOORD                 0   xy          2     NONE   float   xy  
; Position                 0   xyz         3     NONE   float   xyz 
; TANGENT                  0   xyzw        4     NONE   float   xyzw
; MATERIAL                 0   x           5     NONE    uint   x   
; SV_Position              0   xyzw        6      POS   float   xyzw
;
; shader debug name: 65eddee0820c2237a3f74ea5e61762ef.pdb
; shader hash: 65eddee0820c2237a3f74ea5e61762ef
;
; Pipeline Runtime Information: 
;
; Vertex Shader
; OutputPositionPresent=1
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_VertexID              0                              
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; NORMAL                   0                 linear       

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc 1.2", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !31, globals: !129)
!1 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc\5CGeometryPassVS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !16}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 49, baseType: !17)
!17 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 49, size: 288, align: 32, elements: !18, templateParams: !28)
!18 = !{!19, !20, !21, !22, !23, !24, !25, !26, !27}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !17, file: !1, line: 49, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !17, file: !1, line: 49, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !17, file: !1, line: 49, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !17, file: !1, line: 49, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !17, file: !1, line: 49, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !17, file: !1, line: 49, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !17, file: !1, line: 49, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !17, file: !1, line: 49, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !17, file: !1, line: 49, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!28 = !{!13, !29, !30}
!29 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 3)
!30 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 3)
!31 = !{!32, !61, !86, !99}
!32 = !DISubprogram(name: "main", scope: !1, file: !1, line: 28, type: !33, isLocal: false, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!33 = !DISubroutineType(types: !34)
!34 = !{!35, !58}
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "VsOutput", file: !1, line: 16, size: 672, align: 32, elements: !36)
!36 = !{!37, !46, !47, !55, !56, !57, !60}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "NormalWS", scope: !35, file: !1, line: 18, baseType: !38, size: 96, align: 32)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, baseType: !39)
!39 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, size: 96, align: 32, elements: !40, templateParams: !44)
!40 = !{!41, !42, !43}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !39, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !39, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !39, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!44 = !{!13, !45}
!45 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !35, file: !1, line: 19, baseType: !4, size: 128, align: 32, offset: 96)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !35, file: !1, line: 20, baseType: !48, size: 64, align: 32, offset: 224)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !49)
!49 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !50, templateParams: !53)
!50 = !{!51, !52}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !49, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !49, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!53 = !{!13, !54}
!54 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "PositionWS", scope: !35, file: !1, line: 22, baseType: !38, size: 96, align: 32, offset: 288)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "TangentWS", scope: !35, file: !1, line: 23, baseType: !4, size: 128, align: 32, offset: 384)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "MaterialID", scope: !35, file: !1, line: 24, baseType: !58, size: 32, align: 32, offset: 512)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, baseType: !59)
!59 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !35, file: !1, line: 25, baseType: !4, size: 128, align: 32, offset: 544)
!61 = !DISubprogram(name: "LoadGeometry", linkageName: "\01?LoadGeometry@@YA?AUGeometry@@I@Z", scope: !62, file: !62, line: 57, type: !63, isLocal: false, isDefinition: true, scopeLine: 58, flags: DIFlagPrototyped, isOptimized: false)
!62 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc/Globals.hlsli", directory: "")
!63 = !DISubroutineType(types: !64)
!64 = !{!65, !58}
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "Geometry", file: !66, line: 227, size: 384, align: 32, elements: !67)
!66 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc/../Include/Shaders/ShaderInteropStructures.h", directory: "")
!67 = !{!68, !69, !70, !71, !72, !73, !74, !75, !76, !77}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "MaterialIndex", scope: !65, file: !66, line: 229, baseType: !58, size: 32, align: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "NumIndices", scope: !65, file: !66, line: 230, baseType: !58, size: 32, align: 32, offset: 32)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "NumVertices", scope: !65, file: !66, line: 231, baseType: !58, size: 32, align: 32, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "IndexOffset", scope: !65, file: !66, line: 232, baseType: !58, size: 32, align: 32, offset: 96)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "VertexBufferIndex", scope: !65, file: !66, line: 235, baseType: !58, size: 32, align: 32, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "PositionOffset", scope: !65, file: !66, line: 236, baseType: !58, size: 32, align: 32, offset: 160)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoordOffset", scope: !65, file: !66, line: 237, baseType: !58, size: 32, align: 32, offset: 192)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "NormalOffset", scope: !65, file: !66, line: 238, baseType: !58, size: 32, align: 32, offset: 224)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "TangentOffset", scope: !65, file: !66, line: 241, baseType: !58, size: 32, align: 32, offset: 256)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_padding", scope: !65, file: !66, line: 242, baseType: !78, size: 96, align: 32, offset: 288)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 33, baseType: !79)
!79 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 33, size: 96, align: 32, elements: !80, templateParams: !84)
!80 = !{!81, !82, !83}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !79, file: !1, line: 33, baseType: !59, size: 32, align: 32, flags: DIFlagPublic)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !79, file: !1, line: 33, baseType: !59, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !79, file: !1, line: 33, baseType: !59, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!84 = !{!85, !45}
!85 = !DITemplateTypeParameter(name: "element", type: !59)
!86 = !DISubprogram(name: "GetScene", linkageName: "\01?GetScene@@YA?AUSceneData@@XZ", scope: !62, file: !62, line: 37, type: !87, isLocal: false, isDefinition: true, scopeLine: 38, flags: DIFlagPrototyped, isOptimized: false)
!87 = !DISubroutineType(types: !88)
!88 = !{!89}
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "SceneData", file: !66, line: 153, size: 256, align: 32, elements: !90)
!90 = !{!91, !92, !93, !94, !95, !96, !97, !98}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "MeshBufferIndex", scope: !89, file: !66, line: 155, baseType: !58, size: 32, align: 32)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "GeometryBufferIndex", scope: !89, file: !66, line: 156, baseType: !58, size: 32, align: 32, offset: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "MaterialBufferIndex", scope: !89, file: !66, line: 157, baseType: !58, size: 32, align: 32, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "IrradianceMapTexIndex", scope: !89, file: !66, line: 158, baseType: !58, size: 32, align: 32, offset: 96)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "PreFilteredEnvMapTexIndex", scope: !89, file: !66, line: 162, baseType: !58, size: 32, align: 32, offset: 128)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "NumLights", scope: !89, file: !66, line: 163, baseType: !58, size: 32, align: 32, offset: 160)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_padding1", scope: !89, file: !66, line: 164, baseType: !58, size: 32, align: 32, offset: 192)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_padding2", scope: !89, file: !66, line: 165, baseType: !58, size: 32, align: 32, offset: 224)
!99 = !DISubprogram(name: "GetCamera", linkageName: "\01?GetCamera@@YA?AUCamera@@XZ", scope: !62, file: !62, line: 47, type: !100, isLocal: false, isDefinition: true, scopeLine: 48, flags: DIFlagPrototyped, isOptimized: false)
!100 = !DISubroutineType(types: !101)
!101 = !{!102}
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "Camera", file: !66, line: 259, size: 1120, align: 32, elements: !103)
!103 = !{!104, !127, !128}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "ViewProjection", scope: !102, file: !66, line: 261, baseType: !105, size: 512, align: 32)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 40, baseType: !106)
!106 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 38, size: 512, align: 32, elements: !107, templateParams: !124)
!107 = !{!108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !106, file: !1, line: 38, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !106, file: !1, line: 38, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !106, file: !1, line: 38, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !106, file: !1, line: 38, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !106, file: !1, line: 38, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !106, file: !1, line: 38, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !106, file: !1, line: 38, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !106, file: !1, line: 38, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !106, file: !1, line: 38, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !106, file: !1, line: 38, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !106, file: !1, line: 38, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !106, file: !1, line: 38, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !106, file: !1, line: 38, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !106, file: !1, line: 38, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !106, file: !1, line: 38, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !106, file: !1, line: 38, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!124 = !{!13, !125, !126}
!125 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!126 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "ShadowViewProjection", scope: !102, file: !66, line: 265, baseType: !105, size: 512, align: 32, offset: 512)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "CameraPosition", scope: !102, file: !66, line: 269, baseType: !38, size: 96, align: 32, offset: 1024)
!129 = !{!130, !132, !133, !134, !142, !145, !148, !177, !179, !180}
!130 = !DIGlobalVariable(name: "ENTITY_TYPE_DIRECTIONALLIGHT", scope: !0, file: !66, line: 15, type: !131, isLocal: true, isDefinition: true)
!131 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!132 = !DIGlobalVariable(name: "ENTITY_TYPE_OMNILIGHT", scope: !0, file: !66, line: 16, type: !131, isLocal: true, isDefinition: true)
!133 = !DIGlobalVariable(name: "ENTITY_TYPE_SPOTLIGHT", scope: !0, file: !66, line: 17, type: !131, isLocal: true, isDefinition: true)
!134 = !DIGlobalVariable(name: "ResourceHeap_Texture2D", linkageName: "\01?ResourceHeap_Texture2D@@3PAV?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !135, line: 7, type: !136, isLocal: false, isDefinition: true)
!135 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc/ResourceHeapTables.hlsli", directory: "")
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 160, align: 32, elements: !140)
!137 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 7, size: 160, align: 32, elements: !2, templateParams: !138)
!138 = !{!139}
!139 = !DITemplateTypeParameter(name: "element", type: !5)
!140 = !{!141}
!141 = !DISubrange(count: 1)
!142 = !DIGlobalVariable(name: "ResourceHeap_TextureCube", linkageName: "\01?ResourceHeap_TextureCube@@3PAV?$TextureCube@V?$vector@M$03@@@@A", scope: !0, file: !135, line: 8, type: !143, isLocal: false, isDefinition: true)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 128, align: 32, elements: !140)
!144 = !DICompositeType(tag: DW_TAG_class_type, name: "TextureCube<vector<float, 4> >", file: !1, line: 8, size: 128, align: 32, elements: !2, templateParams: !138)
!145 = !DIGlobalVariable(name: "ResourceHeap_Buffer", linkageName: "\01?ResourceHeap_Buffer@@3PAUByteAddressBuffer@@A", scope: !0, file: !135, line: 9, type: !146, isLocal: false, isDefinition: true, variable: [0 x %struct.ByteAddressBuffer]* @"\01?ResourceHeap_Buffer@@3PAUByteAddressBuffer@@A")
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 32, align: 32, elements: !140)
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteAddressBuffer", file: !1, line: 34, size: 32, align: 32, elements: !2)
!148 = !DIGlobalVariable(name: "LightSB", linkageName: "\01?LightSB@@3V?$StructuredBuffer@UShaderLight@@@@A", scope: !0, file: !62, line: 29, type: !149, isLocal: false, isDefinition: true)
!149 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<ShaderLight>", file: !1, line: 29, size: 256, align: 32, elements: !2, templateParams: !150)
!150 = !{!151}
!151 = !DITemplateTypeParameter(name: "element", type: !152)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "ShaderLight", file: !66, line: 19, size: 256, align: 32, elements: !153)
!153 = !{!154, !155, !156, !157, !158, !165, !169, !172, !173, !176}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !152, file: !66, line: 21, baseType: !38, size: 96, align: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "Type8_Flags8_Range16", scope: !152, file: !66, line: 22, baseType: !58, size: 32, align: 32, offset: 96)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "Energy16_X16", scope: !152, file: !66, line: 26, baseType: !58, size: 32, align: 32, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "ColorPacked", scope: !152, file: !66, line: 27, baseType: !58, size: 32, align: 32, offset: 160)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_Padding", scope: !152, file: !66, line: 28, baseType: !159, size: 64, align: 32, offset: 192)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 29, baseType: !160)
!160 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 29, size: 64, align: 32, elements: !161, templateParams: !164)
!161 = !{!162, !163}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !160, file: !1, line: 29, baseType: !59, size: 32, align: 32, flags: DIFlagPublic)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !160, file: !1, line: 29, baseType: !59, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!164 = !{!85, !54}
!165 = !DISubprogram(name: "GetColour", linkageName: "\01?GetColour@ShaderLight@@QAA?AV?$vector@M$03@@XZ", scope: !152, file: !66, line: 31, type: !166, isLocal: false, isDefinition: false, scopeLine: 31, flags: DIFlagPrototyped, isOptimized: false)
!166 = !DISubroutineType(types: !167)
!167 = !{!4, !168}
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!169 = !DISubprogram(name: "GetType", linkageName: "\01?GetType@ShaderLight@@QAAIXZ", scope: !152, file: !66, line: 43, type: !170, isLocal: false, isDefinition: false, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: false)
!170 = !DISubroutineType(types: !171)
!171 = !{!58, !168}
!172 = !DISubprogram(name: "GetFlags", linkageName: "\01?GetFlags@ShaderLight@@QAAIXZ", scope: !152, file: !66, line: 48, type: !170, isLocal: false, isDefinition: false, scopeLine: 48, flags: DIFlagPrototyped, isOptimized: false)
!173 = !DISubprogram(name: "GetRange", linkageName: "\01?GetRange@ShaderLight@@QAAMXZ", scope: !152, file: !66, line: 53, type: !174, isLocal: false, isDefinition: false, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: false)
!174 = !DISubroutineType(types: !175)
!175 = !{!8, !168}
!176 = !DISubprogram(name: "GetEnergy", linkageName: "\01?GetEnergy@ShaderLight@@QAAMXZ", scope: !152, file: !66, line: 58, type: !174, isLocal: false, isDefinition: false, scopeLine: 58, flags: DIFlagPrototyped, isOptimized: false)
!177 = !DIGlobalVariable(name: "SamplerDefault", linkageName: "\01?SamplerDefault@@3USamplerState@@A", scope: !0, file: !62, line: 33, type: !178, isLocal: false, isDefinition: true)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 33, size: 32, align: 32, elements: !2)
!179 = !DIGlobalVariable(name: "SamplerBrdf", linkageName: "\01?SamplerBrdf@@3USamplerState@@A", scope: !0, file: !62, line: 34, type: !178, isLocal: false, isDefinition: true)
!180 = !DIGlobalVariable(name: "ShadowSampler", linkageName: "\01?ShadowSampler@@3USamplerComparisonState@@A", scope: !0, file: !62, line: 35, type: !181, isLocal: false, isDefinition: true)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerComparisonState", file: !1, line: 35, size: 32, align: 32, elements: !2)
!182 = !{i32 2, !"Dwarf Version", i32 4}
!183 = !{i32 2, !"Debug Info Version", i32 3}
!184 = !{!"dxc 1.2"}
