#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xy          0     NONE   float   xy  
; TEXCOORD                 0   xy          1     NONE   float   xy  
; COLOR                    0   xyzw        2     NONE   float   xyzw
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; COLOR                    0   xyzw        0     NONE   float   xyzw
; TEXCOORD                 0   xy          1     NONE   float   xy  
; SV_Position              0   xyzw        2      POS   float   xyzw
;
; shader debug name: 8dcbb4c021278ebf8e589ab6a0081862.pdb
; shader hash: 8dcbb4c021278ebf8e589ab6a0081862
;
; Pipeline Runtime Information: 
;
; Vertex Shader
; OutputPositionPresent=1
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; POSITION                 0                              
; TEXCOORD                 0                              
; COLOR                    0                              
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; COLOR                    0                 linear       

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc 1.2", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !37)
!1 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc\5CImGuiVS.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17}
!17 = !DISubprogram(name: "main", scope: !1, file: !1, line: 22, type: !18, isLocal: false, isDefinition: true, scopeLine: 23, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !32}
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSOutput", file: !1, line: 14, size: 320, align: 32, elements: !21)
!21 = !{!22, !23, !31}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !20, file: !1, line: 16, baseType: !4, size: 128, align: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !20, file: !1, line: 17, baseType: !24, size: 64, align: 32, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !26, templateParams: !29)
!26 = !{!27, !28}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !{!13, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !20, file: !1, line: 18, baseType: !4, size: 128, align: 32, offset: 192)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSInput", file: !1, line: 7, size: 256, align: 32, elements: !33)
!33 = !{!34, !35, !36}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !32, file: !1, line: 9, baseType: !24, size: 64, align: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !32, file: !1, line: 10, baseType: !24, size: 64, align: 32, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !32, file: !1, line: 11, baseType: !4, size: 128, align: 32, offset: 128)
!37 = !{!38, !43, !44}
!38 = !DIGlobalVariable(name: "ENTITY_TYPE_DIRECTIONALLIGHT", scope: !0, file: !39, line: 15, type: !40, isLocal: true, isDefinition: true)
!39 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc/../Include/Shaders/ShaderInteropStructures.h", directory: "")
!40 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 15, baseType: !42)
!42 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!43 = !DIGlobalVariable(name: "ENTITY_TYPE_OMNILIGHT", scope: !0, file: !39, line: 16, type: !40, isLocal: true, isDefinition: true)
!44 = !DIGlobalVariable(name: "ENTITY_TYPE_SPOTLIGHT", scope: !0, file: !39, line: 17, type: !40, isLocal: true, isDefinition: true)
!45 = !{i32 2, !"Dwarf Version", i32 4}
!46 = !{i32 2, !"Debug Info Version", i32 3}
!47 = !{!"dxc 1.2"}
!48 = !{!"D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc\5CImGuiVS.hlsl", !"\0D\0A#include \22../Include/Shaders/ShaderInterop.h\22\0D\0A#include \22../Include/Shaders/ShaderInteropStructures.h\22\0D\0A\0D\0APUSH_CONSTANT(push, ImguiDrawInfo);\0D\0A\0D\0Astruct VSInput\0D\0A{\0D\0A    float2 Position : POSITION;\0D\0A    float2 TexCoord : TEXCOORD;\0D\0A    float4 Color : COLOR;\0D\0A};\0D\0A\0D\0Astruct VSOutput\0D\0A{\0D\0A    float4 Colour : COLOR;\0D\0A    float2 TexCoord : TEXCOORD;\0D\0A    float4 Position : SV_Position;\0D\0A};\0D\0A\0D\0A\0D\0AVSOutput main(VSInput input)\0D\0A{\0D\0A    VSOutput output;\0D\0A    output.Position = mul(push.Mvp, float4(input.Position.xy, 0.f, 1.f));\0D\0A    output.Colour = input.Color;\0D\0A    output.TexCoord = input.TexCoord;\0D\0A\0D\0A    return output;\0D\0A}"}
!49 = !{!"D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc/../Include/Shaders/ShaderInterop.h", !"#ifndef __PHX_SHADER_INTEROP_HLSLI__\0D\0A#define __PHX_SHADER_INTEROP_HLSLI__\0D\0A\0D\0A\0D\0A#ifdef __cplusplus\0D\0A\0D\0A#include <DirectXMath.h>\0D\0A\0D\0Ausing float4x4 = DirectX::XMFLOAT4X4;\0D\0Ausing float2 = DirectX::XMFLOAT2;\0D\0Ausing float3 = DirectX::XMFLOAT3;\0D\0Ausing float4 = DirectX::XMFLOAT4;\0D\0A\0D\0Ausing uint = uint32_t;\0D\0Ausing uint2 = DirectX::XMUINT2;\0D\0Ausing uint3 = DirectX::XMUINT3;\0D\0Ausing uint4 = DirectX::XMUINT4;\0D\0A\0D\0Ausing int2 = DirectX::XMINT2;\0D\0Ausing int3 = DirectX::XMINT3;\0D\0Ausing int4 = DirectX::XMINT4;\0D\0A\0D\0A#define CONSTANT_BUFFER(name, type, slot)\0D\0A#define PUSH_CONSTANT(name, type)\0D\0A\0D\0A#else\0D\0A\0D\0A#define CONSTANT_BUFFER(name, type) ConstantBuffer<type> name : register(b999)\0D\0A#define PUSH_CONSTANT(name, type) ConstantBuffer<type> name : register(b999)\0D\0A\0D\0A#endif\0D\0A\0D\0A#define RESOURCE_HEAP_BUFFER_SPACE     space100\0D\0A#define RESOURCE_HEAP_TEX2D_SPACE      space101\0D\0A#define RESOURCE_HEAP_TEX_CUBE_SPACE   space102\0D\0A\0D\0A#endif // __PHX_SHADER_INTEROP_HLSLI__"}
