#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: f0f2ab038adeefbc3e1531197a8d7f80.pdb
; shader hash: f0f2ab038adeefbc3e1531197a8d7f80
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Target                0                              
;
; Buffer Definitions:
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
;
;
; ViewId state:
;
; Number of inputs: 4, outputs: 4
; Outputs dependent on ViewId: {  }
; Inputs contributing to computation of Outputs:
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc 1.2", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !24)
!1 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc\5CMeshRender_BrdfPS.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17}
!17 = !DISubprogram(name: "main", scope: !18, file: !18, line: 134, type: !19, isLocal: false, isDefinition: true, scopeLine: 135, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!18 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc/MeshRender.hlsli", directory: "")
!19 = !DISubroutineType(types: !20)
!20 = !{!4, !21}
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "PSInput", file: !18, line: 66, size: 128, align: 32, elements: !22)
!22 = !{!23}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !21, file: !18, line: 75, baseType: !4, size: 128, align: 32)
!24 = !{!25, !30, !31, !32, !40, !43, !46, !86, !88, !89, !91, !94}
!25 = !DIGlobalVariable(name: "ENTITY_TYPE_DIRECTIONALLIGHT", scope: !0, file: !26, line: 15, type: !27, isLocal: true, isDefinition: true)
!26 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc/../Include/Shaders/ShaderInteropStructures.h", directory: "")
!27 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 15, baseType: !29)
!29 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!30 = !DIGlobalVariable(name: "ENTITY_TYPE_OMNILIGHT", scope: !0, file: !26, line: 16, type: !27, isLocal: true, isDefinition: true)
!31 = !DIGlobalVariable(name: "ENTITY_TYPE_SPOTLIGHT", scope: !0, file: !26, line: 17, type: !27, isLocal: true, isDefinition: true)
!32 = !DIGlobalVariable(name: "ResourceHeap_Texture2D", linkageName: "\01?ResourceHeap_Texture2D@@3PAV?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !33, line: 7, type: !34, isLocal: false, isDefinition: true)
!33 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc/ResourceHeapTables.hlsli", directory: "")
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 160, align: 32, elements: !38)
!35 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 7, size: 160, align: 32, elements: !2, templateParams: !36)
!36 = !{!37}
!37 = !DITemplateTypeParameter(name: "element", type: !5)
!38 = !{!39}
!39 = !DISubrange(count: 1)
!40 = !DIGlobalVariable(name: "ResourceHeap_TextureCube", linkageName: "\01?ResourceHeap_TextureCube@@3PAV?$TextureCube@V?$vector@M$03@@@@A", scope: !0, file: !33, line: 8, type: !41, isLocal: false, isDefinition: true)
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 128, align: 32, elements: !38)
!42 = !DICompositeType(tag: DW_TAG_class_type, name: "TextureCube<vector<float, 4> >", file: !1, line: 8, size: 128, align: 32, elements: !2, templateParams: !36)
!43 = !DIGlobalVariable(name: "ResourceHeap_Buffer", linkageName: "\01?ResourceHeap_Buffer@@3PAUByteAddressBuffer@@A", scope: !0, file: !33, line: 9, type: !44, isLocal: false, isDefinition: true)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 32, align: 32, elements: !38)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteAddressBuffer", file: !1, line: 9, size: 32, align: 32, elements: !2)
!46 = !DIGlobalVariable(name: "LightSB", linkageName: "\01?LightSB@@3V?$StructuredBuffer@UShaderLight@@@@A", scope: !0, file: !47, line: 29, type: !48, isLocal: false, isDefinition: true)
!47 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc/Globals.hlsli", directory: "")
!48 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<ShaderLight>", file: !1, line: 29, size: 256, align: 32, elements: !2, templateParams: !49)
!49 = !{!50}
!50 = !DITemplateTypeParameter(name: "element", type: !51)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "ShaderLight", file: !26, line: 19, size: 256, align: 32, elements: !52)
!52 = !{!53, !62, !63, !64, !65, !74, !78, !81, !82, !85}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !51, file: !26, line: 21, baseType: !54, size: 96, align: 32)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 29, baseType: !55)
!55 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 29, size: 96, align: 32, elements: !56, templateParams: !60)
!56 = !{!57, !58, !59}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !55, file: !1, line: 29, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !55, file: !1, line: 29, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !55, file: !1, line: 29, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!60 = !{!13, !61}
!61 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "Type8_Flags8_Range16", scope: !51, file: !26, line: 22, baseType: !28, size: 32, align: 32, offset: 96)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "Energy16_X16", scope: !51, file: !26, line: 26, baseType: !28, size: 32, align: 32, offset: 128)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "ColorPacked", scope: !51, file: !26, line: 27, baseType: !28, size: 32, align: 32, offset: 160)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_Padding", scope: !51, file: !26, line: 28, baseType: !66, size: 64, align: 32, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 29, baseType: !67)
!67 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 29, size: 64, align: 32, elements: !68, templateParams: !71)
!68 = !{!69, !70}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !67, file: !1, line: 29, baseType: !29, size: 32, align: 32, flags: DIFlagPublic)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !67, file: !1, line: 29, baseType: !29, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!71 = !{!72, !73}
!72 = !DITemplateTypeParameter(name: "element", type: !29)
!73 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!74 = !DISubprogram(name: "GetColour", linkageName: "\01?GetColour@ShaderLight@@QAA?AV?$vector@M$03@@XZ", scope: !51, file: !26, line: 31, type: !75, isLocal: false, isDefinition: false, scopeLine: 31, flags: DIFlagPrototyped, isOptimized: false)
!75 = !DISubroutineType(types: !76)
!76 = !{!4, !77}
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!78 = !DISubprogram(name: "GetType", linkageName: "\01?GetType@ShaderLight@@QAAIXZ", scope: !51, file: !26, line: 43, type: !79, isLocal: false, isDefinition: false, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: false)
!79 = !DISubroutineType(types: !80)
!80 = !{!28, !77}
!81 = !DISubprogram(name: "GetFlags", linkageName: "\01?GetFlags@ShaderLight@@QAAIXZ", scope: !51, file: !26, line: 48, type: !79, isLocal: false, isDefinition: false, scopeLine: 48, flags: DIFlagPrototyped, isOptimized: false)
!82 = !DISubprogram(name: "GetRange", linkageName: "\01?GetRange@ShaderLight@@QAAMXZ", scope: !51, file: !26, line: 53, type: !83, isLocal: false, isDefinition: false, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: false)
!83 = !DISubroutineType(types: !84)
!84 = !{!8, !77}
!85 = !DISubprogram(name: "GetEnergy", linkageName: "\01?GetEnergy@ShaderLight@@QAAMXZ", scope: !51, file: !26, line: 58, type: !83, isLocal: false, isDefinition: false, scopeLine: 58, flags: DIFlagPrototyped, isOptimized: false)
!86 = !DIGlobalVariable(name: "SamplerDefault", linkageName: "\01?SamplerDefault@@3USamplerState@@A", scope: !0, file: !47, line: 33, type: !87, isLocal: false, isDefinition: true)
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 33, size: 32, align: 32, elements: !2)
!88 = !DIGlobalVariable(name: "SamplerBrdf", linkageName: "\01?SamplerBrdf@@3USamplerState@@A", scope: !0, file: !47, line: 34, type: !87, isLocal: false, isDefinition: true)
!89 = !DIGlobalVariable(name: "ShadowSampler", linkageName: "\01?ShadowSampler@@3USamplerComparisonState@@A", scope: !0, file: !47, line: 35, type: !90, isLocal: false, isDefinition: true)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerComparisonState", file: !1, line: 35, size: 32, align: 32, elements: !2)
!91 = !DIGlobalVariable(name: "Fdielectric", scope: !0, file: !92, line: 7, type: !93, isLocal: true, isDefinition: true)
!92 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc/BRDFFunctions.hlsli", directory: "")
!93 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!94 = !DIGlobalVariable(name: "MaxReflectionLod", scope: !0, file: !92, line: 8, type: !93, isLocal: true, isDefinition: true)
!95 = !{i32 2, !"Dwarf Version", i32 4}
!96 = !{i32 2, !"Debug Info Version", i32 3}
!97 = !{!"dxc 1.2"}
!98 = !{!"D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc\5CMeshRender_BrdfPS.hlsl", !"#define MESHRENDER_COMPILE_PS\0D\0A#define MESHRENDER_LAYOUT_COMMON\0D\0A#define ENABLE_BRDF_LIGHTING\0D\0A#include \22MeshRender.hlsli\22\0D\0A\0D\0A"}
