#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_VertexID              0   x           0   VERTID    uint   x   
; SV_InstanceID            0   x           1   INSTID    uint   x   
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
;
; shader debug name: 406a3c8ec13acec078d678d3de46dcae.pdb
; shader hash: 406a3c8ec13acec078d678d3de46dcae
;
; Pipeline Runtime Information: 
;
; Vertex Shader
; OutputPositionPresent=1
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_VertexID              0                              
; SV_InstanceID            0                              
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
;
; Buffer Definitions:
;
; cbuffer FrameCB
; {
;
;   struct FrameCB
;   {
;
;       struct struct.Frame
;       {
;
;           uint BrdfLUTTexIndex;                     ; Offset:    0
;           uint _padding0;                           ; Offset:    4

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc 1.2", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !116)
!1 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc\5CMeshRender_CommonVS.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17, !30, !59, !73, !77, !90, !113}
!17 = !DISubprogram(name: "main", scope: !18, file: !18, line: 87, type: !19, isLocal: false, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!18 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc/MeshRender.hlsli", directory: "")
!19 = !DISubroutineType(types: !20)
!20 = !{!21, !24}
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "PSInput", file: !18, line: 66, size: 128, align: 32, elements: !22)
!22 = !{!23}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !21, file: !18, line: 75, baseType: !4, size: 128, align: 32)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "VertexInput", file: !18, line: 25, size: 64, align: 32, elements: !25)
!25 = !{!26, !29}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "VertexID", scope: !24, file: !18, line: 27, baseType: !27, size: 32, align: 32)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, baseType: !28)
!28 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "InstanceID", scope: !24, file: !18, line: 28, baseType: !27, size: 32, align: 32, offset: 32)
!30 = !DISubprogram(name: "Populate", linkageName: "\01?Populate@VertexProperties@@QAAXUVertexInput@@@Z", scope: !31, file: !18, line: 41, type: !56, isLocal: false, isDefinition: true, scopeLine: 42, flags: DIFlagPrototyped, isOptimized: false, declaration: !55)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "VertexProperties", file: !18, line: 31, size: 672, align: 32, elements: !32)
!32 = !{!33, !34, !43, !44, !52, !53, !54, !55}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !31, file: !18, line: 33, baseType: !4, size: 128, align: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "PositionWS", scope: !31, file: !18, line: 34, baseType: !35, size: 96, align: 32, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 89, baseType: !36)
!36 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 89, size: 96, align: 32, elements: !37, templateParams: !41)
!37 = !{!38, !39, !40}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !36, file: !1, line: 89, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !36, file: !1, line: 89, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !36, file: !1, line: 89, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!41 = !{!13, !42}
!42 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "NormalWS", scope: !31, file: !18, line: 35, baseType: !35, size: 96, align: 32, offset: 224)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !31, file: !18, line: 36, baseType: !45, size: 64, align: 32, offset: 320)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 89, baseType: !46)
!46 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 89, size: 64, align: 32, elements: !47, templateParams: !50)
!47 = !{!48, !49}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !46, file: !1, line: 89, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !46, file: !1, line: 89, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!50 = !{!13, !51}
!51 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !31, file: !18, line: 37, baseType: !4, size: 128, align: 32, offset: 384)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "TangentWS", scope: !31, file: !18, line: 38, baseType: !4, size: 128, align: 32, offset: 512)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "MaterialID", scope: !31, file: !18, line: 39, baseType: !27, size: 32, align: 32, offset: 640)
!55 = !DISubprogram(name: "Populate", linkageName: "\01?Populate@VertexProperties@@QAAXUVertexInput@@@Z", scope: !31, file: !18, line: 41, type: !56, isLocal: false, isDefinition: false, scopeLine: 41, flags: DIFlagPrototyped, isOptimized: false)
!56 = !DISubroutineType(types: !57)
!57 = !{null, !58, !24}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!59 = !DISubprogram(name: "GetMesh", linkageName: "\01?GetMesh@@YA?AUMesh@@XZ", scope: !18, file: !18, line: 10, type: !60, isLocal: false, isDefinition: true, scopeLine: 11, flags: DIFlagPrototyped, isOptimized: false)
!60 = !DISubroutineType(types: !61)
!61 = !{!62}
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mesh", file: !63, line: 95, size: 256, align: 32, elements: !64)
!63 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc/../Include/Shaders/ShaderInteropStructures.h", directory: "")
!64 = !{!65, !66, !67, !68, !69, !70, !71, !72}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "VbPositionBufferIndex", scope: !62, file: !63, line: 97, baseType: !27, size: 32, align: 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "VbTexCoordBufferIndex", scope: !62, file: !63, line: 98, baseType: !27, size: 32, align: 32, offset: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "VbNormalBufferIndex", scope: !62, file: !63, line: 99, baseType: !27, size: 32, align: 32, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "VbTangentBufferIndex", scope: !62, file: !63, line: 100, baseType: !27, size: 32, align: 32, offset: 96)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !62, file: !63, line: 103, baseType: !27, size: 32, align: 32, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_padding0", scope: !62, file: !63, line: 105, baseType: !27, size: 32, align: 32, offset: 160)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_padding1", scope: !62, file: !63, line: 106, baseType: !27, size: 32, align: 32, offset: 192)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_padding2", scope: !62, file: !63, line: 107, baseType: !27, size: 32, align: 32, offset: 224)
!73 = !DISubprogram(name: "LoadMesh", linkageName: "\01?LoadMesh@@YA?AUMesh@@I@Z", scope: !74, file: !74, line: 51, type: !75, isLocal: false, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: false)
!74 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc/Globals.hlsli", directory: "")
!75 = !DISubroutineType(types: !76)
!76 = !{!62, !27}
!77 = !DISubprogram(name: "GetScene", linkageName: "\01?GetScene@@YA?AUSceneData@@XZ", scope: !74, file: !74, line: 36, type: !78, isLocal: false, isDefinition: true, scopeLine: 37, flags: DIFlagPrototyped, isOptimized: false)
!78 = !DISubroutineType(types: !79)
!79 = !{!80}
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "SceneData", file: !63, line: 54, size: 256, align: 32, elements: !81)
!81 = !{!82, !83, !84, !85, !86, !87, !88, !89}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "MeshBufferIndex", scope: !80, file: !63, line: 56, baseType: !27, size: 32, align: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "GeometryBufferIndex", scope: !80, file: !63, line: 57, baseType: !27, size: 32, align: 32, offset: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "MaterialBufferIndex", scope: !80, file: !63, line: 58, baseType: !27, size: 32, align: 32, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "IrradianceMapTexIndex", scope: !80, file: !63, line: 59, baseType: !27, size: 32, align: 32, offset: 96)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "PreFilteredEnvMapTexIndex", scope: !80, file: !63, line: 63, baseType: !27, size: 32, align: 32, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_padding0", scope: !80, file: !63, line: 64, baseType: !27, size: 32, align: 32, offset: 160)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_padding1", scope: !80, file: !63, line: 65, baseType: !27, size: 32, align: 32, offset: 192)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_padding2", scope: !80, file: !63, line: 66, baseType: !27, size: 32, align: 32, offset: 224)
!90 = !DISubprogram(name: "GetGeometry", linkageName: "\01?GetGeometry@@YA?AUGeometry@@XZ", scope: !18, file: !18, line: 15, type: !91, isLocal: false, isDefinition: true, scopeLine: 16, flags: DIFlagPrototyped, isOptimized: false)
!91 = !DISubroutineType(types: !92)
!92 = !{!93}
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "Geometry", file: !63, line: 112, size: 384, align: 32, elements: !94)
!94 = !{!95, !96, !97, !98, !99, !100, !101, !102, !103, !104}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "MaterialIndex", scope: !93, file: !63, line: 114, baseType: !27, size: 32, align: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "NumIndices", scope: !93, file: !63, line: 115, baseType: !27, size: 32, align: 32, offset: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "NumVertices", scope: !93, file: !63, line: 116, baseType: !27, size: 32, align: 32, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "IndexOffset", scope: !93, file: !63, line: 117, baseType: !27, size: 32, align: 32, offset: 96)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "VertexBufferIndex", scope: !93, file: !63, line: 120, baseType: !27, size: 32, align: 32, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "PositionOffset", scope: !93, file: !63, line: 121, baseType: !27, size: 32, align: 32, offset: 160)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoordOffset", scope: !93, file: !63, line: 122, baseType: !27, size: 32, align: 32, offset: 192)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "NormalOffset", scope: !93, file: !63, line: 123, baseType: !27, size: 32, align: 32, offset: 224)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "TangentOffset", scope: !93, file: !63, line: 126, baseType: !27, size: 32, align: 32, offset: 256)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_padding", scope: !93, file: !63, line: 127, baseType: !105, size: 96, align: 32, offset: 288)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 48, baseType: !106)
!106 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 48, size: 96, align: 32, elements: !107, templateParams: !111)
!107 = !{!108, !109, !110}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !106, file: !1, line: 48, baseType: !28, size: 32, align: 32, flags: DIFlagPublic)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !106, file: !1, line: 48, baseType: !28, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !106, file: !1, line: 48, baseType: !28, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!111 = !{!112, !42}
!112 = !DITemplateTypeParameter(name: "element", type: !28)
!113 = !DISubprogram(name: "LoadGeometry", linkageName: "\01?LoadGeometry@@YA?AUGeometry@@I@Z", scope: !74, file: !74, line: 56, type: !114, isLocal: false, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: false)
!114 = !DISubroutineType(types: !115)
!115 = !{!93, !27}
!116 = !{!117, !119, !120, !121, !129, !132, !135, !137, !138}
!117 = !DIGlobalVariable(name: "ENTITY_TYPE_DIRECTIONALLIGHT", scope: !0, file: !63, line: 12, type: !118, isLocal: true, isDefinition: true)
!118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!119 = !DIGlobalVariable(name: "ENTITY_TYPE_OMNILIGHT", scope: !0, file: !63, line: 13, type: !118, isLocal: true, isDefinition: true)
!120 = !DIGlobalVariable(name: "ENTITY_TYPE_SPOTLIGHT", scope: !0, file: !63, line: 14, type: !118, isLocal: true, isDefinition: true)
!121 = !DIGlobalVariable(name: "ResourceHeap_Texture2D", linkageName: "\01?ResourceHeap_Texture2D@@3PAV?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !122, line: 7, type: !123, isLocal: false, isDefinition: true)
!122 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc/ResourceHeapTables.hlsli", directory: "")
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 160, align: 32, elements: !127)
!124 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 7, size: 160, align: 32, elements: !2, templateParams: !125)
!125 = !{!126}
!126 = !DITemplateTypeParameter(name: "element", type: !5)
!127 = !{!128}
!128 = !DISubrange(count: 1)
!129 = !DIGlobalVariable(name: "ResourceHeap_TextureCube", linkageName: "\01?ResourceHeap_TextureCube@@3PAV?$TextureCube@V?$vector@M$03@@@@A", scope: !0, file: !122, line: 8, type: !130, isLocal: false, isDefinition: true)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 128, align: 32, elements: !127)
!131 = !DICompositeType(tag: DW_TAG_class_type, name: "TextureCube<vector<float, 4> >", file: !1, line: 8, size: 128, align: 32, elements: !2, templateParams: !125)
!132 = !DIGlobalVariable(name: "ResourceHeap_Buffer", linkageName: "\01?ResourceHeap_Buffer@@3PAUByteAddressBuffer@@A", scope: !0, file: !122, line: 9, type: !133, isLocal: false, isDefinition: true, variable: [0 x %struct.ByteAddressBuffer]* @"\01?ResourceHeap_Buffer@@3PAUByteAddressBuffer@@A")
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 32, align: 32, elements: !127)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteAddressBuffer", file: !1, line: 9, size: 32, align: 32, elements: !2)
!135 = !DIGlobalVariable(name: "SamplerDefault", linkageName: "\01?SamplerDefault@@3USamplerState@@A", scope: !0, file: !74, line: 32, type: !136, isLocal: false, isDefinition: true)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 32, size: 32, align: 32, elements: !2)
!137 = !DIGlobalVariable(name: "SamplerBrdf", linkageName: "\01?SamplerBrdf@@3USamplerState@@A", scope: !0, file: !74, line: 33, type: !136, isLocal: false, isDefinition: true)
!138 = !DIGlobalVariable(name: "ShadowSampler", linkageName: "\01?ShadowSampler@@3USamplerComparisonState@@A", scope: !0, file: !74, line: 34, type: !139, isLocal: false, isDefinition: true)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerComparisonState", file: !1, line: 34, size: 32, align: 32, elements: !2)
!140 = !{i32 2, !"Dwarf Version", i32 4}
!141 = !{i32 2, !"Debug Info Version", i32 3}
!142 = !{!"dxc 1.2"}
!143 = !{!"D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc\5CMeshRender_CommonVS.hlsl", !"#define MESHRENDER_COMPILE_VS\0D\0A// #define MESHRENDER_LAYOUT_COMMON\0D\0A\0D\0A#include \22MeshRender.hlsli\22\0D\0A\0D\0A"}
!144 = !{!"D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc/../Include/Shaders/ShaderInterop.h", !"#ifndef __PHX_SHADER_INTEROP_HLSLI__\0D\0A#define __PHX_SHADER_INTEROP_HLSLI__\0D\0A\0D\0A\0D\0A#ifdef __cplusplus\0D\0A\0D\0A#include <DirectXMath.h>\0D\0A\0D\0Ausing float4x4 = DirectX::XMFLOAT4X4;\0D\0Ausing float2 = DirectX::XMFLOAT2;\0D\0Ausing float3 = DirectX::XMFLOAT3;\0D\0Ausing float4 = DirectX::XMFLOAT4;\0D\0A\0D\0Ausing uint = uint32_t;\0D\0Ausing uint2 = DirectX::XMUINT2;\0D\0Ausing uint3 = DirectX::XMUINT3;\0D\0Ausing uint4 = DirectX::XMUINT4;\0D\0A\0D\0Ausing int2 = DirectX::XMINT2;\0D\0Ausing int3 = DirectX::XMINT3;\0D\0Ausing int4 = DirectX::XMINT4;\0D\0A\0D\0A#define CONSTANT_BUFFER(name, type, slot)\0D\0A#define PUSH_CONSTANT(name, type)\0D\0A\0D\0A#else\0D\0A\0D\0A#define CONSTANT_BUFFER(name, type) ConstantBuffer<type> name : register(b999)\0D\0A#define PUSH_CONSTANT(name, type) ConstantBuffer<type> name : register(b999)\0D\0A\0D\0A#endif\0D\0A\0D\0A#define RESOURCE_HEAP_BUFFER_SPACE     space100\0D\0A#define RESOURCE_HEAP_TEX2D_SPACE      space101\0D\0A#define RESOURCE_HEAP_TEX_CUBE_SPACE   space102\0D\0A\0D\0A#endif // __PHX_SHADER_INTEROP_HLSLI__"}
!145 = !{!"D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc/../Include/Shaders/ShaderInteropStructures.h", !"#ifndef __PHX_SHADER_INTEROP_STRUCTURES_HLSLI__\0D\0A#define __PHX_SHADER_INTEROP_STRUCTURES_HLSLI__\0D\0A\0D\0A#include \22ShaderInterop.h\22\0D\0A\0D\0A#ifdef __cplusplus\0D\0Anamespace Shader\0D\0A{\0D\0A#endif\0D\0A\0D\0A// -- Enums ---\0D\0Astatic const uint ENTITY_TYPE_DIRECTIONALLIGHT = 0;\0D\0Astatic const uint ENTITY_TYPE_OMNILIGHT = 1;\0D\0Astatic const uint ENTITY_TYPE_SPOTLIGHT = 2;\0D\0A\0D\0Astruct ShaderTransform\0D\0A{\0D\0A\09float4 Mat0;\0D\0A\09float4 Mat1;\0D\0A\09float4 Mat2;\0D\0A\0D\0A\09void init()\0D\0A\09{\0D\0A\09\09Mat0 = float4(1, 0, 0, 0);\0D\0A\09\09Mat1 = float4(0, 1, 0, 0);\0D\0A\09\09Mat2 = float4(0, 0, 1, 0);\0D\0A\09}\0D\0A\09void Create(float4x4 mat)\0D\0A\09{\0D\0A\09\09Mat0 = float4(mat._11, mat._21, mat._31, mat._41);\0D\0A\09\09Mat1 = float4(mat._12, mat._22, mat._32, mat._42);\0D\0A\09\09Mat2 = float4(mat._13, mat._23, mat._33, mat._43);\0D\0A\09}\0D\0A\09float4x4 GetMatrix()\0D\0A#ifdef __cplusplus\0D\0A\09\09const\0D\0A#endif // __cplusplus\0D\0A\09{\0D\0A\09\09return float4x4(\0D\0A\09\09\09Mat0.x, Mat0.y, Mat0.z, Mat0.w,\0D\0A\09\09\09Mat1.x, Mat1.y, Mat1.z, Mat1.w,\0D\0A\09\09\09Mat2.x, Mat2.y, Mat2.z, Mat2.w,\0D\0A\09\09\090, 0, 0, 1\0D\0A\09\09);\0D\0A\09}\0D\0A};\0D\0A\0D\0Astruct ImguiDrawInfo\0D\0A{\0D\0A\09float4x4 Mvp;\0D\0A\09uint TextureIndex;\0D\0A};\0D\0A\0D\0Astruct SceneData\0D\0A{\0D\0A\09uint MeshBufferIndex;\0D\0A\09uint GeometryBufferIndex;\0D\0A\09uint MaterialBufferIndex;\0D\0A\09uint IrradianceMapTexIndex;\0D\0A\0D\0A\09// -- 16 byte boundary ----\0D\0A\0D\0A\09uint PreFilteredEnvMapTexIndex;\0D\0A\09uint _padding0;\0D\0A\09uint _padding1;\0D\0A\09uint _padding2;\0D\0A\0D\0A\09// -- 16 byte boundary ----\0D\0A};\0D\0A\0D\0Astruct MaterialData\0D\0A{\0D\0A\09float3 AlbedoColour;\0D\0A\09uint AlbedoTexture;\0D\0A\0D\0A\09// -- 16 byte boundary ----\0D\0A\0D\0A\09uint MaterialTexture;\0D\0A\09uint RoughnessTexture;\0D\0A\09uint MetalnessTexture;\0D\0A\09uint AOTexture;\0D\0A\0D\0A\09// -- 16 byte boundary ----\0D\0A\0D\0A\09uint NormalTexture;\0D\0A\09float Metalness;\0D\0A\09float Roughness;\0D\0A\09float AO;\0D\0A\0D\0A\09// -- 16 byte boundary ----\0D\0A\0D\0A\09uint Flags;\0D\0A};\0D\0A\0D\0Astruct Mesh\0D\0A{\0D\0A\09uint VbPositionBufferIndex;\0D\0A\09uint VbTexCoordBufferIndex;\0D\0A\09uint VbNormalBufferIndex;\0D\0A\09uint VbTangentBufferIndex;\0D\0A\0D\0A\09// -- 16 byte boundary ----\0D\0A\09uint Flags;\0D\0A\0D\0A\09uint _padding0;\0D\0A\09uint _padding1;\0D\0A\09uint _padding2;\0D\0A\0D\0A\09// -- 16 byte boundary ----\0D\0A};\0D\0A\0D\0Astruct Geometry\0D\0A{\0D\0A\09uint MaterialIndex;\0D\0A\09uint NumIndices;\0D\0A\09uint NumVertices;\0D\0A\09uint IndexOffset;\0D\0A\0D\0A\09// -- 16 byte boundary ---\0D\0A\09uint VertexBufferIndex;\0D\0A\09uint PositionOffset;\0D\0A\09uint TexCoordOffset;\0D\0A\09uint NormalOffset;\0D\0A\0D\0A\09// -- 16 byte boundary ---\0D\0A\09uint TangentOffset;\0D\0A\09uint3 _padding;\0D\0A\0D\0A\09// -- 16 byte boundary ---\0D\0A};\0D\0A\0D\0Astruct Frame\0D\0A{\0D\0A\09uint BrdfLUTTexIndex;\0D\0A\09uint _padding0;\0D\0A\09uint _padding1;\0D\0A\09uint _padding2;\0D\0A\0D\0A\09// -- 16 byte boundary ----\0D\0A\09\0D\0A\09SceneData Scene;\0D\0A};\0D\0A\0D\0Astruct Camera\0D\0A{\0D\0A\09float4x4 ViewProjection;\0D\0A\0D\0A\09// -- 16 byte boundary ----\0D\0A\0D\0A\09float4x4 ShadowViewProjection;\0D\0A\0D\0A\09// -- 16 byte boundary ----\0D\0A\0D\0A\09float3 CameraPosition;\0D\0A};\0D\0A\0D\0A\0D\0Astruct GeometryPassPushConstants\0D\0A{\0D\0A\09float4x4 WorldTransform;\0D\0A\0D\0A\09uint GeometryIndex;\0D\0A\09uint MeshIndex;\0D\0A};\0D\0A\0D\0A#ifdef __cplusplus\0D\0A}\0D\0A#endif\0D\0A#endif // __PHX_SHADER_INTEROP_STRUCTURES_HLSLI__"}
!146 = !{!"D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc/BRDFFunctions.hlsli", !"\0D\0A#include \22Defines.hlsli\22\0D\0A\0D\0A#ifndef __BRDF_FUNCTIONS__HLSLI__\0D\0A#define __BRDF_FUNCTIONS__HLSLI__\0D\0A\0D\0A// -- Normal Distribution functions ---\0D\0A// approximates the amount the surface's microfacets are aligned to the halfway vector,\0D\0A// influenced by the roughness of the surface; this is the primary function approximating the microfacets.\0D\0A\0D\0A/* Summary:\0D\0A *    Trowbridge-Reitz GGX normal distribution function.\0D\0A *  N -> The surface Normal\0D\0A *  \0D\0A*/\0D\0Afloat DistributionGGX(float3 N, float3 H, float roughness)\0D\0A{\0D\0A    float a = roughness * roughness;\0D\0A    float a2 = a * a;\0D\0A    float NdotH = saturate(dot(N, H));\0D\0A    float NdotH2 = NdotH * NdotH;\0D\0A    \0D\0A    float nominator = a2;\0D\0A    float denominator = (NdotH2 * (a2 - 1.0) + 1.0);\0D\0A    denominator = PI * denominator * denominator;\0D\0A    \0D\0A    return nominator / denominator;\0D\0A}\0D\0A\0D\0A// -- Geometry functions ---\0D\0A// describes the self-shadowing property of the microfacets. When a surface is relatively rough, \0D\0A// the surface's microfacets can overshadow other microfacets reducing the light the surface reflects.\0D\0A\0D\0Afloat GeometrySchlickGGX(float NdotV, float roughness)\0D\0A{\0D\0A    // Direct Lighting's K value is ( r + 1 )^2 / 8;\0D\0A    float r = (roughness + 1.0);\0D\0A    float k = (r * r) / 8.0;\0D\0A    \0D\0A    float nominator = NdotV;\0D\0A    float denominator = NdotV * (1.0f - k) + k;\0D\0A    \0D\0A    return nominator / denominator;\0D\0A}\0D\0A\0D\0Afloat GeometrySmith(float3 N, float3 V, float3 L, float roughness)\0D\0A{\0D\0A    float NdotV = saturate(dot(N, V));\0D\0A    float NdotL = saturate(dot(N, L));\0D\0A    \0D\0A    float ggx1 = GeometrySchlickGGX(NdotV, roughness);\0D\0A    float ggx2 = GeometrySchlickGGX(NdotL, roughness);\0D\0A    \0D\0A    return ggx1 * ggx2;\0D\0A}\0D\0A\0D\0A// -- Fresnel Equation---\0D\0A// The Fresnel equation describes the ratio of surface reflection at different surface angles.\0D\0A\0D\0A// F0 is precomputed base reflectivity of the surface.\0D\0A// CosTheta is the dot product of N(surface Normal) and the h(Halfway Vector)\0D\0Afloat3 FresnelSchlick(float cosTheta, float3 F0)\0D\0A{\0D\0A    return F0 + (1.0f - F0) * pow(clamp(1.0f - cosTheta, 0.0f, 1.0f), 5.0);\0D\0A}\0D\0A\0D\0Afloat3 FresnelSchlick(float cosTheta, float3 F0, float roughness)\0D\0A{\0D\0A    return F0 + (max((1.0f - roughness).xxx, F0) - F0) * pow(clamp(1.0f - cosTheta, 0.0f, 1.0f), 5.0f);\0D\0A}\0D\0A\0D\0A#endif"}
!147 = !{!"D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc/Defines.hlsli", !"#ifndef __DEFINES_HLSLI__\0D\0A#define __DEFINES_HLSLI__\0D\0A\0D\0A#define BufferSpace     space100\0D\0A#define Tex2DSpace      space101\0D\0A#define TexCubeSpace    space102\0D\0A\0D\0A#define InvalidDescriptorIndex ~0U\0D\0A\0D\0A\0D\0A#define PI 3.14159265f\0D\0A#endif"}
!148 = !{!"D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc/Globals.hlsli", !"#ifndef __PHX_GLOBALS_HLSLI__\0D\0A#define __PHX_GLOBALS_HLSLI__\0D\0A\0D\0A\0D\0A#include \22../Include/Shaders/ShaderInterop.h\22\0D\0A#include \22../Include/Shaders/ShaderInteropStructures.h\22\0D\0A#include \22Defines.hlsli\22\0D\0A#include \22ResourceHeapTables.hlsli\22\0D\0A\0D\0A#define PHX_ENGINE_DEFAULT_ROOTSIGNATURE \5C\0D\0A\09\22RootFlags(ALLOW_INPUT_ASSEMBLER_INPUT_LAYOUT), \22 \5C\0D\0A\09\22RootConstants(num32BitConstants=12, b999), \22 \5C\0D\0A\09\22CBV(b0), \22 \5C\0D\0A\09\22CBV(b1), \22 \5C\0D\0A\09\22DescriptorTable( \22 \5C\0D\0A\09\09\22SRV(t0, space = 100, offset = 0, numDescriptors = unbounded, flags = DESCRIPTORS_VOLATILE | DATA_VOLATILE),\22 \5C\0D\0A\09\09\22SRV(t0, space = 101, offset = 0, numDescriptors = unbounded, flags = DESCRIPTORS_VOLATILE | DATA_VOLATILE),\22 \5C\0D\0A\09\09\22SRV(t0, space = 102, offset = 0, numDescriptors = unbounded, flags = DESCRIPTORS_VOLATILE | DATA_VOLATILE),\22 \5C\0D\0A\09\22), \22 \5C\0D\0A\09\22StaticSampler(s50, addressU = TEXTURE_ADDRESS_WRAP, addressV = TEXTURE_ADDRESS_WRAP, addressW = TEXTURE_ADDRESS_WRAP, filter = FILTER_MIN_MAG_MIP_LINEAR),\22 \5C\0D\0A\09\22StaticSampler(s51, addressU = TEXTURE_ADDRESS_CLAMP, addressV = TEXTURE_ADDRESS_CLAMP, addressW = TEXTURE_ADDRESS_CLAMP, filter = FILTER_MIN_MAG_MIP_LINEAR),\22 \5C\0D\0A\09\22StaticSampler(s52, addressU = TEXTURE_ADDRESS_CLAMP, addressV = TEXTURE_ADDRESS_CLAMP, addressW = TEXTURE_ADDRESS_CLAMP, filter = FILTER_COMPARISON_MIN_MAG_LINEAR_MIP_POINT, comparisonFunc = COMPARISON_LESS_EQUAL),\22\0D\0A\0D\0A\0D\0A\0D\0A\0D\0AConstantBuffer<Frame> FrameCB : register(b0);\0D\0AConstantBuffer<Camera> CameraCB : register(b1);\0D\0A\0D\0A// StructuredBuffer<matrix> InstanceTransformsSB : register(t0);\0D\0A\0D\0ASamplerState SamplerDefault : register(s50);\0D\0ASamplerState SamplerBrdf : register(s51);\0D\0ASamplerComparisonState ShadowSampler : register(s52);\0D\0A\0D\0Ainline SceneData GetScene()\0D\0A{\0D\0A    return FrameCB.Scene;\0D\0A}\0D\0A\0D\0Ainline Frame GetFrame()\0D\0A{\0D\0A\09return FrameCB;\0D\0A}\0D\0A\0D\0Ainline Camera GetCamera()\0D\0A{\0D\0A    return CameraCB;\0D\0A}\0D\0A\0D\0Ainline Mesh LoadMesh(uint meshIndex)\0D\0A{\0D\0A    return ResourceHeap_Buffer[GetScene().MeshBufferIndex].Load<Mesh>(meshIndex * sizeof(Mesh));\0D\0A}\0D\0A\0D\0Ainline Geometry LoadGeometry(uint geoIndex)\0D\0A{\0D\0A    return ResourceHeap_Buffer[GetScene().GeometryBufferIndex].Load<Geometry>(geoIndex * sizeof(Geometry));\0D\0A}\0D\0A\0D\0Ainline MaterialData LoadMaterial(uint mtlIndex)\0D\0A{\0D\0A    return ResourceHeap_Buffer[GetScene().MaterialBufferIndex].Load<MaterialData> (mtlIndex * sizeof(MaterialData));\0D\0A}\0D\0A#endif // __PHX_GLOBALS_HLSLI__"}
!149 = !{!"D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc/MeshRender.hlsli", !"#ifndef __PHX_MESH_RENDER_HLSLI__\0D\0A#define __PHX_MESH_RENDER_HLSLI__\0D\0A\0D\0A#include \22Globals.hlsli\22\0D\0A#include \22BRDFFunctions.hlsli\22\0D\0A\0D\0A\0D\0APUSH_CONSTANT(push, GeometryPassPushConstants);\0D\0A\0D\0Ainline Mesh GetMesh()\0D\0A{\0D\0A    return LoadMesh(push.MeshIndex);\0D\0A}\0D\0A\0D\0Ainline Geometry GetGeometry()\0D\0A{\0D\0A    return LoadGeometry(push.GeometryIndex);\0D\0A}\0D\0A\0D\0Ainline MaterialData GetMaterial(uint materialID)\0D\0A{\0D\0A    return LoadMaterial(materialID);\0D\0A}\0D\0A\0D\0Astruct VertexInput\0D\0A{\0D\0A    uint VertexID : SV_VertexID;\0D\0A    uint InstanceID : SV_InstanceID;\0D\0A};\0D\0A\0D\0Astruct VertexProperties\0D\0A{\0D\0A    float4 Position;\0D\0A    float3 PositionWS;\0D\0A    float3 NormalWS;\0D\0A    float2 TexCoord;\0D\0A    float4 Colour;\0D\0A    float4 TangentWS;\0D\0A    uint MaterialID;\0D\0A    \0D\0A    inline void Populate(in VertexInput input)\0D\0A    {\0D\0A        // matrix mvpMatrix = LoadInstanceMvpMatrix(push.InstanceOffset + input.InstanceID);\0D\0A        matrix worldMatrix = push.WorldTransform;\0D\0A        //matrix mvpMatrix = worldMatrix * GetCamera().ViewProjection;\0D\0A        \0D\0A        Mesh mesh = GetMesh();\0D\0A        Geometry geometry = GetGeometry();\0D\0A        \0D\0A        // uint vertexID = input.VertexID + geometry.VertexOffset;\0D\0A        \0D\0A        // -- TODO: I am here ---\0D\0A        // float4 position = float4(ResourceHeap_Buffer[mesh.VbPositionBufferIndex].Load<float3>(vertexID * 12), 1.0f);\0D\0A        // PositionWS = mul(position, mvpMatrix).xyz;\0D\0A        // Position = mul(float4(PositionWS, 1.0f), GetCamera().ViewProjection);\0D\0A        // NormalWS = mesh.VbNormalBufferIndex == ~0u ? 0 : ResourceHeap_Buffer[mesh.VbNormalBufferIndex].Load<float3>(vertexID * 12);\0D\0A        // TexCoord = mesh.VbTexCoordBufferIndex == ~0u ? 0 : ResourceHeap_Buffer[mesh.VbTexCoordBufferIndex].Load<float2>(vertexID * 8);\0D\0A        // Colour = float4(0.0f, 0.0f, 0.0f, 1.0f);\0D\0A        // float4 tangent = mesh.VbTangentBufferIndex == ~0u ? 0 : ResourceHeap_Buffer[mesh.VbTangentBufferIndex].Load<float4>(vertexID * 16);\0D\0A        // TangentWS = float4(mul(tangent.xyz, (float3x3) mvpMatrix), tangent.w);\0D\0A        // MaterialID = geometry.MaterialIndex;\0D\0A    }\0D\0A};\0D\0A\0D\0A    \0D\0Astruct PSInput\0D\0A{\0D\0A    // float3 NormalWS : NORMAL;\0D\0A    // float4 Colour : COLOUR;\0D\0A    // float2 TexCoord : TEXCOORD;\0D\0A    // // float3 ShadowTexCoord : TEXCOORD1;\0D\0A    // float3 PositionWS : Position;\0D\0A    // float4 TangentWS : TANGENT;\0D\0A    // uint MaterialID : MATERIAL;\0D\0A    float4 Position : SV_POSITION;\0D\0A};\0D\0A\0D\0A#ifdef MESHRENDER_LAYOUT_COMMON\0D\0A#define USE_NORMAL\0D\0A#define USE_TEX_COORD\0D\0A#define USE_COLOUR\0D\0A#define USE_TANGENT\0D\0A#define USE_MATERIAL\0D\0A#endif\0D\0A\0D\0A#ifdef MESHRENDER_COMPILE_VS\0D\0APSInput main(in VertexInput input)\0D\0A{\0D\0A    VertexProperties vertexProperties;\0D\0A    vertexProperties.Populate(input);\0D\0A    \0D\0A    PSInput output;\0D\0A    // output.PositionWS = vertexProperties.PositionWS;\0D\0A    // output.Position = vertexProperties.Position;\0D\0A    output.Position = float4(0.0f, 0.0f, 0.0f, 0.0f);\0D\0A    \0D\0A#ifdef USE_NORMAL\0D\0A    output.NormalWS = vertexProperties.NormalWS;\0D\0A#endif\0D\0A\0D\0A#ifdef USE_TEX_COORD\0D\0A    output.TexCoord = vertexProperties.TexCoord;\0D\0A#endif\0D\0A\0D\0A#ifdef USE_COLOUR\0D\0A    output.Colour = vertexProperties.Colour;\0D\0A#endif\0D\0A    \0D\0A#ifdef USE_TANGENT\0D\0A    output.TangentWS = vertexProperties.TangentWS;\0D\0A#endif \0D\0A\0D\0A#ifdef USE_MATERIAL\0D\0A    output.MaterialID = vertexProperties.MaterialID;\0D\0A#endif\0D\0A    \0D\0A    return output;\0D\0A}\0D\0A\0D\0A#endif\0D\0A\0D\0A\0D\0A\0D\0Afloat GetShadow(float3 shadowMapCoord)\0D\0A{\0D\0A    // float result = ShadowMap.SampleCmpLevelZero(ShadowSampler, shadowMapCoord.xy, shadowMapCoord.z);\0D\0A    float result = 1.0f;\0D\0A    return result * result;\0D\0A}\0D\0A\0D\0A\0D\0A#ifdef MESHRENDER_COMPILE_PS\0D\0A    \0D\0A// Constant normal incidence Fresnel factor for all dielectrics.\0D\0Astatic const float Fdielectric = 0.04f;\0D\0Astatic const float MaxReflectionLod = 7.0f;\0D\0A\0D\0A\0D\0Afloat4 main(PSInput input) : SV_Target\0D\0A{\0D\0A    return float4(0.0f, 0.0f, 0.0f, 0.0f);\0D\0A/*\0D\0A    MaterialData material = LoadMaterial(input.MaterialID);\0D\0A    \0D\0A    // -- Collect Material Data ---\0D\0A    float3 albedo = material.AlbedoColour;\0D\0A    if (material.AlbedoTexture != InvalidDescriptorIndex)\0D\0A    {\0D\0A        albedo = ResourceHeap_Texture2D[material.AlbedoTexture].Sample(SamplerDefault, input.TexCoord).xyz;\0D\0A    }\0D\0A    \0D\0A    float metallic = material.Metalness;\0D\0A    if (material.MetalnessTexture != InvalidDescriptorIndex)\0D\0A    {\0D\0A        metallic = ResourceHeap_Texture2D[material.MetalnessTexture].Sample(SamplerDefault, input.TexCoord).r;\0D\0A    }\0D\0A    \0D\0A    float roughness = material.Roughness;\0D\0A    if (material.RoughnessTexture != InvalidDescriptorIndex)\0D\0A    {\0D\0A        roughness = ResourceHeap_Texture2D[material.RoughnessTexture].Sample(SamplerDefault, input.TexCoord).r;\0D\0A    }\0D\0A        \0D\0A    float ao = material.AO;\0D\0A    if (material.AOTexture != InvalidDescriptorIndex)\0D\0A    {\0D\0A        ao = ResourceHeap_Texture2D[material.AOTexture].Sample(SamplerDefault, input.TexCoord).r;\0D\0A    }\0D\0A    \0D\0A    float3 tangent = normalize(input.TangentWS.xyz);\0D\0A    float3 normal = normalize(input.NormalWS);\0D\0A    float3 biTangent = cross(normal, tangent.xyz) * input.TangentWS.w;\0D\0A    if (material.NormalTexture != InvalidDescriptorIndex)\0D\0A    {\0D\0A        float3x3 tbn = float3x3(tangent, biTangent, normal);\0D\0A        normal = ResourceHeap_Texture2D[material.NormalTexture].Sample(SamplerDefault, input.TexCoord).rgb * 2.0 - 1.0;;\0D\0A        normal = normalize(mul(normal, tbn));\0D\0A    }\0D\0A    \0D\0A    // -- End Material Collection ---\0D\0A    \0D\0A    // -- Lighting Model ---\0D\0A    float3 N = normalize(normal);\0D\0A    float3 V = normalize((float3)GetCamera().CameraPosition - input.PositionWS);\0D\0A    float3 R = reflect(-V, N);\0D\0A    \0D\0A    // Linear Interpolate the value against the abledo as matallic\0D\0A    // surfaces reflect their colour.\0D\0A    float3 F0 = lerp(Fdielectric, albedo, metallic);\0D\0A    \0D\0A    // Reflectance equation\0D\0A    float3 Lo = float3(0.0f, 0.0f, 0.0f);\0D\0A    {\0D\0A        // -- Iterate over lights here\0D\0A        // If this is a point light, calculate vector from light to World Pos\0D\0A        float3 L = -normalize(float3(0.0f, -1.0f, 0.0f));\0D\0A        float3 H = normalize(V + L);\0D\0A    \0D\0A        // If point light, calculate attenuation here;\0D\0A        float3 radiance = float3(1.0f, 1.0f, 1.0f); // * attenuation;\0D\0A    \0D\0A        // Calculate Normal Distribution Term\0D\0A        float NDF = DistributionGGX(N, H, roughness);\0D\0A    \0D\0A        // Calculate Geometry Term\0D\0A        float G = GeometrySmith(N, V, L, roughness);\0D\0A    \0D\0A        // Calculate Fersnel Term\0D\0A        float3 F = FresnelSchlick(saturate(dot(H, V)), F0);\0D\0A    \0D\0A        // Now calculate Cook-Torrance BRDF\0D\0A        float3 numerator = NDF * G * F;\0D\0A    \0D\0A        // NOTE: we add 0.0001 to the denomiator to prevent a divide by zero in the case any dot product ends up zero\0D\0A        float denominator = 4.0 * saturate(dot(N, V)) * saturate(dot(N, L)) + 0.0001;\0D\0A\0D\0A        float3 specular = numerator / denominator;\0D\0A    \0D\0A        // Now we can calculate the light's constribution to the reflectance equation. Since Fersnel Value directly corresponds to\0D\0A        // Ks, we ca use F to denote the specular contribution of any light that hits the surface.\0D\0A        // we can now deduce what the diffuse contribution is as 1.0 = KSpecular + kDiffuse;\0D\0A        float3 kSpecular = F;\0D\0A        float3 KDiffuse = float3(1.0, 1.0, 1.0) - kSpecular;\0D\0A        KDiffuse *= 1.0f - metallic;\0D\0A    \0D\0A        float NdotL = saturate(dot(N, L));\0D\0A        Lo += (KDiffuse * (albedo / PI) + specular) * radiance * NdotL;\0D\0A    }\0D\0A    // -- End light iteration\0D\0A    \0D\0A    \0D\0A    // Improvised abmient lighting by using the Env Irradance map.\0D\0A    float3 ambient = float(0.03).xxx * albedo * ao;\0D\0A    if (GetScene().IrradianceMapTexIndex != InvalidDescriptorIndex &&\0D\0A        GetScene().PreFilteredEnvMapTexIndex != InvalidDescriptorIndex &&\0D\0A        FrameCB.BrdfLUTTexIndex != InvalidDescriptorIndex)\0D\0A    {\0D\0A        \0D\0A        float3 F = FresnelSchlick(saturate(dot(N, V)), F0, roughness);\0D\0A        // Improvised abmient lighting by using the Env Irradance map.\0D\0A        float3 irradiance = ResourceHeap_TextureCube[GetScene().IrradianceMapTexIndex].Sample(SamplerDefault, N).rgb;\0D\0A        \0D\0A        float3 kSpecular = F;\0D\0A        float3 kDiffuse = 1.0 - kSpecular;\0D\0A        float3 diffuse = irradiance * albedo;\0D\0A        \0D\0A        // Sample both the BRDFLut and Pre-filtered map and combine them together as per the\0D\0A        // split-sum approximation to get the IBL Specular part.\0D\0A        float lodLevel = roughness * MaxReflectionLod;\0D\0A        float3 prefilteredColour =\0D\0A            ResourceHeap_TextureCube[GetScene().PreFilteredEnvMapTexIndex].SampleLevel(SamplerDefault, R, lodLevel).rgb;\0D\0A        \0D\0A        float2 brdfTexCoord = float2(saturate(dot(N, V)), roughness);\0D\0A        \0D\0A        float2 brdf = ResourceHeap_Texture2D[FrameCB.BrdfLUTTexIndex].Sample(SamplerBrdf, brdfTexCoord).rg;\0D\0A        \0D\0A        float3 specular = prefilteredColour * (F * brdf.x + brdf.y);\0D\0A        \0D\0A        ambient = (kDiffuse * diffuse + specular) * ao;\0D\0A    }\0D\0A        \0D\0A    float3 colour = ambient + Lo;\0D\0A    \0D\0A    float4 shadowMapCoord = mul(float4(input.PositionWS, 1.0f), GetCamera().ShadowViewProjection);\0D\0A    // Convert to Texture space\0D\0A    shadowMapCoord.xyz /= shadowMapCoord.w;\0D\0A    \0D\0A    // Apply Bias\0D\0A    shadowMapCoord.xy = shadowMapCoord.xy * float2(0.5, -0.5) + 0.5;\0D\0A    \0D\0A    // Transform NDC space [-1,+1]^2 to texture space [0,1]^2\0D\0A    // XMMATRIX T(0.5f, 0.0f, 0.0f, 0.0f,\0D\0A    //            0.0f, -0.5f, 0.0f, 0.0f,\0D\0A    //            0.0f, 0.0f, 1.0f, 0.0f,\0D\0A    //            0.5f, 0.5f, 0.0f, 1.0f);\0D\0A    \0D\0A    // colour = GetShadow(shadowMapCoord.xyz) * colour;\0D\0A    // colour = GetShadow(input.ShadowTexCoord) * colour;\0D\0A    \0D\0A    // Correction for gamma?\0D\0A    colour = colour / (colour + float3(1.0, 1.0, 1.0));\0D\0A    colour = pow(colour, float3(1.0 / 2.2, 1.0 / 2.2, 1.0 / 2.2));\0D\0A    \0D\0A    return float4(colour, 1.0f);\0D\0A*/\0D\0A}\0D\0A#endif\0D\0A#endif"}
!150 = !{!"D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc/ResourceHeapTables.hlsli", !"#ifndef __PHX_RESOURCE_HEAP_TABLES_HLSLI__\0D\0A#define __PHX_RESOURCE_HEAP_TABLES_HLSLI__\0D\0A\0D\0A\0D\0A#include \22../Include/Shaders/ShaderInterop.h\22\0D\0A\0D\0ATexture2D ResourceHeap_Texture2D[] : register(t0, RESOURCE_HEAP_TEX2D_SPACE);\0D\0ATextureCube ResourceHeap_TextureCube[] : register(t0, RESOURCE_HEAP_TEX_CUBE_SPACE);\0D\0AByteAddressBuffer ResourceHeap_Buffer[] : register(t0, RESOURCE_HEAP_BUFFER_SPACE);\0D\0A\0D\0A#endif"}
!151 = !{!"D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc\5CMeshRender_CommonVS.hlsl"}
!152 = !{!"/E", !"main", !"/T", !"vs_6_5", !"/Fo", !"D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5Cbuild\5Cx64\5CDebug\5CMeshRender_CommonVS.cso", !"/Zi", !"/Od", !"/Qembed_debug"}
!153 = !{i32 1, i32 5}
!154 = !{!"vs", i32 6, i32 5}
!155 = !{!156, null, !158, null}
!156 = !{!157}
!157 = !{i32 0, [0 x %struct.ByteAddressBuffer]* undef, !"ResourceHeap_Buffer", i32 100, i32 0, i32 -1, i32 11, i32 0, null}
!158 = !{!159, !160}
!159 = !{i32 0, %FrameCB* undef, !"FrameCB", i32 0, i32 0, i32 1, i32 48, null}
!160 = !{i32 1, %dx.alignment.legacy.push* undef, !"push", i32 0, i32 999, i32 1, i32 72, null}
!161 = !{i32 0, %"class.Texture2D<vector<float, 4> >" undef, !162, %"class.Texture2D<vector<float, 4> >::mips_type" undef, !168, %"class.TextureCube<vector<float, 4> >" undef, !170, %struct.ByteAddressBuffer undef, !171, %struct.Frame undef, !173, %struct.SceneData undef, !179, %struct.Camera undef, !188, %struct.GeometryPassPushConstants undef, !193, %struct.PSInput undef, !197, %struct.VertexInput undef, !199, %struct.VertexProperties undef, !202, %struct.Mesh undef, !210, %struct.Geometry undef, !216, %FrameCB undef, !227, %push undef, !229, %dx.alignment.legacy.struct.GeometryPassPushConstants undef, !193, %dx.alignment.legacy.push undef, !229}
!162 = !{i32 20, !163, !164, !165}
!163 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 9}
!164 = !{i32 6, !"mips", i32 3, i32 16}
!165 = !{i32 0, !166}
!166 = !{!167}
!167 = !{i32 0, <4 x float> undef}
!168 = !{i32 4, !169}
!169 = !{i32 6, !"handle", i32 3, i32 0, i32 7, i32 5}
!170 = !{i32 16, !163, !165}
!171 = !{i32 4, !172}
!172 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 4}
!173 = !{i32 48, !174, !175, !176, !177, !178}
!174 = !{i32 6, !"BrdfLUTTexIndex", i32 3, i32 0, i32 7, i32 5}
!175 = !{i32 6, !"_padding0", i32 3, i32 4, i32 7, i32 5}
!176 = !{i32 6, !"_padding1", i32 3, i32 8, i32 7, i32 5}
!177 = !{i32 6, !"_padding2", i32 3, i32 12, i32 7, i32 5}
!178 = !{i32 6, !"Scene", i32 3, i32 16}
!179 = !{i32 32, !180, !181, !182, !183, !184, !185, !186, !187}
!180 = !{i32 6, !"MeshBufferIndex", i32 3, i32 0, i32 7, i32 5}
!181 = !{i32 6, !"GeometryBufferIndex", i32 3, i32 4, i32 7, i32 5}
!182 = !{i32 6, !"MaterialBufferIndex", i32 3, i32 8, i32 7, i32 5}
!183 = !{i32 6, !"IrradianceMapTexIndex", i32 3, i32 12, i32 7, i32 5}
!184 = !{i32 6, !"PreFilteredEnvMapTexIndex", i32 3, i32 16, i32 7, i32 5}
!185 = !{i32 6, !"_padding0", i32 3, i32 20, i32 7, i32 5}
!186 = !{i32 6, !"_padding1", i32 3, i32 24, i32 7, i32 5}
!187 = !{i32 6, !"_padding2", i32 3, i32 28, i32 7, i32 5}
!188 = !{i32 140, !189, !191, !192}
!189 = !{i32 6, !"ViewProjection", i32 2, !190, i32 3, i32 0, i32 7, i32 9}
!190 = !{i32 4, i32 4, i32 2}
!191 = !{i32 6, !"ShadowViewProjection", i32 2, !190, i32 3, i32 64, i32 7, i32 9}
!192 = !{i32 6, !"CameraPosition", i32 3, i32 128, i32 7, i32 9}
!193 = !{i32 72, !194, !195, !196}
!194 = !{i32 6, !"WorldTransform", i32 2, !190, i32 3, i32 0, i32 7, i32 9}
!195 = !{i32 6, !"GeometryIndex", i32 3, i32 64, i32 7, i32 5}
!196 = !{i32 6, !"MeshIndex", i32 3, i32 68, i32 7, i32 5}
!197 = !{i32 16, !198}
!198 = !{i32 6, !"Position", i32 3, i32 0, i32 4, !"SV_POSITION", i32 7, i32 9}
!199 = !{i32 8, !200, !201}
!200 = !{i32 6, !"VertexID", i32 3, i32 0, i32 4, !"SV_VertexID", i32 7, i32 5}
!201 = !{i32 6, !"InstanceID", i32 3, i32 4, i32 4, !"SV_InstanceID", i32 7, i32 5}
!202 = !{i32 100, !203, !204, !205, !206, !207, !208, !209}
!203 = !{i32 6, !"Position", i32 3, i32 0, i32 7, i32 9}
!204 = !{i32 6, !"PositionWS", i32 3, i32 16, i32 7, i32 9}
!205 = !{i32 6, !"NormalWS", i32 3, i32 32, i32 7, i32 9}
!206 = !{i32 6, !"TexCoord", i32 3, i32 48, i32 7, i32 9}
!207 = !{i32 6, !"Colour", i32 3, i32 64, i32 7, i32 9}
!208 = !{i32 6, !"TangentWS", i32 3, i32 80, i32 7, i32 9}
!209 = !{i32 6, !"MaterialID", i32 3, i32 96, i32 7, i32 5}
!210 = !{i32 32, !211, !212, !213, !214, !215, !185, !186, !187}
!211 = !{i32 6, !"VbPositionBufferIndex", i32 3, i32 0, i32 7, i32 5}
!212 = !{i32 6, !"VbTexCoordBufferIndex", i32 3, i32 4, i32 7, i32 5}
!213 = !{i32 6, !"VbNormalBufferIndex", i32 3, i32 8, i32 7, i32 5}
!214 = !{i32 6, !"VbTangentBufferIndex", i32 3, i32 12, i32 7, i32 5}
!215 = !{i32 6, !"Flags", i32 3, i32 16, i32 7, i32 5}
!216 = !{i32 48, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226}
!217 = !{i32 6, !"MaterialIndex", i32 3, i32 0, i32 7, i32 5}
!218 = !{i32 6, !"NumIndices", i32 3, i32 4, i32 7, i32 5}
!219 = !{i32 6, !"NumVertices", i32 3, i32 8, i32 7, i32 5}
!220 = !{i32 6, !"IndexOffset", i32 3, i32 12, i32 7, i32 5}
!221 = !{i32 6, !"VertexBufferIndex", i32 3, i32 16, i32 7, i32 5}
!222 = !{i32 6, !"PositionOffset", i32 3, i32 20, i32 7, i32 5}
!223 = !{i32 6, !"TexCoordOffset", i32 3, i32 24, i32 7, i32 5}
!224 = !{i32 6, !"NormalOffset", i32 3, i32 28, i32 7, i32 5}
!225 = !{i32 6, !"TangentOffset", i32 3, i32 32, i32 7, i32 5}
!226 = !{i32 6, !"_padding", i32 3, i32 36, i32 7, i32 5}
!227 = !{i32 48, !228}
!228 = !{i32 6, !"FrameCB", i32 3, i32 0}
!229 = !{i32 72, !230}
!230 = !{i32 6, !"push", i32 3, i32 0}
!231 = !{i32 1, void ()* @main, !232}
!232 = !{!233}
!233 = !{i32 0, !2, !2}
!234 = !{[7 x i32] [i32 5, i32 4, i32 0, i32 0, i32 0, i32 0, i32 0]}
!235 = !{void ()* @main, !"main", !236, !155, !245}
!236 = !{!237, !242, null}
!237 = !{!238, !241}
!238 = !{i32 0, !"SV_VertexID", i8 5, i8 1, !239, i8 0, i32 1, i8 1, i32 0, i8 0, !240}
!239 = !{i32 0}
!240 = !{i32 3, i32 1}
!241 = !{i32 1, !"SV_InstanceID", i8 5, i8 2, !239, i8 0, i32 1, i8 1, i32 1, i8 0, !240}
!242 = !{!243}
!243 = !{i32 0, !"SV_Position", i8 9, i8 3, !239, i8 4, i32 1, i8 4, i32 0, i8 0, !244}
!244 = !{i32 3, i32 15}
!245 = !{i32 0, i64 17}
!246 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "input", arg: 1, scope: !17, file: !18, line: 87, type: !24)
!247 = !DIExpression(DW_OP_bit_piece, 32, 32)
!248 = !DILocation(line: 87, column: 29, scope: !17)
!249 = !DIExpression(DW_OP_bit_piece, 0, 32)
!250 = !DILocation(line: 90, column: 5, scope: !17)
!251 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "input", arg: 2, scope: !30, file: !18, line: 41, type: !24)
!252 = !DILocation(line: 41, column: 41, scope: !30, inlinedAt: !253)
!253 = distinct !DILocation(line: 90, column: 5, scope: !17)
!254 = !DILocation(line: 44, column: 35, scope: !30, inlinedAt: !253)
!255 = !DILocation(line: 44, column: 16, scope: !30, inlinedAt: !253)
!256 = !DILocation(line: 12, column: 26, scope: !59, inlinedAt: !257)
!257 = distinct !DILocation(line: 47, column: 21, scope: !30, inlinedAt: !253)
!258 = !DILocation(line: 12, column: 12, scope: !59, inlinedAt: !257)
!259 = !{!260, !262}
!260 = distinct !{!260, !261, !"\01?LoadMesh@@YA?AUMesh@@I@Z: %agg.result"}
!261 = distinct !{!261, !"\01?LoadMesh@@YA?AUMesh@@I@Z"}
!262 = distinct !{!262, !263, !"\01?GetMesh@@YA?AUMesh@@XZ: %agg.result"}
!263 = distinct !{!263, !"\01?GetMesh@@YA?AUMesh@@XZ"}
!264 = !DILocation(line: 53, column: 43, scope: !73, inlinedAt: !265)
!265 = distinct !DILocation(line: 12, column: 12, scope: !59, inlinedAt: !257)
!266 = !DILocation(line: 53, column: 71, scope: !73, inlinedAt: !265)
!267 = !DILocation(line: 53, column: 81, scope: !73, inlinedAt: !265)
!268 = !DILocation(line: 53, column: 12, scope: !73, inlinedAt: !265)
!269 = !DILocation(line: 17, column: 30, scope: !90, inlinedAt: !270)
!270 = distinct !DILocation(line: 48, column: 29, scope: !30, inlinedAt: !253)
!271 = !DILocation(line: 17, column: 12, scope: !90, inlinedAt: !270)
!272 = !{!273, !275}
!273 = distinct !{!273, !274, !"\01?LoadGeometry@@YA?AUGeometry@@I@Z: %agg.result"}
!274 = distinct !{!274, !"\01?LoadGeometry@@YA?AUGeometry@@I@Z"}
!275 = distinct !{!275, !276, !"\01?GetGeometry@@YA?AUGeometry@@XZ: %agg.result"}
!276 = distinct !{!276, !"\01?GetGeometry@@YA?AUGeometry@@XZ"}
!277 = !DILocation(line: 58, column: 43, scope: !113, inlinedAt: !278)
!278 = distinct !DILocation(line: 17, column: 12, scope: !90, inlinedAt: !270)
!279 = !DILocation(line: 58, column: 79, scope: !113, inlinedAt: !278)
!280 = !DILocation(line: 58, column: 88, scope: !113, inlinedAt: !278)
!281 = !DILocation(line: 58, column: 12, scope: !113, inlinedAt: !278)
!282 = !DILocation(line: 95, column: 21, scope: !17)
!283 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "geoIndex", arg: 1, scope: !113, file: !74, line: 56, type: !27)
!284 = !DIExpression()
!285 = !DILocation(line: 56, column: 35, scope: !113, inlinedAt: !278)
!286 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "meshIndex", arg: 1, scope: !73, file: !74, line: 51, type: !27)
!287 = !DILocation(line: 51, column: 27, scope: !73, inlinedAt: !265)
!288 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "worldMatrix", scope: !30, file: !18, line: 44, type: !289)
!289 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 44, size: 512, align: 32, elements: !290, templateParams: !307)
!290 = !{!291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !289, file: !1, line: 44, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !289, file: !1, line: 44, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !289, file: !1, line: 44, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !289, file: !1, line: 44, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !289, file: !1, line: 44, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !289, file: !1, line: 44, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !289, file: !1, line: 44, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !289, file: !1, line: 44, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !289, file: !1, line: 44, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !289, file: !1, line: 44, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !289, file: !1, line: 44, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !289, file: !1, line: 44, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !289, file: !1, line: 44, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !289, file: !1, line: 44, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !289, file: !1, line: 44, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !289, file: !1, line: 44, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!307 = !{!13, !308, !309}
!308 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!309 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!310 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mesh", scope: !30, file: !18, line: 47, type: !62)
!311 = !DILocation(line: 47, column: 14, scope: !30, inlinedAt: !253)
!312 = !DIExpression(DW_OP_bit_piece, 64, 32)
!313 = !DIExpression(DW_OP_bit_piece, 96, 32)
!314 = !DIExpression(DW_OP_bit_piece, 128, 32)
!315 = !DIExpression(DW_OP_bit_piece, 160, 32)
!316 = !DIExpression(DW_OP_bit_piece, 192, 32)
!317 = !DIExpression(DW_OP_bit_piece, 224, 32)
!318 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "geometry", scope: !30, file: !18, line: 48, type: !93)
!319 = !DILocation(line: 48, column: 18, scope: !30, inlinedAt: !253)
!320 = !DIExpression(DW_OP_bit_piece, 256, 32)
!321 = !DIExpression(DW_OP_bit_piece, 288, 96)
!322 = !DILocation(line: 117, column: 5, scope: !17)

#endif

const unsigned char gMeshRender_CommonVS[] = {
  0x44, 0x58, 0x42, 0x43, 0x9c, 0xc7, 0xbc, 0xba, 0xe3, 0x50, 0xef, 0x63,
  0xd6, 0x52, 0x7c, 0x53, 0xe3, 0x48, 0xb8, 0x21, 0x01, 0x00, 0x00, 0x00,
  0xca, 0x96, 0x00, 0x00, 0x09, 0x00, 0x00, 0x00, 0x44, 0x00, 0x00, 0x00,
  0x54, 0x00, 0x00, 0x00, 0xbe, 0x00, 0x00, 0x00, 0xfa, 0x00, 0x00, 0x00,
  0xc6, 0x01, 0x00, 0x00, 0x9a, 0x7a, 0x00, 0x00, 0x1a, 0x89, 0x00, 0x00,
  0x4e, 0x89, 0x00, 0x00, 0x6a, 0x89, 0x00, 0x00, 0x53, 0x46, 0x49, 0x30,
  0x08, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x49, 0x53, 0x47, 0x31, 0x62, 0x00, 0x00, 0x00, 0x02, 0x00, 0x00, 0x00,
  0x08, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x48, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x06, 0x00, 0x00, 0x00, 0x01, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x01, 0x01, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x54, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x08, 0x00, 0x00, 0x00, 0x01, 0x00, 0x00, 0x00, 0x01, 0x00, 0x00, 0x00,
  0x01, 0x01, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x53, 0x56, 0x5f, 0x56,
  0x65, 0x72, 0x74, 0x65, 0x78, 0x49, 0x44, 0x00, 0x53, 0x56, 0x5f, 0x49,
  0x6e, 0x73, 0x74, 0x61, 0x6e, 0x63, 0x65, 0x49, 0x44, 0x00, 0x4f, 0x53,
  0x47, 0x31, 0x34, 0x00, 0x00, 0x00, 0x01, 0x00, 0x00, 0x00, 0x08, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x28, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x01, 0x00, 0x00, 0x00, 0x03, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x0f, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x53, 0x56,
  0x5f, 0x50, 0x6f, 0x73, 0x69, 0x74, 0x69, 0x6f, 0x6e, 0x00, 0x50, 0x53,
  0x56, 0x30, 0xc4, 0x00, 0x00, 0x00, 0x24, 0x00, 0x00, 0x00, 0x01, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0xff, 0xff, 0xff, 0xff, 0x01, 0x00,
  0x00, 0x00, 0x02, 0x01, 0x00, 0x02, 0x01, 0x00, 0x00, 0x00, 0x03, 0x00,
  0x00, 0x00, 0x10, 0x00, 0x00, 0x00, 0x02, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x02, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0xe7, 0x03, 0x00, 0x00, 0xe7, 0x03,
  0x00, 0x00, 0x04, 0x00, 0x00, 0x00, 0x64, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x00, 0x00, 0xff, 0xff, 0xff, 0xff, 0x04, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x01, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x10, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x01, 0x00,
  0x41, 0x01, 0x01, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x01, 0x01, 0x41, 0x02, 0x01, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x01, 0x00, 0x44, 0x03, 0x03, 0x04,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x49, 0x4c,
