#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; NORMAL                   0   xyz         0     NONE   float   xyz 
; COLOUR                   0   xyzw        1     NONE   float   xyzw
; TEXCOORD                 0   xy          2     NONE   float   xy  
; TEXCOORD                 1   xyz         3     NONE   float   xyz 
; Position                 0   xyz         4     NONE   float   xyz 
; TANGENT                  0   xyzw        5     NONE   float   xyzw
; MATERIAL                 0   x           6     NONE    uint   x   
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: fcd46aaf84dc46940f1349705105d1a8.pdb
; shader hash: fcd46aaf84dc46940f1349705105d1a8
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; NORMAL                   0                 linear       
; COLOUR                   0                 linear       
; TEXCOORD                 0                 linear       
; TEXCOORD                 1                 linear       

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc 1.2", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !46, globals: !80)
!1 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc\5CPbrDemoPS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !22, !8, !30, !37}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 140, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 140, size: 288, align: 32, elements: !6, templateParams: !17)
!6 = !{!7, !9, !10, !11, !12, !13, !14, !15, !16}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !5, file: !1, line: 140, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !5, file: !1, line: 140, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !5, file: !1, line: 140, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !5, file: !1, line: 140, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !5, file: !1, line: 140, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !5, file: !1, line: 140, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !5, file: !1, line: 140, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !5, file: !1, line: 140, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !5, file: !1, line: 140, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!17 = !{!18, !19, !21}
!18 = !DITemplateTypeParameter(name: "element", type: !8)
!19 = !DITemplateValueParameter(name: "row_count", type: !20, value: i32 3)
!20 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!21 = !DITemplateValueParameter(name: "col_count", type: !20, value: i32 3)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, size: 96, align: 32, elements: !24, templateParams: !28)
!24 = !{!25, !26, !27}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !23, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!28 = !{!18, !29}
!29 = !DITemplateValueParameter(name: "element_count", type: !20, value: i32 3)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !31)
!31 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !32, templateParams: !35)
!32 = !{!33, !34}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !31, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !31, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!35 = !{!18, !36}
!36 = !DITemplateValueParameter(name: "element_count", type: !20, value: i32 2)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !38)
!38 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !39, templateParams: !44)
!39 = !{!40, !41, !42, !43}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !38, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !38, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !38, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !38, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!44 = !{!18, !45}
!45 = !DITemplateValueParameter(name: "element_count", type: !20, value: i32 4)
!46 = !{!47, !61, !65, !68, !71, !74, !77}
!47 = !DISubprogram(name: "main", scope: !1, file: !1, line: 106, type: !48, isLocal: false, isDefinition: true, scopeLine: 107, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!48 = !DISubroutineType(types: !49)
!49 = !{!37, !50}
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "PSInput", file: !1, line: 85, size: 640, align: 32, elements: !51)
!51 = !{!52, !53, !54, !55, !56, !57, !58}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "NormalWS", scope: !50, file: !1, line: 87, baseType: !22, size: 96, align: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !50, file: !1, line: 88, baseType: !37, size: 128, align: 32, offset: 96)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !50, file: !1, line: 89, baseType: !30, size: 64, align: 32, offset: 224)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "ShadowTexCoord", scope: !50, file: !1, line: 90, baseType: !22, size: 96, align: 32, offset: 288)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "PositionWS", scope: !50, file: !1, line: 91, baseType: !22, size: 96, align: 32, offset: 384)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "TangentWS", scope: !50, file: !1, line: 92, baseType: !37, size: 128, align: 32, offset: 480)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "MaterialID", scope: !50, file: !1, line: 93, baseType: !59, size: 32, align: 32, offset: 608)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, baseType: !60)
!60 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!61 = !DISubprogram(name: "DistributionGGX", linkageName: "\01?DistributionGGX@@YAMV?$vector@M$02@@0M@Z", scope: !62, file: !62, line: 16, type: !63, isLocal: false, isDefinition: true, scopeLine: 17, flags: DIFlagPrototyped, isOptimized: false)
!62 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc/BRDFFunctions.hlsli", directory: "")
!63 = !DISubroutineType(types: !64)
!64 = !{!8, !22, !22, !8}
!65 = !DISubprogram(name: "GeometrySmith", linkageName: "\01?GeometrySmith@@YAMV?$vector@M$02@@00M@Z", scope: !62, file: !62, line: 46, type: !66, isLocal: false, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: false)
!66 = !DISubroutineType(types: !67)
!67 = !{!8, !22, !22, !22, !8}
!68 = !DISubprogram(name: "GeometrySchlickGGX", linkageName: "\01?GeometrySchlickGGX@@YAMMM@Z", scope: !62, file: !62, line: 34, type: !69, isLocal: false, isDefinition: true, scopeLine: 35, flags: DIFlagPrototyped, isOptimized: false)
!69 = !DISubroutineType(types: !70)
!70 = !{!8, !8, !8}
!71 = !DISubprogram(name: "FresnelSchlick", linkageName: "\01?FresnelSchlick@@YA?AV?$vector@M$02@@MV1@@Z", scope: !62, file: !62, line: 62, type: !72, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: false)
!72 = !DISubroutineType(types: !73)
!73 = !{!22, !8, !22}
!74 = !DISubprogram(name: "FresnelSchlick", linkageName: "\01?FresnelSchlick@@YA?AV?$vector@M$02@@MV1@M@Z", scope: !62, file: !62, line: 67, type: !75, isLocal: false, isDefinition: true, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: false)
!75 = !DISubroutineType(types: !76)
!76 = !{!22, !8, !22, !8}
!77 = !DISubprogram(name: "GetShadow", linkageName: "\01?GetShadow@@YAMV?$vector@M$02@@@Z", scope: !1, file: !1, line: 100, type: !78, isLocal: false, isDefinition: true, scopeLine: 101, flags: DIFlagPrototyped, isOptimized: false)
!78 = !DISubroutineType(types: !79)
!79 = !{!8, !22}
!80 = !{!81, !83, !84, !100, !104, !108, !111, !114, !116, !117, !119, !120}
!81 = !DIGlobalVariable(name: "Fdielectric", scope: !0, file: !1, line: 97, type: !82, isLocal: true, isDefinition: true, variable: float 0x3FA47AE140000000)
!82 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!83 = !DIGlobalVariable(name: "MaxReflectionLod", scope: !0, file: !1, line: 98, type: !82, isLocal: true, isDefinition: true, variable: float 7.000000e+00)
!84 = !DIGlobalVariable(name: "MaterialsSB", linkageName: "\01?MaterialsSB@@3V?$StructuredBuffer@UMaterial@@@@A", scope: !0, file: !1, line: 73, type: !85, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<Material>"* @"\01?MaterialsSB@@3V?$StructuredBuffer@UMaterial@@@@A")
!85 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<Material>", file: !1, line: 73, size: 384, align: 32, elements: !2, templateParams: !86)
!86 = !{!87}
!87 = !DITemplateTypeParameter(name: "element", type: !88)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !1, line: 49, size: 384, align: 32, elements: !89)
!89 = !{!90, !91, !92, !93, !94, !95, !96, !97, !98, !99}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "AlbedoColour", scope: !88, file: !1, line: 51, baseType: !22, size: 96, align: 32)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "AlbedoTexture", scope: !88, file: !1, line: 52, baseType: !59, size: 32, align: 32, offset: 96)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "MaterialTexture", scope: !88, file: !1, line: 56, baseType: !59, size: 32, align: 32, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "RoughnessTexture", scope: !88, file: !1, line: 57, baseType: !59, size: 32, align: 32, offset: 160)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "MetalnessTexture", scope: !88, file: !1, line: 58, baseType: !59, size: 32, align: 32, offset: 192)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "AOTexture", scope: !88, file: !1, line: 59, baseType: !59, size: 32, align: 32, offset: 224)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "NormalTexture", scope: !88, file: !1, line: 63, baseType: !59, size: 32, align: 32, offset: 256)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "Metalness", scope: !88, file: !1, line: 64, baseType: !8, size: 32, align: 32, offset: 288)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "Roughness", scope: !88, file: !1, line: 65, baseType: !8, size: 32, align: 32, offset: 320)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "AO", scope: !88, file: !1, line: 66, baseType: !8, size: 32, align: 32, offset: 352)
!100 = !DIGlobalVariable(name: "ShadowMap", linkageName: "\01?ShadowMap@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 75, type: !101, isLocal: false, isDefinition: true, variable: %"class.Texture2D<vector<float, 4> >"* @"\01?ShadowMap@@3V?$Texture2D@V?$vector@M$03@@@@A")
!101 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 75, size: 160, align: 32, elements: !2, templateParams: !102)
!102 = !{!103}
!103 = !DITemplateTypeParameter(name: "element", type: !38)
!104 = !DIGlobalVariable(name: "Texture2DTable", linkageName: "\01?Texture2DTable@@3PAV?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 77, type: !105, isLocal: false, isDefinition: true, variable: [0 x %"class.Texture2D<vector<float, 4> >"]* @"\01?Texture2DTable@@3PAV?$Texture2D@V?$vector@M$03@@@@A")
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 160, align: 32, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 1)
!108 = !DIGlobalVariable(name: "TextureCubeTable", linkageName: "\01?TextureCubeTable@@3PAV?$TextureCube@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 78, type: !109, isLocal: false, isDefinition: true, variable: [0 x %"class.TextureCube<vector<float, 4> >"]* @"\01?TextureCubeTable@@3PAV?$TextureCube@V?$vector@M$03@@@@A")
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 128, align: 32, elements: !106)
!110 = !DICompositeType(tag: DW_TAG_class_type, name: "TextureCube<vector<float, 4> >", file: !1, line: 78, size: 128, align: 32, elements: !2, templateParams: !102)
!111 = !DIGlobalVariable(name: "BufferTable", linkageName: "\01?BufferTable@@3PAUByteAddressBuffer@@A", scope: !0, file: !1, line: 79, type: !112, isLocal: false, isDefinition: true)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 32, align: 32, elements: !106)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteAddressBuffer", file: !1, line: 79, size: 32, align: 32, elements: !2)
!114 = !DIGlobalVariable(name: "SamplerDefault", linkageName: "\01?SamplerDefault@@3USamplerState@@A", scope: !0, file: !1, line: 81, type: !115, isLocal: false, isDefinition: true, variable: %struct.SamplerState* @"\01?SamplerDefault@@3USamplerState@@A")
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 81, size: 32, align: 32, elements: !2)
!116 = !DIGlobalVariable(name: "SamplerBrdf", linkageName: "\01?SamplerBrdf@@3USamplerState@@A", scope: !0, file: !1, line: 82, type: !115, isLocal: false, isDefinition: true, variable: %struct.SamplerState* @"\01?SamplerBrdf@@3USamplerState@@A")
!117 = !DIGlobalVariable(name: "ShadowSampler", linkageName: "\01?ShadowSampler@@3USamplerComparisonState@@A", scope: !0, file: !1, line: 83, type: !118, isLocal: false, isDefinition: true, variable: %struct.SamplerComparisonState* @"\01?ShadowSampler@@3USamplerComparisonState@@A")
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerComparisonState", file: !1, line: 83, size: 32, align: 32, elements: !2)
!119 = !DIGlobalVariable(name: "Fdielectric", scope: !0, file: !1, line: 97, type: !82, isLocal: true, isDefinition: true)
!120 = !DIGlobalVariable(name: "MaxReflectionLod", scope: !0, file: !1, line: 98, type: !82, isLocal: true, isDefinition: true)
!121 = !{i32 2, !"Dwarf Version", i32 4}
!122 = !{i32 2, !"Debug Info Version", i32 3}
!123 = !{!"dxc 1.2"}
