#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; NORMAL                   0   xyz         0     NONE   float       
; COLOUR                   0   xyzw        1     NONE   float       
; TEXCOORD                 0   xy          2     NONE   float       
; Position                 0   xyz         3     NONE   float       
; TANGENT                  0   xyzw        4     NONE   float       
; MATERIAL                 0   x           5     NONE    uint       
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: a5650c268da8d64b2fef02b780926eed.pdb
; shader hash: a5650c268da8d64b2fef02b780926eed
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; NORMAL                   0                 linear       
; COLOUR                   0                 linear       
; TEXCOORD                 0                 linear       
; Position                 0                 linear       
; TANGENT                  0                 linear       

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc 1.2", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !45)
!1 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc\5CPbrDemoPS.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17}
!17 = !DISubprogram(name: "main", scope: !1, file: !1, line: 82, type: !18, isLocal: false, isDefinition: true, scopeLine: 83, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!18 = !DISubroutineType(types: !19)
!19 = !{!4, !20}
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "PSInput", file: !1, line: 68, size: 544, align: 32, elements: !21)
!21 = !{!22, !31, !32, !40, !41, !42}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "NormalWS", scope: !20, file: !1, line: 70, baseType: !23, size: 96, align: 32)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, size: 96, align: 32, elements: !25, templateParams: !29)
!25 = !{!26, !27, !28}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !24, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !24, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !24, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!29 = !{!13, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !20, file: !1, line: 71, baseType: !4, size: 128, align: 32, offset: 96)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !20, file: !1, line: 72, baseType: !33, size: 64, align: 32, offset: 224)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !34)
!34 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !35, templateParams: !38)
!35 = !{!36, !37}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !34, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !34, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!38 = !{!13, !39}
!39 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "PositionWS", scope: !20, file: !1, line: 73, baseType: !23, size: 96, align: 32, offset: 288)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "TangentWS", scope: !20, file: !1, line: 74, baseType: !4, size: 128, align: 32, offset: 384)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "MaterialID", scope: !20, file: !1, line: 75, baseType: !43, size: 32, align: 32, offset: 512)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, baseType: !44)
!44 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!45 = !{!46, !62, !69, !72, !74, !75, !77}
!46 = !DIGlobalVariable(name: "MaterialsSB", linkageName: "\01?MaterialsSB@@3V?$StructuredBuffer@UMaterial@@@@A", scope: !0, file: !1, line: 60, type: !47, isLocal: false, isDefinition: true)
!47 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<Material>", file: !1, line: 60, size: 384, align: 32, elements: !2, templateParams: !48)
!48 = !{!49}
!49 = !DITemplateTypeParameter(name: "element", type: !50)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !1, line: 36, size: 384, align: 32, elements: !51)
!51 = !{!52, !53, !54, !55, !56, !57, !58, !59, !60, !61}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "AlbedoColour", scope: !50, file: !1, line: 38, baseType: !23, size: 96, align: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "AlbedoTexture", scope: !50, file: !1, line: 39, baseType: !43, size: 32, align: 32, offset: 96)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "MaterialTexture", scope: !50, file: !1, line: 43, baseType: !43, size: 32, align: 32, offset: 128)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "RoughnessTexture", scope: !50, file: !1, line: 44, baseType: !43, size: 32, align: 32, offset: 160)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "MetalnessTexture", scope: !50, file: !1, line: 45, baseType: !43, size: 32, align: 32, offset: 192)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "AOTexture", scope: !50, file: !1, line: 46, baseType: !43, size: 32, align: 32, offset: 224)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "NormalTexture", scope: !50, file: !1, line: 50, baseType: !43, size: 32, align: 32, offset: 256)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "Metalness", scope: !50, file: !1, line: 51, baseType: !8, size: 32, align: 32, offset: 288)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "Roughness", scope: !50, file: !1, line: 52, baseType: !8, size: 32, align: 32, offset: 320)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "AO", scope: !50, file: !1, line: 53, baseType: !8, size: 32, align: 32, offset: 352)
!62 = !DIGlobalVariable(name: "Texture2DTable", linkageName: "\01?Texture2DTable@@3PAV?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 62, type: !63, isLocal: false, isDefinition: true)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 160, align: 32, elements: !67)
!64 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 62, size: 160, align: 32, elements: !2, templateParams: !65)
!65 = !{!66}
!66 = !DITemplateTypeParameter(name: "element", type: !5)
!67 = !{!68}
!68 = !DISubrange(count: 1)
!69 = !DIGlobalVariable(name: "TextureCubeTable", linkageName: "\01?TextureCubeTable@@3PAV?$TextureCube@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 63, type: !70, isLocal: false, isDefinition: true)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 128, align: 32, elements: !67)
!71 = !DICompositeType(tag: DW_TAG_class_type, name: "TextureCube<vector<float, 4> >", file: !1, line: 63, size: 128, align: 32, elements: !2, templateParams: !65)
!72 = !DIGlobalVariable(name: "SamplerDefault", linkageName: "\01?SamplerDefault@@3USamplerState@@A", scope: !0, file: !1, line: 65, type: !73, isLocal: false, isDefinition: true)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 65, size: 32, align: 32, elements: !2)
!74 = !DIGlobalVariable(name: "SamplerBrdf", linkageName: "\01?SamplerBrdf@@3USamplerState@@A", scope: !0, file: !1, line: 66, type: !73, isLocal: false, isDefinition: true)
!75 = !DIGlobalVariable(name: "Fdielectric", scope: !0, file: !1, line: 79, type: !76, isLocal: true, isDefinition: true)
!76 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!77 = !DIGlobalVariable(name: "MaxReflectionLod", scope: !0, file: !1, line: 80, type: !76, isLocal: true, isDefinition: true)
!78 = !{i32 2, !"Dwarf Version", i32 4}
!79 = !{i32 2, !"Debug Info Version", i32 3}
!80 = !{!"dxc 1.2"}
