#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_VertexID              0   x           0   VERTID    uint   x   
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; NORMAL                   0   xyz         0     NONE   float   xyz 
; COLOUR                   0   xyzw        1     NONE   float   xyzw
; TEXCOORD                 0   xy          2     NONE   float   xy  
; Position                 0   xyz         3     NONE   float   xyz 
; TANGENT                  0   xyzw        4     NONE   float   xyzw
; MATERIAL                 0   x           5     NONE    uint   x   
; SV_Position              0   xyzw        6      POS   float   xyzw
;
; shader debug name: afc199baeed831110a12bffdffd6364d.pdb
; shader hash: afc199baeed831110a12bffdffd6364d
;
; Pipeline Runtime Information: 
;
; Vertex Shader
; OutputPositionPresent=1
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_VertexID              0                              
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; NORMAL                   0                 linear       

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc 1.2", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !31, globals: !61)
!1 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc\5CPbrDemoVS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !16}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 118, baseType: !17)
!17 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 118, size: 288, align: 32, elements: !18, templateParams: !28)
!18 = !{!19, !20, !21, !22, !23, !24, !25, !26, !27}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !17, file: !1, line: 118, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !17, file: !1, line: 118, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !17, file: !1, line: 118, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !17, file: !1, line: 118, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !17, file: !1, line: 118, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !17, file: !1, line: 118, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !17, file: !1, line: 118, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !17, file: !1, line: 118, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !17, file: !1, line: 118, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!28 = !{!13, !29, !30}
!29 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 3)
!30 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 3)
!31 = !{!32}
!32 = !DISubprogram(name: "main", scope: !1, file: !1, line: 92, type: !33, isLocal: false, isDefinition: true, scopeLine: 94, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!33 = !DISubroutineType(types: !34)
!34 = !{!35, !58}
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "VsOutput", file: !1, line: 81, size: 672, align: 32, elements: !36)
!36 = !{!37, !46, !47, !55, !56, !57, !60}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "NormalWS", scope: !35, file: !1, line: 83, baseType: !38, size: 96, align: 32)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, baseType: !39)
!39 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, size: 96, align: 32, elements: !40, templateParams: !44)
!40 = !{!41, !42, !43}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !39, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !39, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !39, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!44 = !{!13, !45}
!45 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !35, file: !1, line: 84, baseType: !4, size: 128, align: 32, offset: 96)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !35, file: !1, line: 85, baseType: !48, size: 64, align: 32, offset: 224)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !49)
!49 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !50, templateParams: !53)
!50 = !{!51, !52}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !49, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !49, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!53 = !{!13, !54}
!54 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "PositionWS", scope: !35, file: !1, line: 86, baseType: !38, size: 96, align: 32, offset: 288)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "TangentWS", scope: !35, file: !1, line: 87, baseType: !4, size: 128, align: 32, offset: 384)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "MaterialID", scope: !35, file: !1, line: 88, baseType: !58, size: 32, align: 32, offset: 512)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, baseType: !59)
!59 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !35, file: !1, line: 89, baseType: !4, size: 128, align: 32, offset: 544)
!61 = !{!62, !94, !112}
!62 = !DIGlobalVariable(name: "MeshInstanceSB", linkageName: "\01?MeshInstanceSB@@3V?$StructuredBuffer@UMeshInstanceData@@@@A", scope: !0, file: !1, line: 67, type: !63, isLocal: false, isDefinition: true)
!63 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<MeshInstanceData>", file: !1, line: 67, size: 640, align: 32, elements: !2, templateParams: !64)
!64 = !{!65}
!65 = !DITemplateTypeParameter(name: "element", type: !66)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshInstanceData", file: !1, line: 50, size: 640, align: 32, elements: !67)
!67 = !{!68, !69, !70, !71, !72}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "FirstGeometryIndex", scope: !66, file: !1, line: 52, baseType: !58, size: 32, align: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "NumGeometries", scope: !66, file: !1, line: 53, baseType: !58, size: 32, align: 32, offset: 32)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_padding", scope: !66, file: !1, line: 54, baseType: !58, size: 32, align: 32, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_padding1", scope: !66, file: !1, line: 55, baseType: !58, size: 32, align: 32, offset: 96)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "Transform", scope: !66, file: !1, line: 59, baseType: !73, size: 512, align: 32, offset: 128)
!73 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 97, size: 512, align: 32, elements: !74, templateParams: !91)
!74 = !{!75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !73, file: !1, line: 97, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !73, file: !1, line: 97, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !73, file: !1, line: 97, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !73, file: !1, line: 97, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !73, file: !1, line: 97, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !73, file: !1, line: 97, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !73, file: !1, line: 97, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !73, file: !1, line: 97, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !73, file: !1, line: 97, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !73, file: !1, line: 97, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !73, file: !1, line: 97, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !73, file: !1, line: 97, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !73, file: !1, line: 97, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !73, file: !1, line: 97, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !73, file: !1, line: 97, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !73, file: !1, line: 97, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!91 = !{!13, !92, !93}
!92 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!93 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!94 = !DIGlobalVariable(name: "GeometrySB", linkageName: "\01?GeometrySB@@3V?$StructuredBuffer@UGeometryData@@@@A", scope: !0, file: !1, line: 68, type: !95, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<GeometryData>"* @"\01?GeometrySB@@3V?$StructuredBuffer@UGeometryData@@@@A")
!95 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<GeometryData>", file: !1, line: 68, size: 384, align: 32, elements: !2, templateParams: !96)
!96 = !{!97}
!97 = !DITemplateTypeParameter(name: "element", type: !98)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "GeometryData", file: !1, line: 26, size: 384, align: 32, elements: !99)
!99 = !{!100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "NumIndices", scope: !98, file: !1, line: 28, baseType: !58, size: 32, align: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "NumVertices", scope: !98, file: !1, line: 29, baseType: !58, size: 32, align: 32, offset: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "IndexBufferIndex", scope: !98, file: !1, line: 30, baseType: !58, size: 32, align: 32, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "IndexOffset", scope: !98, file: !1, line: 31, baseType: !58, size: 32, align: 32, offset: 96)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "VertexBufferIndex", scope: !98, file: !1, line: 35, baseType: !15, size: 32, align: 32, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "PositionOffset", scope: !98, file: !1, line: 36, baseType: !58, size: 32, align: 32, offset: 160)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoordOffset", scope: !98, file: !1, line: 37, baseType: !58, size: 32, align: 32, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "NormalOffset", scope: !98, file: !1, line: 38, baseType: !58, size: 32, align: 32, offset: 224)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "TangentOffset", scope: !98, file: !1, line: 42, baseType: !58, size: 32, align: 32, offset: 256)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "MaterialIndex", scope: !98, file: !1, line: 43, baseType: !58, size: 32, align: 32, offset: 288)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_padding", scope: !98, file: !1, line: 44, baseType: !58, size: 32, align: 32, offset: 320)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_padding1", scope: !98, file: !1, line: 45, baseType: !58, size: 32, align: 32, offset: 352)
!112 = !DIGlobalVariable(name: "BufferTable", linkageName: "\01?BufferTable@@3PAUByteAddressBuffer@@A", scope: !0, file: !1, line: 70, type: !113, isLocal: false, isDefinition: true, variable: [0 x %struct.ByteAddressBuffer]* @"\01?BufferTable@@3PAUByteAddressBuffer@@A")
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 32, align: 32, elements: !115)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteAddressBuffer", file: !1, line: 100, size: 32, align: 32, elements: !2)
!115 = !{!116}
!116 = !DISubrange(count: 1)
!117 = !{i32 2, !"Dwarf Version", i32 4}
!118 = !{i32 2, !"Debug Info Version", i32 3}
!119 = !{!"dxc 1.2"}
