#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_VertexID              0   x           0   VERTID    uint   x   
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; NORMAL                   0   xyz         0     NONE   float   xyz 
; COLOUR                   0   xyzw        1     NONE   float   xyzw
; TEXCOORD                 0   xy          2     NONE   float   xy  
; TEXCOORD                 1   xyz         3     NONE   float   xyz 
; Position                 0   xyz         4     NONE   float   xyz 
; TANGENT                  0   xyzw        5     NONE   float   xyzw
; MATERIAL                 0   x           6     NONE    uint   x   
; SV_Position              0   xyzw        7      POS   float   xyzw
;
; shader debug name: afd54c2c7ea02cee16d43fb1b4009597.pdb
; shader hash: afd54c2c7ea02cee16d43fb1b4009597
;
; Pipeline Runtime Information: 
;
; Vertex Shader
; OutputPositionPresent=1
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_VertexID              0                              
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc 1.2", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !31, globals: !62)
!1 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CPhoenix-Engine\5CShaders\5CSrc\5CPbrDemoVS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !16}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 124, baseType: !17)
!17 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 124, size: 288, align: 32, elements: !18, templateParams: !28)
!18 = !{!19, !20, !21, !22, !23, !24, !25, !26, !27}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !17, file: !1, line: 124, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !17, file: !1, line: 124, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !17, file: !1, line: 124, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !17, file: !1, line: 124, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !17, file: !1, line: 124, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !17, file: !1, line: 124, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !17, file: !1, line: 124, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !17, file: !1, line: 124, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !17, file: !1, line: 124, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!28 = !{!13, !29, !30}
!29 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 3)
!30 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 3)
!31 = !{!32}
!32 = !DISubprogram(name: "main", scope: !1, file: !1, line: 97, type: !33, isLocal: false, isDefinition: true, scopeLine: 99, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!33 = !DISubroutineType(types: !34)
!34 = !{!35, !59}
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "VsOutput", file: !1, line: 85, size: 768, align: 32, elements: !36)
!36 = !{!37, !46, !47, !55, !56, !57, !58, !61}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "NormalWS", scope: !35, file: !1, line: 87, baseType: !38, size: 96, align: 32)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, baseType: !39)
!39 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, size: 96, align: 32, elements: !40, templateParams: !44)
!40 = !{!41, !42, !43}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !39, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !39, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !39, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!44 = !{!13, !45}
!45 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !35, file: !1, line: 88, baseType: !4, size: 128, align: 32, offset: 96)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !35, file: !1, line: 89, baseType: !48, size: 64, align: 32, offset: 224)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !49)
!49 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !50, templateParams: !53)
!50 = !{!51, !52}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !49, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !49, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!53 = !{!13, !54}
!54 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "ShadowTexCoord", scope: !35, file: !1, line: 90, baseType: !38, size: 96, align: 32, offset: 288)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "PositionWS", scope: !35, file: !1, line: 91, baseType: !38, size: 96, align: 32, offset: 384)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "TangentWS", scope: !35, file: !1, line: 92, baseType: !4, size: 128, align: 32, offset: 480)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "MaterialID", scope: !35, file: !1, line: 93, baseType: !59, size: 32, align: 32, offset: 608)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, baseType: !60)
!60 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !35, file: !1, line: 94, baseType: !4, size: 128, align: 32, offset: 640)
!62 = !{!63, !95, !113}
!63 = !DIGlobalVariable(name: "MeshInstanceSB", linkageName: "\01?MeshInstanceSB@@3V?$StructuredBuffer@UMeshInstanceData@@@@A", scope: !0, file: !1, line: 80, type: !64, isLocal: false, isDefinition: true)
!64 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<MeshInstanceData>", file: !1, line: 80, size: 640, align: 32, elements: !2, templateParams: !65)
!65 = !{!66}
!66 = !DITemplateTypeParameter(name: "element", type: !67)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshInstanceData", file: !1, line: 63, size: 640, align: 32, elements: !68)
!68 = !{!69, !70, !71, !72, !73}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "FirstGeometryIndex", scope: !67, file: !1, line: 65, baseType: !59, size: 32, align: 32)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "NumGeometries", scope: !67, file: !1, line: 66, baseType: !59, size: 32, align: 32, offset: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_padding", scope: !67, file: !1, line: 67, baseType: !59, size: 32, align: 32, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_padding1", scope: !67, file: !1, line: 68, baseType: !59, size: 32, align: 32, offset: 96)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "Transform", scope: !67, file: !1, line: 72, baseType: !74, size: 512, align: 32, offset: 128)
!74 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 102, size: 512, align: 32, elements: !75, templateParams: !92)
!75 = !{!76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !74, file: !1, line: 102, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !74, file: !1, line: 102, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !74, file: !1, line: 102, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !74, file: !1, line: 102, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !74, file: !1, line: 102, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !74, file: !1, line: 102, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !74, file: !1, line: 102, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !74, file: !1, line: 102, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !74, file: !1, line: 102, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !74, file: !1, line: 102, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !74, file: !1, line: 102, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !74, file: !1, line: 102, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !74, file: !1, line: 102, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !74, file: !1, line: 102, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !74, file: !1, line: 102, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !74, file: !1, line: 102, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!92 = !{!13, !93, !94}
!93 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!94 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!95 = !DIGlobalVariable(name: "GeometrySB", linkageName: "\01?GeometrySB@@3V?$StructuredBuffer@UGeometryData@@@@A", scope: !0, file: !1, line: 81, type: !96, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<GeometryData>"* @"\01?GeometrySB@@3V?$StructuredBuffer@UGeometryData@@@@A")
!96 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<GeometryData>", file: !1, line: 81, size: 384, align: 32, elements: !2, templateParams: !97)
!97 = !{!98}
!98 = !DITemplateTypeParameter(name: "element", type: !99)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "GeometryData", file: !1, line: 39, size: 384, align: 32, elements: !100)
!100 = !{!101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "NumIndices", scope: !99, file: !1, line: 41, baseType: !59, size: 32, align: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "NumVertices", scope: !99, file: !1, line: 42, baseType: !59, size: 32, align: 32, offset: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "IndexBufferIndex", scope: !99, file: !1, line: 43, baseType: !59, size: 32, align: 32, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "IndexOffset", scope: !99, file: !1, line: 44, baseType: !59, size: 32, align: 32, offset: 96)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "VertexBufferIndex", scope: !99, file: !1, line: 48, baseType: !15, size: 32, align: 32, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "PositionOffset", scope: !99, file: !1, line: 49, baseType: !59, size: 32, align: 32, offset: 160)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoordOffset", scope: !99, file: !1, line: 50, baseType: !59, size: 32, align: 32, offset: 192)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "NormalOffset", scope: !99, file: !1, line: 51, baseType: !59, size: 32, align: 32, offset: 224)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "TangentOffset", scope: !99, file: !1, line: 55, baseType: !59, size: 32, align: 32, offset: 256)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "MaterialIndex", scope: !99, file: !1, line: 56, baseType: !59, size: 32, align: 32, offset: 288)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_padding", scope: !99, file: !1, line: 57, baseType: !59, size: 32, align: 32, offset: 320)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_padding1", scope: !99, file: !1, line: 58, baseType: !59, size: 32, align: 32, offset: 352)
!113 = !DIGlobalVariable(name: "BufferTable", linkageName: "\01?BufferTable@@3PAUByteAddressBuffer@@A", scope: !0, file: !1, line: 83, type: !114, isLocal: false, isDefinition: true, variable: [0 x %struct.ByteAddressBuffer]* @"\01?BufferTable@@3PAUByteAddressBuffer@@A")
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 32, align: 32, elements: !116)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteAddressBuffer", file: !1, line: 105, size: 32, align: 32, elements: !2)
!116 = !{!117}
!117 = !DISubrange(count: 1)
!118 = !{i32 2, !"Dwarf Version", i32 4}
!119 = !{i32 2, !"Debug Info Version", i32 3}
!120 = !{!"dxc 1.2"}
